#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LiufangzheCommon

#include "Basic.hpp"

#include "ELiufangzheWeaponType_structs.hpp"
#include "KuroAnim_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_MonsterCommon_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_LiufangzheCommon.ABP_LiufangzheCommon_C
// 0x5650 (0x8560 - 0x2F10)
class UABP_LiufangzheCommon_C : public UABP_MonsterCommon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ABP_LiufangzheCommon_C;             // 0x2F08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1_ABP_LiufangzheCommon_C;       // 0x2F10(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ABP_LiufangzheCommon_C; // 0x2F48(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_ABP_LiufangzheCommon_C; // 0x2F68(0x0020)()
	struct FAnimNode_Feedback                     AnimGraphNode_Feedback_ABP_LiufangzheCommon_C;     // 0x2F88(0x0278)()
	struct FAnimNode_SightLock                    AnimGraphNode_SightLock_ABP_LiufangzheCommon_C;    // 0x3200(0x01D0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_ABP_LiufangzheCommon_C; // 0x33D0(0x0138)()
	struct FAnimNode_BoneRotateToLocation         AnimGraphNode_BoneRotateToLocation_ABP_LiufangzheCommon_C; // 0x3508(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root_ABP_LiufangzheCommon_C;         // 0x3640(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x3678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x36A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x36C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x36F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x3718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x3740(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x3768(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x3798(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x37D0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x3860(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x38F0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x3980(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x3A10(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x3AA0(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_7;                    // 0x3B30(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x3BE0(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3_ABP_LiufangzheCommon_C; // 0x3C18(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x3C48(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x3C80(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x3DC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x3DF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x3E18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x3E40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x3E68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x3E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x3EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x3EE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x3F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x3F30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x3F58(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x3F80(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x4010(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x40A0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x4130(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x41C0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x4250(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_6;                    // 0x42E0(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x4390(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x43C8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x4458(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x44E8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x4578(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x4608(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x4698(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_5;                    // 0x4728(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x47D8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x4810(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x48A0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x4930(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x49C0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x4A50(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x4AE0(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_4;                    // 0x4B70(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x4C20(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x4C58(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x4CE8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x4D78(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x4E08(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x4E98(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x4F28(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x4FB8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x5068(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2_ABP_LiufangzheCommon_C; // 0x50A0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x50D0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4_ABP_LiufangzheCommon_C; // 0x5108(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x5250(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3_ABP_LiufangzheCommon_C; // 0x5400(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x55B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26_ABP_LiufangzheCommon_C; // 0x55D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25_ABP_LiufangzheCommon_C; // 0x5600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24_ABP_LiufangzheCommon_C; // 0x5628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23_ABP_LiufangzheCommon_C; // 0x5650(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22_ABP_LiufangzheCommon_C; // 0x5678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21_ABP_LiufangzheCommon_C; // 0x56A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20_ABP_LiufangzheCommon_C; // 0x56C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19_ABP_LiufangzheCommon_C; // 0x56F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18_ABP_LiufangzheCommon_C; // 0x5718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17_ABP_LiufangzheCommon_C; // 0x5740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16_ABP_LiufangzheCommon_C; // 0x5768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15_ABP_LiufangzheCommon_C; // 0x5790(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14_ABP_LiufangzheCommon_C; // 0x57B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13_ABP_LiufangzheCommon_C; // 0x57E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12_ABP_LiufangzheCommon_C; // 0x5808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11_ABP_LiufangzheCommon_C; // 0x5830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10_ABP_LiufangzheCommon_C; // 0x5858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9_ABP_LiufangzheCommon_C; // 0x5880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8_ABP_LiufangzheCommon_C; // 0x58A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7_ABP_LiufangzheCommon_C; // 0x58D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6_ABP_LiufangzheCommon_C; // 0x58F8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x5920(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x59B0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x5A40(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x5AD0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14_ABP_LiufangzheCommon_C; // 0x5B90(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5_ABP_LiufangzheCommon_C; // 0x5BC8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13_ABP_LiufangzheCommon_C; // 0x5BF0(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12_ABP_LiufangzheCommon_C; // 0x5C28(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x5C60(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11_ABP_LiufangzheCommon_C; // 0x5CF0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x5D28(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10_ABP_LiufangzheCommon_C; // 0x5DB8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x5DF0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x5E80(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x5F10(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x5FA0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9_ABP_LiufangzheCommon_C; // 0x6060(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x6098(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x6128(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x61B8(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x6248(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8_ABP_LiufangzheCommon_C; // 0x6308(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4_ABP_LiufangzheCommon_C; // 0x6340(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x6368(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x63F8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x6488(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x6518(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x65A8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x6638(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x66C8(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7_ABP_LiufangzheCommon_C; // 0x6788(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1_ABP_LiufangzheCommon_C; // 0x67C0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6_ABP_LiufangzheCommon_C; // 0x67F0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3_ABP_LiufangzheCommon_C; // 0x6828(0x0148)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x6970(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x6A00(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x6A90(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x6B20(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x6BB0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x6C40(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x6CD0(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5_ABP_LiufangzheCommon_C; // 0x6D80(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x6DB8(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x6E48(0x00D8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x6F20(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x6F58(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x6FE8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x7078(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10_ABP_LiufangzheCommon_C; // 0x7108(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9_ABP_LiufangzheCommon_C; // 0x7198(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8_ABP_LiufangzheCommon_C; // 0x7228(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x72B8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4_ABP_LiufangzheCommon_C; // 0x7368(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2_ABP_LiufangzheCommon_C; // 0x73A0(0x0148)()
	uint8                                         Pad_74E8[0x8];                                     // 0x74E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2_ABP_LiufangzheCommon_C; // 0x74F0(0x01B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2_ABP_LiufangzheCommon_C;       // 0x76A0(0x0060)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_ABP_LiufangzheCommon_C; // 0x7700(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1_ABP_LiufangzheCommon_C;       // 0x77C0(0x0060)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1_ABP_LiufangzheCommon_C; // 0x7820(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3_ABP_LiufangzheCommon_C; // 0x79D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2_ABP_LiufangzheCommon_C; // 0x79F8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_ABP_LiufangzheCommon_C;         // 0x7A20(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7_ABP_LiufangzheCommon_C; // 0x7A80(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3_ABP_LiufangzheCommon_C; // 0x7B10(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_ABP_LiufangzheCommon_C; // 0x7B48(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2_ABP_LiufangzheCommon_C; // 0x7B78(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1_ABP_LiufangzheCommon_C; // 0x7BB0(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1_ABP_LiufangzheCommon_C; // 0x7CF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ABP_LiufangzheCommon_C; // 0x7D20(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6_ABP_LiufangzheCommon_C; // 0x7D48(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5_ABP_LiufangzheCommon_C; // 0x7DD8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4_ABP_LiufangzheCommon_C; // 0x7E68(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3_ABP_LiufangzheCommon_C; // 0x7EF8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2_ABP_LiufangzheCommon_C; // 0x7F88(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1_ABP_LiufangzheCommon_C; // 0x8018(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x80A8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1_ABP_LiufangzheCommon_C; // 0x8158(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ABP_LiufangzheCommon_C; // 0x8190(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_ABP_LiufangzheCommon_C;  // 0x8220(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_ABP_LiufangzheCommon_C; // 0x8258(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_ABP_LiufangzheCommon_C; // 0x83A0(0x01B0)()
	bool                                          撬棍_0;                                            // 0x8550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          喷火器_0;                                          // 0x8551(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          电锯_0;                                            // 0x8552(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          电刃_0;                                            // 0x8553(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          狙击枪_0;                                          // 0x8554(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ELiufangzheWeaponType                         武器类型;                                          // 0x8555(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          流放者男;                                          // 0x8556(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          流放者女;                                          // 0x8557(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_LiufangzheCommon(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_TransitionResult_52C450844EBF9BFBB8282B9C6B941D1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_TransitionResult_C823D0574DC7BFFD1486B185FB74217D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_TransitionResult_8E52222C4F7CCA4D8A2BD6955D653104();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_BlendListByInt_0E3C99E146C38005332675958239B31D();
