#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LiufangzheCommon

#include "Basic.hpp"

#include "ABP_MonsterCommon_classes.hpp"
#include "KuroAnim_structs.hpp"
#include "Engine_structs.hpp"
#include "ELiufangzheWeaponType_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_LiufangzheCommon.ABP_LiufangzheCommon_C
// 0x5610 (0x9BB0 - 0x45A0)
class UABP_LiufangzheCommon_C : public UABP_MonsterCommon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ABP_LiufangzheCommon_C;             // 0x4598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1_ABP_LiufangzheCommon_C;       // 0x45A0(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ABP_LiufangzheCommon_C; // 0x45D8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_ABP_LiufangzheCommon_C; // 0x45F8(0x0020)()
	struct FAnimNode_Feedback                     AnimGraphNode_Feedback_ABP_LiufangzheCommon_C;     // 0x4618(0x0260)()
	struct FAnimNode_SightLock                    AnimGraphNode_SightLock_ABP_LiufangzheCommon_C;    // 0x4878(0x01B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_ABP_LiufangzheCommon_C; // 0x4A30(0x0138)()
	struct FAnimNode_BoneRotateToLocation         AnimGraphNode_BoneRotateToLocation_ABP_LiufangzheCommon_C; // 0x4B68(0x0120)()
	struct FAnimNode_Root                         AnimGraphNode_Root_ABP_LiufangzheCommon_C;         // 0x4C88(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44_ABP_LiufangzheCommon_C; // 0x4CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43_ABP_LiufangzheCommon_C; // 0x4CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42_ABP_LiufangzheCommon_C; // 0x4D10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41_ABP_LiufangzheCommon_C; // 0x4D38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40_ABP_LiufangzheCommon_C; // 0x4D60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39_ABP_LiufangzheCommon_C; // 0x4D88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x4DB0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22_ABP_LiufangzheCommon_C; // 0x4DE0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x4E18(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x4EA8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x4F38(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x4FC8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x5058(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x50E8(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_7;                    // 0x5178(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21_ABP_LiufangzheCommon_C; // 0x5228(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3_ABP_LiufangzheCommon_C; // 0x5260(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20_ABP_LiufangzheCommon_C; // 0x5290(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x52C8(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38_ABP_LiufangzheCommon_C; // 0x5410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37_ABP_LiufangzheCommon_C; // 0x5438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36_ABP_LiufangzheCommon_C; // 0x5460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35_ABP_LiufangzheCommon_C; // 0x5488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34_ABP_LiufangzheCommon_C; // 0x54B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33_ABP_LiufangzheCommon_C; // 0x54D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32_ABP_LiufangzheCommon_C; // 0x5500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31_ABP_LiufangzheCommon_C; // 0x5528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30_ABP_LiufangzheCommon_C; // 0x5550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29_ABP_LiufangzheCommon_C; // 0x5578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28_ABP_LiufangzheCommon_C; // 0x55A0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x55C8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x5658(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x56E8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x5778(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x5808(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x5898(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_6;                    // 0x5928(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19_ABP_LiufangzheCommon_C; // 0x59D8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x5A10(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x5AA0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x5B30(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x5BC0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x5C50(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x5CE0(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_5;                    // 0x5D70(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18_ABP_LiufangzheCommon_C; // 0x5E20(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x5E58(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x5EE8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x5F78(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x6008(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x6098(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x6128(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_4;                    // 0x61B8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17_ABP_LiufangzheCommon_C; // 0x6268(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x62A0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x6330(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x63C0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x6450(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x64E0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x6570(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x6600(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16_ABP_LiufangzheCommon_C; // 0x66B0(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2_ABP_LiufangzheCommon_C; // 0x66E8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15_ABP_LiufangzheCommon_C; // 0x6718(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4_ABP_LiufangzheCommon_C; // 0x6750(0x0148)()
	uint8                                         Pad_6898[0x8];                                     // 0x6898(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x68A0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3_ABP_LiufangzheCommon_C; // 0x6A50(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27_ABP_LiufangzheCommon_C; // 0x6C00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26_ABP_LiufangzheCommon_C; // 0x6C28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25_ABP_LiufangzheCommon_C; // 0x6C50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24_ABP_LiufangzheCommon_C; // 0x6C78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23_ABP_LiufangzheCommon_C; // 0x6CA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22_ABP_LiufangzheCommon_C; // 0x6CC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21_ABP_LiufangzheCommon_C; // 0x6CF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20_ABP_LiufangzheCommon_C; // 0x6D18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19_ABP_LiufangzheCommon_C; // 0x6D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18_ABP_LiufangzheCommon_C; // 0x6D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17_ABP_LiufangzheCommon_C; // 0x6D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16_ABP_LiufangzheCommon_C; // 0x6DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15_ABP_LiufangzheCommon_C; // 0x6DE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14_ABP_LiufangzheCommon_C; // 0x6E08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13_ABP_LiufangzheCommon_C; // 0x6E30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12_ABP_LiufangzheCommon_C; // 0x6E58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11_ABP_LiufangzheCommon_C; // 0x6E80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10_ABP_LiufangzheCommon_C; // 0x6EA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9_ABP_LiufangzheCommon_C; // 0x6ED0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8_ABP_LiufangzheCommon_C; // 0x6EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7_ABP_LiufangzheCommon_C; // 0x6F20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6_ABP_LiufangzheCommon_C; // 0x6F48(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37_ABP_LiufangzheCommon_C; // 0x6F70(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36_ABP_LiufangzheCommon_C; // 0x7000(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35_ABP_LiufangzheCommon_C; // 0x7090(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3_ABP_LiufangzheCommon_C; // 0x7120(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14_ABP_LiufangzheCommon_C; // 0x71E0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5_ABP_LiufangzheCommon_C; // 0x7218(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13_ABP_LiufangzheCommon_C; // 0x7240(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12_ABP_LiufangzheCommon_C; // 0x7278(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34_ABP_LiufangzheCommon_C; // 0x72B0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11_ABP_LiufangzheCommon_C; // 0x7340(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33_ABP_LiufangzheCommon_C; // 0x7378(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10_ABP_LiufangzheCommon_C; // 0x7408(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32_ABP_LiufangzheCommon_C; // 0x7440(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31_ABP_LiufangzheCommon_C; // 0x74D0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30_ABP_LiufangzheCommon_C; // 0x7560(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2_ABP_LiufangzheCommon_C; // 0x75F0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9_ABP_LiufangzheCommon_C; // 0x76B0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29_ABP_LiufangzheCommon_C; // 0x76E8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28_ABP_LiufangzheCommon_C; // 0x7778(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27_ABP_LiufangzheCommon_C; // 0x7808(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1_ABP_LiufangzheCommon_C; // 0x7898(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8_ABP_LiufangzheCommon_C; // 0x7958(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4_ABP_LiufangzheCommon_C; // 0x7990(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26_ABP_LiufangzheCommon_C; // 0x79B8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25_ABP_LiufangzheCommon_C; // 0x7A48(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24_ABP_LiufangzheCommon_C; // 0x7AD8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23_ABP_LiufangzheCommon_C; // 0x7B68(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22_ABP_LiufangzheCommon_C; // 0x7BF8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21_ABP_LiufangzheCommon_C; // 0x7C88(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_ABP_LiufangzheCommon_C; // 0x7D18(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7_ABP_LiufangzheCommon_C; // 0x7DD8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1_ABP_LiufangzheCommon_C; // 0x7E10(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6_ABP_LiufangzheCommon_C; // 0x7E40(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3_ABP_LiufangzheCommon_C; // 0x7E78(0x0148)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20_ABP_LiufangzheCommon_C; // 0x7FC0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19_ABP_LiufangzheCommon_C; // 0x8050(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18_ABP_LiufangzheCommon_C; // 0x80E0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17_ABP_LiufangzheCommon_C; // 0x8170(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16_ABP_LiufangzheCommon_C; // 0x8200(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15_ABP_LiufangzheCommon_C; // 0x8290(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x8320(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5_ABP_LiufangzheCommon_C; // 0x83D0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14_ABP_LiufangzheCommon_C; // 0x8408(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x8498(0x00D8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x8570(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13_ABP_LiufangzheCommon_C; // 0x85A8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12_ABP_LiufangzheCommon_C; // 0x8638(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11_ABP_LiufangzheCommon_C; // 0x86C8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10_ABP_LiufangzheCommon_C; // 0x8758(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9_ABP_LiufangzheCommon_C; // 0x87E8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8_ABP_LiufangzheCommon_C; // 0x8878(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x8908(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4_ABP_LiufangzheCommon_C; // 0x89B8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2_ABP_LiufangzheCommon_C; // 0x89F0(0x0148)()
	uint8                                         Pad_8B38[0x8];                                     // 0x8B38(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2_ABP_LiufangzheCommon_C; // 0x8B40(0x01B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2_ABP_LiufangzheCommon_C;       // 0x8CF0(0x0060)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_ABP_LiufangzheCommon_C; // 0x8D50(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1_ABP_LiufangzheCommon_C;       // 0x8E10(0x0060)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1_ABP_LiufangzheCommon_C; // 0x8E70(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3_ABP_LiufangzheCommon_C; // 0x9020(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2_ABP_LiufangzheCommon_C; // 0x9048(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_ABP_LiufangzheCommon_C;         // 0x9070(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7_ABP_LiufangzheCommon_C; // 0x90D0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3_ABP_LiufangzheCommon_C; // 0x9160(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_ABP_LiufangzheCommon_C; // 0x9198(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2_ABP_LiufangzheCommon_C; // 0x91C8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1_ABP_LiufangzheCommon_C; // 0x9200(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1_ABP_LiufangzheCommon_C; // 0x9348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ABP_LiufangzheCommon_C; // 0x9370(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6_ABP_LiufangzheCommon_C; // 0x9398(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5_ABP_LiufangzheCommon_C; // 0x9428(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4_ABP_LiufangzheCommon_C; // 0x94B8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3_ABP_LiufangzheCommon_C; // 0x9548(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2_ABP_LiufangzheCommon_C; // 0x95D8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1_ABP_LiufangzheCommon_C; // 0x9668(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x96F8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1_ABP_LiufangzheCommon_C; // 0x97A8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ABP_LiufangzheCommon_C; // 0x97E0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_ABP_LiufangzheCommon_C;  // 0x9870(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_ABP_LiufangzheCommon_C; // 0x98A8(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_ABP_LiufangzheCommon_C; // 0x99F0(0x01B0)()
	bool                                          ___0;                                              // 0x9BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _kh_0;                                             // 0x9BA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _0;                                                // 0x9BA2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Five__0;                                           // 0x9BA3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ____0;                                             // 0x9BA4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ELiufangzheWeaponType                         Fh__;                                              // 0x9BA5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          A__7;                                              // 0x9BA6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          A__s;                                              // 0x9BA7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void IKAndFk_Clone(const struct FPoseLink& InPose, struct FPoseLink* IKAndFk_Clone_0);
	void AnimGraph(struct FPoseLink* Param_AnimGraph_0);
	void ______Tag();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_BoneRotateToLocation_1980760A423198CC6ADEF49705FC9B54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_Feedback_1110F51F47BAC0E6EDD68BB579A50C8A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_BlendListByInt_79A63DAC4F1506CACEC0A5829047958E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_BlendListByInt_C904936E4A91604CE61911B883E94EAD();
