#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_EZhezhiMaobi

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroAnim_structs.hpp"
#include "KuroAnim_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_EZhezhiMaobi.ABP_EZhezhiMaobi_C
// 0x0D80 (0x1210 - 0x0490)
class UABP_EZhezhiMaobi_C final : public UKuroAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0498(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04B8(0x0020)()
	uint8                                         Pad_4D8[0x8];                                      // 0x04D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x04E0(0x0270)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0750(0x0038)()
	uint8                                         Pad_788[0x8];                                      // 0x0788(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ExtraFollowAnims             AnimGraphNode_ExtraFollowAnims;                    // 0x0790(0x0A50)()
	class ATsBaseCharacter_C*                     _r__;                                              // 0x11E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          AnimInstance;                                      // 0x11E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DaMaobi;                                           // 0x11F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ____Minus;                                         // 0x11F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11F9[0x7];                                     // 0x11F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimaryDataAsset*                      HideEffect;                                        // 0x1200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     SM_r;                                              // 0x1208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ___();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void OnComponentStart();
	void ExecuteUbergraph_ABP_EZhezhiMaobi(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_EZhezhiMaobi_C">();
	}
	static class UABP_EZhezhiMaobi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_EZhezhiMaobi_C>();
	}
};
static_assert(alignof(UABP_EZhezhiMaobi_C) == 0x000010, "Wrong alignment on UABP_EZhezhiMaobi_C");
static_assert(sizeof(UABP_EZhezhiMaobi_C) == 0x001210, "Wrong size on UABP_EZhezhiMaobi_C");
static_assert(offsetof(UABP_EZhezhiMaobi_C, UberGraphFrame) == 0x000490, "Member 'UABP_EZhezhiMaobi_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_ComponentToLocalSpace) == 0x000498, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_LocalToComponentSpace) == 0x0004B8, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_KawaiiPhysics) == 0x0004E0, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_Root) == 0x000750, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_ExtraFollowAnims) == 0x000790, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_ExtraFollowAnims' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, _r__) == 0x0011E0, "Member 'UABP_EZhezhiMaobi_C::_r__' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimInstance) == 0x0011E8, "Member 'UABP_EZhezhiMaobi_C::AnimInstance' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, DaMaobi) == 0x0011F0, "Member 'UABP_EZhezhiMaobi_C::DaMaobi' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, ____Minus) == 0x0011F8, "Member 'UABP_EZhezhiMaobi_C::____Minus' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, HideEffect) == 0x001200, "Member 'UABP_EZhezhiMaobi_C::HideEffect' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, SM_r) == 0x001208, "Member 'UABP_EZhezhiMaobi_C::SM_r' has a wrong offset!");

}

