#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Device_Common

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EWeaponViewName_structs.hpp"


namespace SDK::Params
{

// Function ABP_Device_Common.ABP_Device_Common_C.ExecuteUbergraph_ABP_Device_Common
// 0x0118 (0x0118 - 0x0000)
struct ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCurrentWeaponHideEffectPlaying_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_12;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_13;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_14;                // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_15;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_15;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_16;               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_16;                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_17;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_2; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_18;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_17;                // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_18;                // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_19;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_19;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_20;               // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_20;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_21;               // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_3; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_21;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_22;                // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_23;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_22;               // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_23;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_24;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_24;               // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_25;               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_26;               // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_25;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_27;               // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_26;                // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_28;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_16;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_17;       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_27;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_29;               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_18;       // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_30;               // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_28;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_19;       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_29;                // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_20;       // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_30;                // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_21;       // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_22;       // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_23;       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_31;               // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_24;       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_32;               // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_25;       // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_31;                // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentWeaponHangState_ReturnValue;    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_26;       // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_33;               // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_34;               // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_35;               // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_36;               // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_32;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_37;               // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetUiWeaponBreachLevel_ReturnValue;       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWeaponBreachLevel_ReturnValue;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponViewName                               CallFunc_GetWeaponViewName_ReturnValue;            // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_As_______;                      // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_1;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowUiWepaonEffect_ReturnValue;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsUiSceneRoleActor_C*                  K2Node_DynamicCast_AsTs_Ui_Scene_Role_Actor;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_38;               // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_27;       // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common) == 0x000008, "Wrong alignment on ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common");
static_assert(sizeof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common) == 0x000118, "Wrong size on ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, EntryPoint) == 0x000000, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_GetIsCurrentWeaponHideEffectPlaying_ReturnValue) == 0x000004, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_GetIsCurrentWeaponHideEffectPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000007, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_1) == 0x000008, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_2) == 0x000009, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_1) == 0x00000A, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000B, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_3) == 0x00000C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00000D, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000010, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_4) == 0x000014, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Less_FloatFloat_ReturnValue) == 0x000015, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_2) == 0x000016, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_3) == 0x000017, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_5) == 0x000018, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_6) == 0x000019, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_4) == 0x00001A, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_7) == 0x00001B, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00001C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_5) == 0x00001D, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanOR_ReturnValue) == 0x00001E, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001F, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_8) == 0x000020, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_6) == 0x000021, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_9) == 0x000022, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_7) == 0x000023, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_8) == 0x000024, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1) == 0x000028, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_9) == 0x00002D, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanOR_ReturnValue_1) == 0x00002E, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_10) == 0x00002F, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000030, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000031, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_10) == 0x000032, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_11) == 0x000033, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000034, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_11) == 0x000035, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x000036, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanOR_ReturnValue_2) == 0x000037, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_12) == 0x000038, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x000039, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x00003A, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_12) == 0x00003B, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_13) == 0x00003C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_13) == 0x00003D, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_14) == 0x00003E, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_14) == 0x00003F, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_15) == 0x000040, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_15) == 0x000041, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_16) == 0x000042, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_16) == 0x000043, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_17) == 0x000044, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_2) == 0x000048, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_18) == 0x00004C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00004D, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_17) == 0x00004E, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_18) == 0x00004F, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_19) == 0x000050, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_19) == 0x000051, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000052, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_20) == 0x000053, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_20) == 0x000054, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_21) == 0x000055, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_3) == 0x000058, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_21) == 0x00005C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00005D, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_22) == 0x00005E, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanOR_ReturnValue_3) == 0x00005F, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_23) == 0x000060, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x000061, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x000062, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_22) == 0x000063, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_23) == 0x000064, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_24) == 0x000065, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_12) == 0x000066, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_24) == 0x000067, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_13) == 0x000068, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_14) == 0x000069, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_25) == 0x00006A, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_26) == 0x00006B, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_25) == 0x00006C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_15) == 0x00006D, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_27) == 0x00006E, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_26) == 0x00006F, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_28) == 0x000070, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_16) == 0x000071, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_17) == 0x000072, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanOR_ReturnValue_4) == 0x000073, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_27) == 0x000074, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_29) == 0x000075, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_18) == 0x000076, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_30) == 0x000077, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_28) == 0x000078, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_19) == 0x000079, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_29) == 0x00007A, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_20) == 0x00007B, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanOR_ReturnValue_5) == 0x00007C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_30) == 0x00007D, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_21) == 0x00007E, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_22) == 0x00007F, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanOR_ReturnValue_6) == 0x000080, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_23) == 0x000081, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanOR_ReturnValue_7) == 0x000082, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_31) == 0x000083, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_24) == 0x000084, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_32) == 0x000085, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_25) == 0x000086, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_31) == 0x000087, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, K2Node_Event_DeltaTimeX) == 0x000088, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_IsValid_ReturnValue) == 0x00008C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_GetCurrentWeaponHangState_ReturnValue) == 0x000090, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_GetCurrentWeaponHangState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000094, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_EqualEqual_ByteByte_ReturnValue_26) == 0x000095, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_EqualEqual_ByteByte_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_33) == 0x000096, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000097, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue) == 0x000098, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_34) == 0x000099, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_34' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_35) == 0x00009A, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_35' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Not_PreBool_ReturnValue_36) == 0x00009B, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Not_PreBool_ReturnValue_36' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanAND_ReturnValue_32) == 0x00009C, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanAND_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_BooleanOR_ReturnValue_8) == 0x00009D, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x00009E, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A0, "Member 'ABP_Device_Common_C_ExecuteUbergraph_ABP_Device_Common::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
