#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_EZhezhiMaobi

#include "Basic.hpp"

#include "KuroAnim_structs.hpp"
#include "KuroAnim_classes.hpp"
#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_EZhezhiMaobi.ABP_EZhezhiMaobi_C
// 0x0D90 (0x1490 - 0x0700)
class UABP_EZhezhiMaobi_C final : public UKuroAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0708(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0728(0x0020)()
	uint8                                         Pad_748[0x8];                                      // 0x0748(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0750(0x0280)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09D0(0x0038)()
	uint8                                         Pad_A08[0x8];                                      // 0x0A08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ExtraFollowAnims             AnimGraphNode_ExtraFollowAnims;                    // 0x0A10(0x0A50)()
	class ATsBaseCharacter_C*                     角色蓝图;                                          // 0x1460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          AnimInstance;                                      // 0x1468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DaMaobi;                                           // 0x1470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          毛笔显示中;                                        // 0x1478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1479[0x7];                                     // 0x1479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimaryDataAsset*                      HideEffect;                                        // 0x1480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     当前角色;                                          // 0x1488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_EZhezhiMaobi(int32 EntryPoint);
	void OnComponentStart();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void 初始化();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_EZhezhiMaobi_C">();
	}
	static class UABP_EZhezhiMaobi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_EZhezhiMaobi_C>();
	}
};
static_assert(alignof(UABP_EZhezhiMaobi_C) == 0x000010, "Wrong alignment on UABP_EZhezhiMaobi_C");
static_assert(sizeof(UABP_EZhezhiMaobi_C) == 0x001490, "Wrong size on UABP_EZhezhiMaobi_C");
static_assert(offsetof(UABP_EZhezhiMaobi_C, UberGraphFrame) == 0x000700, "Member 'UABP_EZhezhiMaobi_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_ComponentToLocalSpace) == 0x000708, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_LocalToComponentSpace) == 0x000728, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_KawaiiPhysics) == 0x000750, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_Root) == 0x0009D0, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimGraphNode_ExtraFollowAnims) == 0x000A10, "Member 'UABP_EZhezhiMaobi_C::AnimGraphNode_ExtraFollowAnims' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, 角色蓝图) == 0x001460, "Member 'UABP_EZhezhiMaobi_C::角色蓝图' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, AnimInstance) == 0x001468, "Member 'UABP_EZhezhiMaobi_C::AnimInstance' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, DaMaobi) == 0x001470, "Member 'UABP_EZhezhiMaobi_C::DaMaobi' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, 毛笔显示中) == 0x001478, "Member 'UABP_EZhezhiMaobi_C::毛笔显示中' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, HideEffect) == 0x001480, "Member 'UABP_EZhezhiMaobi_C::HideEffect' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobi_C, 当前角色) == 0x001488, "Member 'UABP_EZhezhiMaobi_C::当前角色' has a wrong offset!");

}

