#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Zhezhi_He

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Zhezhi_He.ABP_Zhezhi_He_C
// 0x00A0 (0x0450 - 0x03B0)
class UABP_Zhezhi_He_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B8(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03F0(0x0060)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_Zhezhi_He(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Zhezhi_He_C">();
	}
	static class UABP_Zhezhi_He_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Zhezhi_He_C>();
	}
};
static_assert(alignof(UABP_Zhezhi_He_C) == 0x000010, "Wrong alignment on UABP_Zhezhi_He_C");
static_assert(sizeof(UABP_Zhezhi_He_C) == 0x000450, "Wrong size on UABP_Zhezhi_He_C");
static_assert(offsetof(UABP_Zhezhi_He_C, UberGraphFrame) == 0x0003B0, "Member 'UABP_Zhezhi_He_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Zhezhi_He_C, AnimGraphNode_Root) == 0x0003B8, "Member 'UABP_Zhezhi_He_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Zhezhi_He_C, AnimGraphNode_Slot) == 0x0003F0, "Member 'UABP_Zhezhi_He_C::AnimGraphNode_Slot' has a wrong offset!");

}

