#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_R2T1PlayerMaleMd10011_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroAnim_structs.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_R2T1PlayerMaleMd10011_PC.ABP_R2T1PlayerMaleMd10011_PC_C
// 0x14E0 (0x19F0 - 0x0510)
class UABP_R2T1PlayerMaleMd10011_PC_C final : public UAnimInstance
{
public:
	uint8                                         Pad_332F[0x8];                                     // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0518(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0550(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0688(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x06A8(0x0020)()
	uint8                                         Pad_3330[0x8];                                     // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_MountBuffer                  AnimGraphNode_MountBuffer;                         // 0x06D0(0x01D0)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_5;                // 0x08A0(0x0280)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_4;                // 0x0B20(0x0280)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_3;                // 0x0DA0(0x0280)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_2;                // 0x1020(0x0280)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_1;                // 0x12A0(0x0280)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup;                  // 0x1520(0x0280)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x17A0(0x0038)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x17D8(0x00A8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1880(0x00C0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x1940(0x00A8)()
	bool                                          PhysicsClothSimulateEnable;                        // 0x19E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3331[0x3];                                     // 0x19E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PhysicsClothSimulateScale;                         // 0x19EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PhyCloth(const struct FPoseLink& InPose, struct FPoseLink* Param_PhyCloth);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void UpdatePhysicsClothSimulateEnable(float DeltaTIme);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_R2T1PlayerMaleMd10011_PC(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_R2T1PlayerMaleMd10011_PC_C">();
	}
	static class UABP_R2T1PlayerMaleMd10011_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_R2T1PlayerMaleMd10011_PC_C>();
	}
};
static_assert(alignof(UABP_R2T1PlayerMaleMd10011_PC_C) == 0x000010, "Wrong alignment on UABP_R2T1PlayerMaleMd10011_PC_C");
static_assert(sizeof(UABP_R2T1PlayerMaleMd10011_PC_C) == 0x0019F0, "Wrong size on UABP_R2T1PlayerMaleMd10011_PC_C");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, UberGraphFrame) == 0x000510, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_Root_1) == 0x000518, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_LinkedInputPose) == 0x000550, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_LocalToComponentSpace) == 0x000688, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_ComponentToLocalSpace) == 0x0006A8, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_MountBuffer) == 0x0006D0, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_MountBuffer' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_5) == 0x0008A0, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_5' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_4) == 0x000B20, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_4' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_3) == 0x000DA0, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_3' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_2) == 0x001020, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_2' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_1) == 0x0012A0, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_1' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup) == 0x001520, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_Root) == 0x0017A0, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0017D8, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_LinkedAnimLayer) == 0x001880, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, AnimGraphNode_LinkedAnimGraph) == 0x001940, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, PhysicsClothSimulateEnable) == 0x0019E8, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::PhysicsClothSimulateEnable' has a wrong offset!");
static_assert(offsetof(UABP_R2T1PlayerMaleMd10011_PC_C, PhysicsClothSimulateScale) == 0x0019EC, "Member 'UABP_R2T1PlayerMaleMd10011_PC_C::PhysicsClothSimulateScale' has a wrong offset!");

}

