#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LiufangzheCommon

#include "Basic.hpp"

#include "KuroAnim_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_LiufangzheCommon.ABP_LiufangzheCommon_C.ExecuteUbergraph_ABP_LiufangzheCommon
// 0x00B8 (0x00B8 - 0x0000)
struct ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTime_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTime_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTime_ReturnValue_2;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_3;             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_5;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_16;       // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_6;          // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_7;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitBones                              K2Node_MakeStruct_HitBones;                        // 0x0098(0x0010)()
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon) == 0x000008, "Wrong alignment on ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon");
static_assert(sizeof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon) == 0x0000B8, "Wrong size on ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, EntryPoint) == 0x000000, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000004, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000007, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000008, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x00000C, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000011, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_1) == 0x000013, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_2) == 0x000014, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_3) == 0x000015, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_GetRelevantAnimTime_ReturnValue) == 0x000018, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_GetRelevantAnimTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00001E, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000020, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000024, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Less_FloatFloat_ReturnValue) == 0x000025, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_1) == 0x000026, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000027, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000028, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x00002D, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x00002E, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x00002F, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_4) == 0x000030, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x000031, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000034, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_5) == 0x000038, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x00003C, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000040, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x000041, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_12) == 0x000042, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_6) == 0x000043, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_2) == 0x000044, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_GetRelevantAnimTime_ReturnValue_1) == 0x000048, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_GetRelevantAnimTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x00004C, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000050, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000051, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_3) == 0x000052, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000053, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x000054, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_7) == 0x000055, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_13) == 0x000056, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_4) == 0x000057, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_5) == 0x000058, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_GetRelevantAnimTime_ReturnValue_2) == 0x00005C, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_GetRelevantAnimTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_6) == 0x000060, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000061, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_7) == 0x000062, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_14) == 0x000063, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x000064, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_IntToByte_ReturnValue) == 0x000065, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_15) == 0x000066, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_8) == 0x000067, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Not_PreBool_ReturnValue_1) == 0x000068, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_9) == 0x000069, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00006A, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x00006B, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanAND_ReturnValue_10) == 0x00006C, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanAND_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_IntToByte_ReturnValue_3) == 0x00006D, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_IntToByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000070, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000074, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000078, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_NotEqual_ByteByte_ReturnValue_5) == 0x00007C, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_NotEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_EqualEqual_ByteByte_ReturnValue_16) == 0x00007D, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_EqualEqual_ByteByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_NotEqual_ByteByte_ReturnValue_6) == 0x00007E, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_NotEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000080, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_NotEqual_ByteByte_ReturnValue_7) == 0x000084, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_NotEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000088, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00008C, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000090, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_8) == 0x000094, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, K2Node_MakeStruct_HitBones) == 0x000098, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::K2Node_MakeStruct_HitBones' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_9) == 0x0000A8, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_SelectFloat_ReturnValue) == 0x0000AC, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, CallFunc_BooleanOR_ReturnValue_10) == 0x0000B0, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon, K2Node_Event_DeltaTimeX) == 0x0000B4, "Member 'ABP_LiufangzheCommon_C_ExecuteUbergraph_ABP_LiufangzheCommon::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function ABP_LiufangzheCommon.ABP_LiufangzheCommon_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_LiufangzheCommon_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_LiufangzheCommon_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_LiufangzheCommon_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_LiufangzheCommon_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_LiufangzheCommon_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_LiufangzheCommon_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_LiufangzheCommon_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_LiufangzheCommon.ABP_LiufangzheCommon_C.IKAndFk_Clone
// 0x0020 (0x0020 - 0x0000)
struct ABP_LiufangzheCommon_C_IKAndFk_Clone final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              IKAndFk_Clone_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_LiufangzheCommon_C_IKAndFk_Clone) == 0x000008, "Wrong alignment on ABP_LiufangzheCommon_C_IKAndFk_Clone");
static_assert(sizeof(ABP_LiufangzheCommon_C_IKAndFk_Clone) == 0x000020, "Wrong size on ABP_LiufangzheCommon_C_IKAndFk_Clone");
static_assert(offsetof(ABP_LiufangzheCommon_C_IKAndFk_Clone, InPose) == 0x000000, "Member 'ABP_LiufangzheCommon_C_IKAndFk_Clone::InPose' has a wrong offset!");
static_assert(offsetof(ABP_LiufangzheCommon_C_IKAndFk_Clone, IKAndFk_Clone_0) == 0x000010, "Member 'ABP_LiufangzheCommon_C_IKAndFk_Clone::IKAndFk_Clone_0' has a wrong offset!");

// Function ABP_LiufangzheCommon.ABP_LiufangzheCommon_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_LiufangzheCommon_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph_0;                                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_LiufangzheCommon_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_LiufangzheCommon_C_AnimGraph");
static_assert(sizeof(ABP_LiufangzheCommon_C_AnimGraph) == 0x000010, "Wrong size on ABP_LiufangzheCommon_C_AnimGraph");
static_assert(offsetof(ABP_LiufangzheCommon_C_AnimGraph, Param_AnimGraph_0) == 0x000000, "Member 'ABP_LiufangzheCommon_C_AnimGraph::Param_AnimGraph_0' has a wrong offset!");

}

