#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BaseRole

#include "Basic.hpp"

#include "KuroAnim_structs.hpp"
#include "KuroAnim_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BaseRole.ABP_BaseRole_C
// 0x20E30 (0x21970 - 0x0B40)
class UABP_BaseRole_C : public UKuroAnimInstanceRole
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x0B48(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x0B78(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0BA8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_519;                // 0x0BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_518;                // 0x0C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_517;                // 0x0C30(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_25;                    // 0x0C58(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x0D30(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x0D60(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_270;                     // 0x0D90(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x0DC8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_269;                     // 0x0DF8(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_268;                     // 0x0E30(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_52;                     // 0x0E68(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x0FB0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_27;                  // 0x1160(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_26;                  // 0x1298(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x13D0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_25;                  // 0x1580(0x0138)()
	uint8                                         Pad_16B8[0x8];                                     // 0x16B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x16C0(0x01B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x1870(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x18A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x18C8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_24;                  // 0x18E8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1A20(0x0128)()
	struct FAnimNode_SightLock                    AnimGraphNode_SightLock;                           // 0x1B48(0x01D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x1D18(0x00B0)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_16;                    // 0x1DC8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x1E18(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_516;                // 0x1E48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_515;                // 0x1E70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_514;                // 0x1E98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_513;                // 0x1EC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_512;                // 0x1EE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_511;                // 0x1F10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_510;                // 0x1F38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_509;                // 0x1F60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_508;                // 0x1F88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_507;                // 0x1FB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_506;                // 0x1FD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_505;                // 0x2000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_504;                // 0x2028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_503;                // 0x2050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_502;                // 0x2078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_501;                // 0x20A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_500;                // 0x20C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_499;                // 0x20F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x2118(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x2148(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_15;                    // 0x2178(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_267;                     // 0x21C8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x2200(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_14;                    // 0x2230(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x2280(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_266;                     // 0x22B0(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x22E8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x2318(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_13;                    // 0x2348(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_265;                     // 0x2398(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x23D0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x2400(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_12;                    // 0x2430(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_264;                     // 0x2480(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x24B8(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_11;                    // 0x24E8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x2538(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_263;                     // 0x2568(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x25A0(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_10;                    // 0x25D0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x2620(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_262;                     // 0x2650(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_51;                     // 0x2688(0x0148)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x27D0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x2800(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x29B0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0x2B60(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x2D10(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_23;                  // 0x2EC0(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_22;                  // 0x2FF8(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_21;                  // 0x3130(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_20;                  // 0x3268(0x0138)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x33A0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x33D0(0x01B0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7;                       // 0x3580(0x00C8)()
	uint8                                         Pad_3648[0x8];                                     // 0x3648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x3650(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x3800(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x39B0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_19;                  // 0x3B60(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x3C98(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x3DD0(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x3F08(0x0038)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot_1;                      // 0x3F40(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x3FF0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x40A0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x4100(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x4160(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x41C0(0x0060)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x4220(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x4358(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x4390(0x0020)()
	struct FAnimNode_MorphTargetModifier          AnimGraphNode_MorphTargetModifier;                 // 0x43B0(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x4410(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x4538(0x0128)()
	struct FAnimNode_FeedbackRotate               AnimGraphNode_FeedbackRotate;                      // 0x4660(0x0320)()
	struct FAnimNode_KuroHumanIK                  AnimGraphNode_KuroHumanIK;                         // 0x4980(0x0230)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x4BB0(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x4BE8(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x4D20(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x4ED0(0x0138)()
	uint8                                         Pad_5008[0x8];                                     // 0x5008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x5010(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x51C0(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x52F8(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x5430(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x5568(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x56A0(0x0138)()
	uint8                                         Pad_57D8[0x8];                                     // 0x57D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x57E0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x5990(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x5B40(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x5CF0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x5EA0(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x6050(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x6080(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x60B0(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_6;                       // 0x60E0(0x00C8)()
	uint8                                         Pad_61A8[0x8];                                     // 0x61A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x61B0(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_498;                // 0x6360(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_497;                // 0x6388(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_496;                // 0x63B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_495;                // 0x63D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_494;                // 0x6400(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_493;                // 0x6428(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_492;                // 0x6450(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_491;                // 0x6478(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_490;                // 0x64A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_489;                // 0x64C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_488;                // 0x64F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_487;                // 0x6518(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_486;                // 0x6540(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_485;                // 0x6568(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_484;                // 0x6590(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_483;                // 0x65B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_482;                // 0x65E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_481;                // 0x6608(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_480;                // 0x6630(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_479;                // 0x6658(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_478;                // 0x6680(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_477;                // 0x66A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_476;                // 0x66D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_475;                // 0x66F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x6720(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_9;                     // 0x6750(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x67A0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x67D0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x6800(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_261;                     // 0x6830(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x6868(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_8;                     // 0x6898(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x68E8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x6918(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x6948(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_260;                     // 0x6978(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x69B0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x69E0(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_7;                     // 0x6A10(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x6A60(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x6A90(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_259;                     // 0x6AC0(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x6AF8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x6B28(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_6;                     // 0x6B58(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x6BA8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x6BD8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_258;                     // 0x6C08(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x6C40(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x6C70(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_5;                     // 0x6CA0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x6CF0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x6D20(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_257;                     // 0x6D50(0x0038)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_4;                     // 0x6D88(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x6DD8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x6E08(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x6E38(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x6E68(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_256;                     // 0x6E98(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_50;                     // 0x6ED0(0x0148)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x7018(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_24;                    // 0x70C8(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_181;                  // 0x71A0(0x0090)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x7230(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x7268(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x73A0(0x0138)()
	uint8                                         Pad_74D8[0x8];                                     // 0x74D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x74E0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x7690(0x01B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x7840(0x0060)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_474;                // 0x78A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_473;                // 0x78C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_472;                // 0x78F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_471;                // 0x7918(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_470;                // 0x7940(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_469;                // 0x7968(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_468;                // 0x7990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_467;                // 0x79B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_466;                // 0x79E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x7A08(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_255;                     // 0x7A38(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_465;                // 0x7A70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x7A98(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_254;                     // 0x7AC8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x7B00(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x7B30(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x7B60(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0x7B90(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_253;                     // 0x7C50(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_49;                     // 0x7C88(0x0148)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_180;                  // 0x7DD0(0x0090)()
	struct FAnimNode_CombineCurves                AnimGraphNode_CombineCurves;                       // 0x7E60(0x0060)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x7EC0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x8070(0x0138)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x81A8(0x0070)()
	uint8                                         Pad_8218[0x8];                                     // 0x8218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RBF                          AnimGraphNode_RBF;                                 // 0x8220(0x0150)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x8370(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x83A8(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x84E0(0x0138)()
	uint8                                         Pad_8618[0x8];                                     // 0x8618(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x8620(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x87D0(0x01B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x8980(0x0138)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x8AB8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x8AE8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x8B18(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x8C50(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x8E00(0x0030)()
	struct FAnimNode_AdditiveBoneBlend            AnimGraphNode_AdditiveBoneBlend;                   // 0x8E30(0x01B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x8FE8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_179;                  // 0x9020(0x0090)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x90B0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_464;                // 0x90E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_463;                // 0x9110(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_462;                // 0x9138(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_461;                // 0x9160(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_460;                // 0x9188(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_459;                // 0x91B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_458;                // 0x91D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_457;                // 0x9200(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_456;                // 0x9228(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_455;                // 0x9250(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_454;                // 0x9278(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_178;                  // 0x92A0(0x0090)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_35;                 // 0x9330(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_23;                    // 0x9428(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_252;                     // 0x9500(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x9538(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_251;                     // 0x9568(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_453;                // 0x95A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_452;                // 0x95C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_451;                // 0x95F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_450;                // 0x9618(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_177;                  // 0x9640(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_250;                     // 0x96D0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_176;                  // 0x9708(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_249;                     // 0x9798(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_175;                  // 0x97D0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_248;                     // 0x9860(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_174;                  // 0x9898(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_247;                     // 0x9928(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_48;                     // 0x9960(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_246;                     // 0x9AA8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_449;                // 0x9AE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_448;                // 0x9B08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_447;                // 0x9B30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_446;                // 0x9B58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x9B80(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_173;                  // 0x9BB0(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_22;                    // 0x9C40(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_245;                     // 0x9D18(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x9D50(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_172;                  // 0x9D80(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_21;                    // 0x9E10(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_244;                     // 0x9EE8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x9F20(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x9F50(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_171;                  // 0x9F80(0x0090)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5;                       // 0xA010(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_20;                    // 0xA0D8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_243;                     // 0xA1B0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_47;                     // 0xA1E8(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_242;                     // 0xA330(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_445;                // 0xA368(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_170;                  // 0xA390(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_241;                     // 0xA420(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_46;                     // 0xA458(0x0148)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0xA5A0(0x0060)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_34;                 // 0xA600(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_240;                     // 0xA6F8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_45;                     // 0xA730(0x0148)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0xA878(0x0138)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0xA9B0(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0xAB60(0x01B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0xAD10(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_444;                // 0xAD48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_443;                // 0xAD70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_442;                // 0xAD98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_441;                // 0xADC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_440;                // 0xADE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_439;                // 0xAE10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_438;                // 0xAE38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_437;                // 0xAE60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_436;                // 0xAE88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_435;                // 0xAEB0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0xAED8(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xB000(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xB020(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_19;                    // 0xB040(0x00D8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_434;                // 0xB118(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_433;                // 0xB140(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_432;                // 0xB168(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_431;                // 0xB190(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_430;                // 0xB1B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_429;                // 0xB1E0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_169;                  // 0xB208(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_168;                  // 0xB298(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_167;                  // 0xB328(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_166;                  // 0xB3B8(0x0090)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_3;                     // 0xB448(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_239;                     // 0xB498(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_238;                     // 0xB4D0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_165;                  // 0xB508(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_164;                  // 0xB598(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_163;                  // 0xB628(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_162;                  // 0xB6B8(0x0090)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_2;                     // 0xB748(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_237;                     // 0xB798(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_44;                     // 0xB7D0(0x0148)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_161;                  // 0xB918(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_236;                     // 0xB9A8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_428;                // 0xB9E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_427;                // 0xBA08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_426;                // 0xBA30(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_235;                     // 0xBA58(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_160;                  // 0xBA90(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_234;                     // 0xBB20(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_33;                 // 0xBB58(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_233;                     // 0xBC50(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_32;                 // 0xBC88(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_232;                     // 0xBD80(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_43;                     // 0xBDB8(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_231;                     // 0xBF00(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_425;                // 0xBF38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_424;                // 0xBF60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_423;                // 0xBF88(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_159;                  // 0xBFB0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_230;                     // 0xC040(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_422;                // 0xC078(0x0028)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_3;               // 0xC0A0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_229;                     // 0xC1A0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_158;                  // 0xC1D8(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_18;                    // 0xC268(0x00D8)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_2;               // 0xC340(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_228;                     // 0xC440(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_42;                     // 0xC478(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_227;                     // 0xC5C0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_421;                // 0xC5F8(0x0028)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_1;               // 0xC620(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_226;                     // 0xC720(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_157;                  // 0xC758(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_17;                    // 0xC7E8(0x00D8)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator;                 // 0xC8C0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_225;                     // 0xC9C0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_41;                     // 0xC9F8(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_224;                     // 0xCB40(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_40;                     // 0xCB78(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_223;                     // 0xCCC0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_420;                // 0xCCF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_419;                // 0xCD20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_418;                // 0xCD48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_417;                // 0xCD70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_416;                // 0xCD98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_415;                // 0xCDC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_414;                // 0xCDE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_413;                // 0xCE10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_412;                // 0xCE38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_411;                // 0xCE60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_410;                // 0xCE88(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_156;                  // 0xCEB0(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_16;                    // 0xCF40(0x00D8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_31;                 // 0xD018(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_222;                     // 0xD110(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_409;                // 0xD148(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_155;                  // 0xD170(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_221;                     // 0xD200(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_408;                // 0xD238(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_30;                 // 0xD260(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_220;                     // 0xD358(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_219;                     // 0xD390(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_154;                  // 0xD3C8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_218;                     // 0xD458(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_29;                 // 0xD490(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_217;                     // 0xD588(0x0038)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_28;                 // 0xD5C0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_216;                     // 0xD6B8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_39;                     // 0xD6F0(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_215;                     // 0xD838(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0xD870(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_153;                  // 0xD8D0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_214;                     // 0xD960(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_407;                // 0xD998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_406;                // 0xD9C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_405;                // 0xD9E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_404;                // 0xDA10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_403;                // 0xDA38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_402;                // 0xDA60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_401;                // 0xDA88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_400;                // 0xDAB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_399;                // 0xDAD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_398;                // 0xDB00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_397;                // 0xDB28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_396;                // 0xDB50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_395;                // 0xDB78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_394;                // 0xDBA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_393;                // 0xDBC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_392;                // 0xDBF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_391;                // 0xDC18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_390;                // 0xDC40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_389;                // 0xDC68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_388;                // 0xDC90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_387;                // 0xDCB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_386;                // 0xDCE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_385;                // 0xDD08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_384;                // 0xDD30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_383;                // 0xDD58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_382;                // 0xDD80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_381;                // 0xDDA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_380;                // 0xDDD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_379;                // 0xDDF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_378;                // 0xDE20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_377;                // 0xDE48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_376;                // 0xDE70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_375;                // 0xDE98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_374;                // 0xDEC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_373;                // 0xDEE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_372;                // 0xDF10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_371;                // 0xDF38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_370;                // 0xDF60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_369;                // 0xDF88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_368;                // 0xDFB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_367;                // 0xDFD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_366;                // 0xE000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_365;                // 0xE028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_364;                // 0xE050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_363;                // 0xE078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_362;                // 0xE0A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_361;                // 0xE0C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_360;                // 0xE0F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_359;                // 0xE118(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_358;                // 0xE140(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_357;                // 0xE168(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_356;                // 0xE190(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_355;                // 0xE1B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_354;                // 0xE1E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_353;                // 0xE208(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_352;                // 0xE230(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_351;                // 0xE258(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_350;                // 0xE280(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_349;                // 0xE2A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_348;                // 0xE2D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_347;                // 0xE2F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_346;                // 0xE320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_345;                // 0xE348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_344;                // 0xE370(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_343;                // 0xE398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_342;                // 0xE3C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_341;                // 0xE3E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_340;                // 0xE410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_339;                // 0xE438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_338;                // 0xE460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_337;                // 0xE488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_336;                // 0xE4B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_335;                // 0xE4D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_334;                // 0xE500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_333;                // 0xE528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_332;                // 0xE550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_331;                // 0xE578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_330;                // 0xE5A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_329;                // 0xE5C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_328;                // 0xE5F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_327;                // 0xE618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_326;                // 0xE640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_325;                // 0xE668(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_324;                // 0xE690(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_323;                // 0xE6B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_322;                // 0xE6E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_321;                // 0xE708(0x0028)()
