#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SwordSwordCommon_PC

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SwordSwordCommon_PC.ABP_SwordSwordCommon_PC_C
// 0x03C0 (0x0770 - 0x03B0)
class UABP_SwordSwordCommon_PC_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B8(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03F0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0410(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0430(0x0270)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x06A0(0x00A8)()
	class ATsBaseCharacter_C*                     _r__;                                              // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponOpen;                                        // 0x0750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x3];                                      // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Open_Delay;                                        // 0x0754(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time;                                        // 0x0758(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fh___;                                             // 0x075C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          __s_fh;                                            // 0x075D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsUI;                                              // 0x075E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75F[0x1];                                      // 0x075F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Fh_4I_;                                            // 0x0760(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_SwordSwordCommon_PC(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_SwordSwordCommon_PC_C">();
	}
	static class UABP_SwordSwordCommon_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SwordSwordCommon_PC_C>();
	}
};
static_assert(alignof(UABP_SwordSwordCommon_PC_C) == 0x000010, "Wrong alignment on UABP_SwordSwordCommon_PC_C");
static_assert(sizeof(UABP_SwordSwordCommon_PC_C) == 0x000770, "Wrong size on UABP_SwordSwordCommon_PC_C");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, UberGraphFrame) == 0x0003B0, "Member 'UABP_SwordSwordCommon_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_Root) == 0x0003B8, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_LocalToComponentSpace) == 0x0003F0, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_ComponentToLocalSpace) == 0x000410, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_KawaiiPhysics) == 0x000430, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_LinkedAnimGraph) == 0x0006A0, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, _r__) == 0x000748, "Member 'UABP_SwordSwordCommon_PC_C::_r__' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, WeaponOpen) == 0x000750, "Member 'UABP_SwordSwordCommon_PC_C::WeaponOpen' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, Open_Delay) == 0x000754, "Member 'UABP_SwordSwordCommon_PC_C::Open_Delay' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, Delta_Time) == 0x000758, "Member 'UABP_SwordSwordCommon_PC_C::Delta_Time' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, Fh___) == 0x00075C, "Member 'UABP_SwordSwordCommon_PC_C::Fh___' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, __s_fh) == 0x00075D, "Member 'UABP_SwordSwordCommon_PC_C::__s_fh' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, IsUI) == 0x00075E, "Member 'UABP_SwordSwordCommon_PC_C::IsUI' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, Fh_4I_) == 0x000760, "Member 'UABP_SwordSwordCommon_PC_C::Fh_4I_' has a wrong offset!");

}

