#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Zhezhi_He

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Zhezhi_He.ABP_Zhezhi_He_C
// 0x00A0 (0x05B0 - 0x0510)
class UABP_Zhezhi_He_C final : public UAnimInstance
{
public:
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0518(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0550(0x0060)()

public:
	void ExecuteUbergraph_ABP_Zhezhi_He(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Zhezhi_He_C">();
	}
	static class UABP_Zhezhi_He_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Zhezhi_He_C>();
	}
};
static_assert(alignof(UABP_Zhezhi_He_C) == 0x000010, "Wrong alignment on UABP_Zhezhi_He_C");
static_assert(sizeof(UABP_Zhezhi_He_C) == 0x0005B0, "Wrong size on UABP_Zhezhi_He_C");
static_assert(offsetof(UABP_Zhezhi_He_C, UberGraphFrame) == 0x000510, "Member 'UABP_Zhezhi_He_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Zhezhi_He_C, AnimGraphNode_Root) == 0x000518, "Member 'UABP_Zhezhi_He_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Zhezhi_He_C, AnimGraphNode_Slot) == 0x000550, "Member 'UABP_Zhezhi_He_C::AnimGraphNode_Slot' has a wrong offset!");

}

