#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SwordSwordCommon_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SwordSwordCommon_PC.ABP_SwordSwordCommon_PC_C
// 0x03D0 (0x08E0 - 0x0510)
class UABP_SwordSwordCommon_PC_C final : public UAnimInstance
{
public:
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0518(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0550(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0570(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0590(0x0280)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x0810(0x00A8)()
	class ATsBaseCharacter_C*                     _r__;                                              // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponOpen;                                        // 0x08C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C1[0x3];                                      // 0x08C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Open_Delay;                                        // 0x08C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time;                                        // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fh___;                                             // 0x08CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          __s_fh;                                            // 0x08CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsUI;                                              // 0x08CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CF[0x1];                                      // 0x08CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Fh_4I_;                                            // 0x08D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_SwordSwordCommon_PC(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_SwordSwordCommon_PC_C">();
	}
	static class UABP_SwordSwordCommon_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SwordSwordCommon_PC_C>();
	}
};
static_assert(alignof(UABP_SwordSwordCommon_PC_C) == 0x000010, "Wrong alignment on UABP_SwordSwordCommon_PC_C");
static_assert(sizeof(UABP_SwordSwordCommon_PC_C) == 0x0008E0, "Wrong size on UABP_SwordSwordCommon_PC_C");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, UberGraphFrame) == 0x000510, "Member 'UABP_SwordSwordCommon_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_Root) == 0x000518, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_LocalToComponentSpace) == 0x000550, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_ComponentToLocalSpace) == 0x000570, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_KawaiiPhysics) == 0x000590, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, AnimGraphNode_LinkedAnimGraph) == 0x000810, "Member 'UABP_SwordSwordCommon_PC_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, _r__) == 0x0008B8, "Member 'UABP_SwordSwordCommon_PC_C::_r__' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, WeaponOpen) == 0x0008C0, "Member 'UABP_SwordSwordCommon_PC_C::WeaponOpen' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, Open_Delay) == 0x0008C4, "Member 'UABP_SwordSwordCommon_PC_C::Open_Delay' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, Delta_Time) == 0x0008C8, "Member 'UABP_SwordSwordCommon_PC_C::Delta_Time' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, Fh___) == 0x0008CC, "Member 'UABP_SwordSwordCommon_PC_C::Fh___' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, __s_fh) == 0x0008CD, "Member 'UABP_SwordSwordCommon_PC_C::__s_fh' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, IsUI) == 0x0008CE, "Member 'UABP_SwordSwordCommon_PC_C::IsUI' has a wrong offset!");
static_assert(offsetof(UABP_SwordSwordCommon_PC_C, Fh_4I_) == 0x0008D0, "Member 'UABP_SwordSwordCommon_PC_C::Fh_4I_' has a wrong offset!");

}

