#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_EZhezhiMaobixiaoMd10011

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KuroAnim_structs.hpp"
#include "KuroAnim_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_EZhezhiMaobixiaoMd10011.ABP_EZhezhiMaobixiaoMd10011_C
// 0x0FE0 (0x15D0 - 0x05F0)
class UABP_EZhezhiMaobixiaoMd10011_C final : public UKuroAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05F8(0x0038)()
	struct FAnimNode_ExtraFollowAnims             AnimGraphNode_ExtraFollowAnims;                    // 0x0630(0x0A50)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1080(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x10A0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x10C0(0x0280)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1340(0x0280)()
	class ATsBaseCharacter_C*                     SM_r;                                              // 0x15C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void OnComponentStart();
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_ABP_EZhezhiMaobixiaoMd10011(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_EZhezhiMaobixiaoMd10011_C">();
	}
	static class UABP_EZhezhiMaobixiaoMd10011_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_EZhezhiMaobixiaoMd10011_C>();
	}
};
static_assert(alignof(UABP_EZhezhiMaobixiaoMd10011_C) == 0x000010, "Wrong alignment on UABP_EZhezhiMaobixiaoMd10011_C");
static_assert(sizeof(UABP_EZhezhiMaobixiaoMd10011_C) == 0x0015D0, "Wrong size on UABP_EZhezhiMaobixiaoMd10011_C");
static_assert(offsetof(UABP_EZhezhiMaobixiaoMd10011_C, UberGraphFrame) == 0x0005F0, "Member 'UABP_EZhezhiMaobixiaoMd10011_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobixiaoMd10011_C, AnimGraphNode_Root) == 0x0005F8, "Member 'UABP_EZhezhiMaobixiaoMd10011_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobixiaoMd10011_C, AnimGraphNode_ExtraFollowAnims) == 0x000630, "Member 'UABP_EZhezhiMaobixiaoMd10011_C::AnimGraphNode_ExtraFollowAnims' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobixiaoMd10011_C, AnimGraphNode_LocalToComponentSpace) == 0x001080, "Member 'UABP_EZhezhiMaobixiaoMd10011_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobixiaoMd10011_C, AnimGraphNode_ComponentToLocalSpace) == 0x0010A0, "Member 'UABP_EZhezhiMaobixiaoMd10011_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobixiaoMd10011_C, AnimGraphNode_KawaiiPhysics_1) == 0x0010C0, "Member 'UABP_EZhezhiMaobixiaoMd10011_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobixiaoMd10011_C, AnimGraphNode_KawaiiPhysics) == 0x001340, "Member 'UABP_EZhezhiMaobixiaoMd10011_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_EZhezhiMaobixiaoMd10011_C, SM_r) == 0x0015C0, "Member 'UABP_EZhezhiMaobixiaoMd10011_C::SM_r' has a wrong offset!");

}

