#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Switch_Seq_V2

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Switch_Seq_V2.ABP_Switch_Seq_V2_C
// 0x0320 (0x0830 - 0x0510)
class UABP_Switch_Seq_V2_C : public UAnimInstance
{
public:
	uint8                                         Pad_361D[0x8];                                     // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0518(0x0038)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0550(0x00B0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x0600(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x06B0(0x0138)()
	struct FPoseSnapshot                          CachePose;                                         // 0x07E8(0x0040)(Edit, BlueprintVisible)
	bool                                          EnableSwitchPose;                                  // 0x0828(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361E[0x3];                                     // 0x0829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FalseBlendTime;                                    // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_ABP_Switch_Seq_V2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Switch_Seq_V2_C">();
	}
	static class UABP_Switch_Seq_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Switch_Seq_V2_C>();
	}
};
static_assert(alignof(UABP_Switch_Seq_V2_C) == 0x000010, "Wrong alignment on UABP_Switch_Seq_V2_C");
static_assert(sizeof(UABP_Switch_Seq_V2_C) == 0x000830, "Wrong size on UABP_Switch_Seq_V2_C");
static_assert(offsetof(UABP_Switch_Seq_V2_C, UberGraphFrame) == 0x000510, "Member 'UABP_Switch_Seq_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, AnimGraphNode_Root) == 0x000518, "Member 'UABP_Switch_Seq_V2_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, AnimGraphNode_BlendListByBool) == 0x000550, "Member 'UABP_Switch_Seq_V2_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, AnimGraphNode_PoseSnapshot) == 0x000600, "Member 'UABP_Switch_Seq_V2_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, AnimGraphNode_LinkedInputPose) == 0x0006B0, "Member 'UABP_Switch_Seq_V2_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, CachePose) == 0x0007E8, "Member 'UABP_Switch_Seq_V2_C::CachePose' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, EnableSwitchPose) == 0x000828, "Member 'UABP_Switch_Seq_V2_C::EnableSwitchPose' has a wrong offset!");
static_assert(offsetof(UABP_Switch_Seq_V2_C, FalseBlendTime) == 0x00082C, "Member 'UABP_Switch_Seq_V2_C::FalseBlendTime' has a wrong offset!");

}

