#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_MO1HKacacaMd00101

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SAiConditions_structs.hpp"
#include "AIC_AICommon_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIC_MO1HKacacaMd00101.AIC_MO1HKacacaMd00101_C
// 0x0178 (0x0900 - 0x0788)
class AAIC_MO1HKacacaMd00101_C final : public AAIC_AICommon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AIC_MO1HKacacaMd00101_C;            // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSAiConditions                         血量低于_40_;                                      // 0x0790(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSAiConditions                         自爆死亡申请监听;                                  // 0x0848(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void 自爆检测(bool bContent);
	void OnStart();
	void 自爆死亡申请(bool bContent);
	void ExecuteUbergraph_AIC_MO1HKacacaMd00101(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIC_MO1HKacacaMd00101_C">();
	}
	static class AAIC_MO1HKacacaMd00101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIC_MO1HKacacaMd00101_C>();
	}
};
static_assert(alignof(AAIC_MO1HKacacaMd00101_C) == 0x000008, "Wrong alignment on AAIC_MO1HKacacaMd00101_C");
static_assert(sizeof(AAIC_MO1HKacacaMd00101_C) == 0x000900, "Wrong size on AAIC_MO1HKacacaMd00101_C");
static_assert(offsetof(AAIC_MO1HKacacaMd00101_C, UberGraphFrame_AIC_MO1HKacacaMd00101_C) == 0x000788, "Member 'AAIC_MO1HKacacaMd00101_C::UberGraphFrame_AIC_MO1HKacacaMd00101_C' has a wrong offset!");
static_assert(offsetof(AAIC_MO1HKacacaMd00101_C, 血量低于_40_) == 0x000790, "Member 'AAIC_MO1HKacacaMd00101_C::血量低于_40_' has a wrong offset!");
static_assert(offsetof(AAIC_MO1HKacacaMd00101_C, 自爆死亡申请监听) == 0x000848, "Member 'AAIC_MO1HKacacaMd00101_C::自爆死亡申请监听' has a wrong offset!");

}

