#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_ME1QunJingMd00001_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SAiConditions_structs.hpp"
#include "AIC_AICommon_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIC_ME1QunJingMd00001_New.AIC_ME1QunJingMd00001_New_C
// 0x0178 (0x0900 - 0x0788)
class AAIC_ME1QunJingMd00001_New_C final : public AAIC_AICommon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AIC_ME1QunJingMd00001_New_C;        // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSAiConditions                         白条生效检查;                                      // 0x0790(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSAiConditions                         狂暴生效检查;                                      // 0x0848(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AIC_ME1QunJingMd00001_New(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnStart();
	void 狂暴(bool bContent);
	void 基础技能(bool bContent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIC_ME1QunJingMd00001_New_C">();
	}
	static class AAIC_ME1QunJingMd00001_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIC_ME1QunJingMd00001_New_C>();
	}
};
static_assert(alignof(AAIC_ME1QunJingMd00001_New_C) == 0x000008, "Wrong alignment on AAIC_ME1QunJingMd00001_New_C");
static_assert(sizeof(AAIC_ME1QunJingMd00001_New_C) == 0x000900, "Wrong size on AAIC_ME1QunJingMd00001_New_C");
static_assert(offsetof(AAIC_ME1QunJingMd00001_New_C, UberGraphFrame_AIC_ME1QunJingMd00001_New_C) == 0x000788, "Member 'AAIC_ME1QunJingMd00001_New_C::UberGraphFrame_AIC_ME1QunJingMd00001_New_C' has a wrong offset!");
static_assert(offsetof(AAIC_ME1QunJingMd00001_New_C, 白条生效检查) == 0x000790, "Member 'AAIC_ME1QunJingMd00001_New_C::白条生效检查' has a wrong offset!");
static_assert(offsetof(AAIC_ME1QunJingMd00001_New_C, 狂暴生效检查) == 0x000848, "Member 'AAIC_ME1QunJingMd00001_New_C::狂暴生效检查' has a wrong offset!");

}

