#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_ME1JiancuxiongMd00001

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SHitInformation_structs.hpp"


namespace SDK::Params
{

// Function AIC_ME1JiancuxiongMd00001.AIC_ME1JiancuxiongMd00001_C.ExecuteUbergraph_AIC_ME1JiancuxiongMd00001
// 0x0A70 (0x0A70 - 0x0000)
struct AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ATsBaseCharacter_C* 角色, const struct FGameplayTag& 部位Tag, class ATsBaseCharacter_C* 攻击者)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0028)(ZeroConstructor)
	TDelegate<void(int32 对策事件ID, const struct FSHitInformation& 受击数据)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0028)(ZeroConstructor)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bContent;                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBpEventManager_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_CustomEvent___;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent___Tag;                          // 0x0088(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_CustomEvent____;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EventManager_C*                     K2Node_DynamicCast_AsBP_Event_Manager;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0028)(ZeroConstructor)
	class UBP_EventManager_C*                     CallFunc______________;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue;                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_____ID;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSHitInformation                       K2Node_CustomEvent_____;                           // 0x00F0(0x08A8)(ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0998(0x0018)()
	bool                                          CallFunc_BeginSkill_ReturnValue;                   // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B1[0x7];                                      // 0x09B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x09B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x09F8(0x0040)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0A38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A39[0x7];                                      // 0x0A39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0A40(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0A50(0x0018)()
	bool                                          CallFunc_BeginSkill_ReturnValue_1;                 // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001) == 0x000008, "Wrong alignment on AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001");
static_assert(sizeof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001) == 0x000A70, "Wrong size on AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, EntryPoint) == 0x000000, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_ContainsTag_ReturnValue) == 0x000058, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_K2_GetPawn_ReturnValue) == 0x000060, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_DynamicCast_AsTs_Base_Character) == 0x000068, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_CustomEvent_bContent) == 0x000071, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_CustomEvent_bContent' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_GetBpEventManager_ReturnValue) == 0x000078, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_GetBpEventManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_CustomEvent___) == 0x000080, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_CustomEvent___' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_CustomEvent___Tag) == 0x000088, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_CustomEvent___Tag' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_CustomEvent____) == 0x000098, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_CustomEvent____' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_DynamicCast_AsBP_Event_Manager) == 0x0000A0, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_DynamicCast_AsBP_Event_Manager' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000A9, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000AA, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_BooleanAND_ReturnValue) == 0x0000AB, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc______________) == 0x0000D8, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc______________' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc___AIC___ReturnValue) == 0x0000E0, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc___AIC___ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_CustomEvent_____ID) == 0x0000E8, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_CustomEvent_____ID' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_CustomEvent_____) == 0x0000F0, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_CustomEvent_____' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000998, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_BeginSkill_ReturnValue) == 0x0009B0, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_BeginSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_MakeStruct_FormatArgumentData) == 0x0009B8, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_MakeStruct_FormatArgumentData_1) == 0x0009F8, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_SwitchInteger_CmpSuccess) == 0x000A38, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, K2Node_MakeArray_Array) == 0x000A40, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_Format_ReturnValue) == 0x000A50, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001, CallFunc_BeginSkill_ReturnValue_1) == 0x000A68, "Member 'AIC_ME1JiancuxiongMd00001_C_ExecuteUbergraph_AIC_ME1JiancuxiongMd00001::CallFunc_BeginSkill_ReturnValue_1' has a wrong offset!");

// Function AIC_ME1JiancuxiongMd00001.AIC_ME1JiancuxiongMd00001_C.当触发对策事件时_事件_0
// 0x08B0 (0x08B0 - 0x0000)
struct AIC_ME1JiancuxiongMd00001_C_当触发对策事件时_事件_0 final
{
public:
	int32                                         对策事件ID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSHitInformation                       受击数据;                                          // 0x0008(0x08A8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(AIC_ME1JiancuxiongMd00001_C_当触发对策事件时_事件_0) == 0x000008, "Wrong alignment on AIC_ME1JiancuxiongMd00001_C_当触发对策事件时_事件_0");
static_assert(sizeof(AIC_ME1JiancuxiongMd00001_C_当触发对策事件时_事件_0) == 0x0008B0, "Wrong size on AIC_ME1JiancuxiongMd00001_C_当触发对策事件时_事件_0");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_当触发对策事件时_事件_0, 对策事件ID) == 0x000000, "Member 'AIC_ME1JiancuxiongMd00001_C_当触发对策事件时_事件_0::对策事件ID' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_当触发对策事件时_事件_0, 受击数据) == 0x000008, "Member 'AIC_ME1JiancuxiongMd00001_C_当触发对策事件时_事件_0::受击数据' has a wrong offset!");

// Function AIC_ME1JiancuxiongMd00001.AIC_ME1JiancuxiongMd00001_C.背部受击
// 0x0020 (0x0020 - 0x0000)
struct AIC_ME1JiancuxiongMd00001_C_背部受击 final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           部位Tag;                                           // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     攻击者;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_ME1JiancuxiongMd00001_C_背部受击) == 0x000008, "Wrong alignment on AIC_ME1JiancuxiongMd00001_C_背部受击");
static_assert(sizeof(AIC_ME1JiancuxiongMd00001_C_背部受击) == 0x000020, "Wrong size on AIC_ME1JiancuxiongMd00001_C_背部受击");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_背部受击, 角色) == 0x000000, "Member 'AIC_ME1JiancuxiongMd00001_C_背部受击::角色' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_背部受击, 部位Tag) == 0x000008, "Member 'AIC_ME1JiancuxiongMd00001_C_背部受击::部位Tag' has a wrong offset!");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_背部受击, 攻击者) == 0x000018, "Member 'AIC_ME1JiancuxiongMd00001_C_背部受击::攻击者' has a wrong offset!");

// Function AIC_ME1JiancuxiongMd00001.AIC_ME1JiancuxiongMd00001_C.狂暴
// 0x0001 (0x0001 - 0x0000)
struct AIC_ME1JiancuxiongMd00001_C_狂暴 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_ME1JiancuxiongMd00001_C_狂暴) == 0x000001, "Wrong alignment on AIC_ME1JiancuxiongMd00001_C_狂暴");
static_assert(sizeof(AIC_ME1JiancuxiongMd00001_C_狂暴) == 0x000001, "Wrong size on AIC_ME1JiancuxiongMd00001_C_狂暴");
static_assert(offsetof(AIC_ME1JiancuxiongMd00001_C_狂暴, bContent) == 0x000000, "Member 'AIC_ME1JiancuxiongMd00001_C_狂暴::bContent' has a wrong offset!");

}

