#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_ME1LiufangzheleaderMd00601

#include "Basic.hpp"

#include "SHitInformation_structs.hpp"


namespace SDK::Params
{

// Function AIC_ME1LiufangzheleaderMd00601.AIC_ME1LiufangzheleaderMd00601_C.ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601
// 0x09A0 (0x09A0 - 0x0000)
struct AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bContent_2;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_CustomEvent___;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHitInformation                       K2Node_CustomEvent_____;                           // 0x0028(0x08C8)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsAnyTag_ReturnValue;               // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x08F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x08F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsAnyTag_ReturnValue_1;             // 0x08F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x08F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x08F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x08F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F7[0x1];                                      // 0x08F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate;              // 0x08F8(0x0028)(ZeroConstructor)
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue;                      // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0928(0x0028)(ZeroConstructor)
	TDelegate<void(bool bContent)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x0950(0x0028)(ZeroConstructor)
	int32                                         CallFunc______Int__;                               // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bContent_1;                     // 0x097C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D[0x3];                                      // 0x097D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_984[0x4];                                      // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue_1;                    // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bContent;                       // 0x0990(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_991[0x7];                                      // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroBooleanEventBinder*                CallFunc___AIC___ReturnValue_2;                    // 0x0998(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601) == 0x000008, "Wrong alignment on AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601");
static_assert(sizeof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601) == 0x0009A0, "Wrong size on AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, EntryPoint) == 0x000000, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_DynamicCast_AsTs_Base_Character) == 0x000010, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_CustomEvent_bContent_2) == 0x000019, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_CustomEvent_bContent_2' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, ___int_Variable) == 0x00001C, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::___int_Variable' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_CustomEvent___) == 0x000020, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_CustomEvent___' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_CustomEvent_____) == 0x000028, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_CustomEvent_____' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc_ContainsAnyTag_ReturnValue) == 0x0008F0, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc_ContainsAnyTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0008F1, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc_Not_PreBool_ReturnValue) == 0x0008F2, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc_ContainsAnyTag_ReturnValue_1) == 0x0008F3, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc_ContainsAnyTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc_BooleanAND_ReturnValue) == 0x0008F4, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0008F5, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc_BooleanAND_ReturnValue_1) == 0x0008F6, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_CreateDelegate_OutputDelegate) == 0x0008F8, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc___AIC___ReturnValue) == 0x000920, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc___AIC___ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_CreateDelegate_OutputDelegate_1) == 0x000928, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_CreateDelegate_OutputDelegate_2) == 0x000950, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc______Int__) == 0x000978, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc______Int__' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_CustomEvent_bContent_1) == 0x00097C, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_CustomEvent_bContent_1' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc_Add_IntInt_ReturnValue) == 0x000980, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc___AIC___ReturnValue_1) == 0x000988, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc___AIC___ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, K2Node_CustomEvent_bContent) == 0x000990, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::K2Node_CustomEvent_bContent' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601, CallFunc___AIC___ReturnValue_2) == 0x000998, "Member 'AIC_ME1LiufangzheleaderMd00601_C_ExecuteUbergraph_AIC_ME1LiufangzheleaderMd00601::CallFunc___AIC___ReturnValue_2' has a wrong offset!");

// Function AIC_ME1LiufangzheleaderMd00601.AIC_ME1LiufangzheleaderMd00601_C.韧性击空
// 0x0001 (0x0001 - 0x0000)
struct AIC_ME1LiufangzheleaderMd00601_C_韧性击空 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_ME1LiufangzheleaderMd00601_C_韧性击空) == 0x000001, "Wrong alignment on AIC_ME1LiufangzheleaderMd00601_C_韧性击空");
static_assert(sizeof(AIC_ME1LiufangzheleaderMd00601_C_韧性击空) == 0x000001, "Wrong size on AIC_ME1LiufangzheleaderMd00601_C_韧性击空");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_韧性击空, bContent) == 0x000000, "Member 'AIC_ME1LiufangzheleaderMd00601_C_韧性击空::bContent' has a wrong offset!");

// Function AIC_ME1LiufangzheleaderMd00601.AIC_ME1LiufangzheleaderMd00601_C.韧性恢复满
// 0x0001 (0x0001 - 0x0000)
struct AIC_ME1LiufangzheleaderMd00601_C_韧性恢复满 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_ME1LiufangzheleaderMd00601_C_韧性恢复满) == 0x000001, "Wrong alignment on AIC_ME1LiufangzheleaderMd00601_C_韧性恢复满");
static_assert(sizeof(AIC_ME1LiufangzheleaderMd00601_C_韧性恢复满) == 0x000001, "Wrong size on AIC_ME1LiufangzheleaderMd00601_C_韧性恢复满");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_韧性恢复满, bContent) == 0x000000, "Member 'AIC_ME1LiufangzheleaderMd00601_C_韧性恢复满::bContent' has a wrong offset!");

// Function AIC_ME1LiufangzheleaderMd00601.AIC_ME1LiufangzheleaderMd00601_C.受击计数
// 0x08D0 (0x08D0 - 0x0000)
struct AIC_ME1LiufangzheleaderMd00601_C_受击计数 final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHitInformation                       受击数据;                                          // 0x0008(0x08C8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(AIC_ME1LiufangzheleaderMd00601_C_受击计数) == 0x000008, "Wrong alignment on AIC_ME1LiufangzheleaderMd00601_C_受击计数");
static_assert(sizeof(AIC_ME1LiufangzheleaderMd00601_C_受击计数) == 0x0008D0, "Wrong size on AIC_ME1LiufangzheleaderMd00601_C_受击计数");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_受击计数, 角色) == 0x000000, "Member 'AIC_ME1LiufangzheleaderMd00601_C_受击计数::角色' has a wrong offset!");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_受击计数, 受击数据) == 0x000008, "Member 'AIC_ME1LiufangzheleaderMd00601_C_受击计数::受击数据' has a wrong offset!");

// Function AIC_ME1LiufangzheleaderMd00601.AIC_ME1LiufangzheleaderMd00601_C.二阶段监听
// 0x0001 (0x0001 - 0x0000)
struct AIC_ME1LiufangzheleaderMd00601_C_二阶段监听 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_ME1LiufangzheleaderMd00601_C_二阶段监听) == 0x000001, "Wrong alignment on AIC_ME1LiufangzheleaderMd00601_C_二阶段监听");
static_assert(sizeof(AIC_ME1LiufangzheleaderMd00601_C_二阶段监听) == 0x000001, "Wrong size on AIC_ME1LiufangzheleaderMd00601_C_二阶段监听");
static_assert(offsetof(AIC_ME1LiufangzheleaderMd00601_C_二阶段监听, bContent) == 0x000000, "Member 'AIC_ME1LiufangzheleaderMd00601_C_二阶段监听::bContent' has a wrong offset!");

}

