#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_MO1AWukakaMd00601

#include "Basic.hpp"


namespace SDK::Params
{

// Function AIC_MO1AWukakaMd00601.AIC_MO1AWukakaMd00601_C.ExecuteUbergraph_AIC_MO1AWukakaMd00601
// 0x0048 (0x0048 - 0x0000)
struct AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bContent_1;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bContent;                       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CreatureInterface_C> K2Node_DynamicCast_AsBPI_Creature_Interface;       // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_GetCreatureDataIdByEntity_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601) == 0x000008, "Wrong alignment on AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601");
static_assert(sizeof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601) == 0x000048, "Wrong size on AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, EntryPoint) == 0x000000, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::EntryPoint' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, K2Node_DynamicCast_AsTs_Base_Character) == 0x000010, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, K2Node_CustomEvent_bContent_1) == 0x000019, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::K2Node_CustomEvent_bContent_1' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, K2Node_CustomEvent_bContent) == 0x00001A, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::K2Node_CustomEvent_bContent' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000020, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, K2Node_DynamicCast_AsBPI_Creature_Interface) == 0x000028, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::K2Node_DynamicCast_AsBPI_Creature_Interface' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, CallFunc_GetEntityId_ReturnValue) == 0x00003C, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601, CallFunc_GetCreatureDataIdByEntity_ReturnValue) == 0x000040, "Member 'AIC_MO1AWukakaMd00601_C_ExecuteUbergraph_AIC_MO1AWukakaMd00601::CallFunc_GetCreatureDataIdByEntity_ReturnValue' has a wrong offset!");

// Function AIC_MO1AWukakaMd00601.AIC_MO1AWukakaMd00601_C.自爆检测
// 0x0001 (0x0001 - 0x0000)
struct AIC_MO1AWukakaMd00601_C_自爆检测 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_MO1AWukakaMd00601_C_自爆检测) == 0x000001, "Wrong alignment on AIC_MO1AWukakaMd00601_C_自爆检测");
static_assert(sizeof(AIC_MO1AWukakaMd00601_C_自爆检测) == 0x000001, "Wrong size on AIC_MO1AWukakaMd00601_C_自爆检测");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_自爆检测, bContent) == 0x000000, "Member 'AIC_MO1AWukakaMd00601_C_自爆检测::bContent' has a wrong offset!");

// Function AIC_MO1AWukakaMd00601.AIC_MO1AWukakaMd00601_C.自爆死亡申请
// 0x0001 (0x0001 - 0x0000)
struct AIC_MO1AWukakaMd00601_C_自爆死亡申请 final
{
public:
	bool                                          bContent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIC_MO1AWukakaMd00601_C_自爆死亡申请) == 0x000001, "Wrong alignment on AIC_MO1AWukakaMd00601_C_自爆死亡申请");
static_assert(sizeof(AIC_MO1AWukakaMd00601_C_自爆死亡申请) == 0x000001, "Wrong size on AIC_MO1AWukakaMd00601_C_自爆死亡申请");
static_assert(offsetof(AIC_MO1AWukakaMd00601_C_自爆死亡申请, bContent) == 0x000000, "Member 'AIC_MO1AWukakaMd00601_C_自爆死亡申请::bContent' has a wrong offset!");

}

