#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIRaceStrategy

#include "Basic.hpp"

#include "SAiRaceStrategyCorrectionByDistance_structs.hpp"
#include "SAiRaceStrategyCorrectionBySpeed_structs.hpp"
#include "SAiRaceStrategyCorrectionByTime_structs.hpp"
#include "SAiRaceStrategyMultiParamFunction_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIRaceStrategy.BP_AIRaceStrategy_C
// 0x0070 (0x00A8 - 0x0038)
class UBP_AIRaceStrategy_C final : public UPrimaryDataAsset
{
public:
	float                                         DefaultSpeed;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultAcceleration;                               // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultDeceleration;                               // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSAiRaceStrategyCorrectionByDistance   CorrectionByDistanceConfig;                        // 0x0048(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSAiRaceStrategyCorrectionBySpeed      CorrectionBySpeedConfig;                           // 0x0060(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSAiRaceStrategyCorrectionByTime       CorrectionByTimeConfig;                            // 0x0088(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSAiRaceStrategyMultiParamFunction     CalcTargetSpeedConfig;                             // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIRaceStrategy_C">();
	}
	static class UBP_AIRaceStrategy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AIRaceStrategy_C>();
	}
};
static_assert(alignof(UBP_AIRaceStrategy_C) == 0x000008, "Wrong alignment on UBP_AIRaceStrategy_C");
static_assert(sizeof(UBP_AIRaceStrategy_C) == 0x0000A8, "Wrong size on UBP_AIRaceStrategy_C");
static_assert(offsetof(UBP_AIRaceStrategy_C, DefaultSpeed) == 0x000038, "Member 'UBP_AIRaceStrategy_C::DefaultSpeed' has a wrong offset!");
static_assert(offsetof(UBP_AIRaceStrategy_C, DefaultAcceleration) == 0x00003C, "Member 'UBP_AIRaceStrategy_C::DefaultAcceleration' has a wrong offset!");
static_assert(offsetof(UBP_AIRaceStrategy_C, DefaultDeceleration) == 0x000040, "Member 'UBP_AIRaceStrategy_C::DefaultDeceleration' has a wrong offset!");
static_assert(offsetof(UBP_AIRaceStrategy_C, CorrectionByDistanceConfig) == 0x000048, "Member 'UBP_AIRaceStrategy_C::CorrectionByDistanceConfig' has a wrong offset!");
static_assert(offsetof(UBP_AIRaceStrategy_C, CorrectionBySpeedConfig) == 0x000060, "Member 'UBP_AIRaceStrategy_C::CorrectionBySpeedConfig' has a wrong offset!");
static_assert(offsetof(UBP_AIRaceStrategy_C, CorrectionByTimeConfig) == 0x000088, "Member 'UBP_AIRaceStrategy_C::CorrectionByTimeConfig' has a wrong offset!");
static_assert(offsetof(UBP_AIRaceStrategy_C, CalcTargetSpeedConfig) == 0x0000A0, "Member 'UBP_AIRaceStrategy_C::CalcTargetSpeedConfig' has a wrong offset!");

}

