#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TsCharacterController_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterController.BP_CharacterController_C
// 0x0020 (0x07A0 - 0x0780)
class ABP_CharacterController_C final : public ATsCharacterController_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CharacterController_C;           // 0x0780(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATsBaseCharacter_C*                     SM___r;                                            // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GmIsOpen;                                          // 0x0790(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_KuroCheatManager_C*                 KuroCheatManager;                                  // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CharacterController(int32 EntryPoint);
	void OnReleaseAnyKey(const struct FKey& Key);
	void OnPressAnyKey(const struct FKey& Key);
	void ReceiveBeginPlay();
	void ReceivePossess(class APawn* PossessedPawn);
	void ReceiveUnPossess(class APawn* UnpossessedPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CharacterController_C">();
	}
	static class ABP_CharacterController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CharacterController_C>();
	}
};
static_assert(alignof(ABP_CharacterController_C) == 0x000008, "Wrong alignment on ABP_CharacterController_C");
static_assert(sizeof(ABP_CharacterController_C) == 0x0007A0, "Wrong size on ABP_CharacterController_C");
static_assert(offsetof(ABP_CharacterController_C, UberGraphFrame_BP_CharacterController_C) == 0x000780, "Member 'ABP_CharacterController_C::UberGraphFrame_BP_CharacterController_C' has a wrong offset!");
static_assert(offsetof(ABP_CharacterController_C, SM___r) == 0x000788, "Member 'ABP_CharacterController_C::SM___r' has a wrong offset!");
static_assert(offsetof(ABP_CharacterController_C, GmIsOpen) == 0x000790, "Member 'ABP_CharacterController_C::GmIsOpen' has a wrong offset!");
static_assert(offsetof(ABP_CharacterController_C, KuroCheatManager) == 0x000798, "Member 'ABP_CharacterController_C::KuroCheatManager' has a wrong offset!");

}

