#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CloudPrefab

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CloudPrefab.BP_CloudPrefab_C
// 0x0110 (0x03D8 - 0x02C8)
class ABP_CloudPrefab_C : public AKuroCloudPrefabActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cloud_Top;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mountain;                                          // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cloud_BigShape;                                    // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cloud_Cover;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Parent;                                            // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CloudColorMap;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture*                               CloudMaskMap;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         ChangeSpeed;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         CloudRotateSpeed;                                  // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          change;                                            // 0x031C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Stop;                                              // 0x031D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Farward;                                           // 0x031E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F[0x1];                                      // 0x031F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       DMI;                                               // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Delta_Seconds;                                     // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimerInit;                                         // 0x0334(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ColoredCloud_;                                     // 0x0335(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336[0x2];                                      // 0x0336(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CloudSaturation;                                   // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentOpacity___别改我__;                         // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Top;                                           // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Cover;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Anomalies;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_BigShape;                                      // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Mountain;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CloudInitialZAngle;                                // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdatePerFourFrame01;                              // 0x036C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UpdatePerFourFrame02;                              // 0x036D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SetCoverMaterial;                                  // 0x036E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36F[0x1];                                      // 0x036F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Cloud_Cover_Material;                              // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TransSortNumber;                                   // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           MeshArray;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       DMIArray;                                          // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Random;                                            // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Trans;                                             // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         SDFTime;                                           // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFollowChar;                                       // 0x03BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bFollowCamera;                                     // 0x03BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BE[0x2];                                      // 0x03BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothWidth;                                       // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOverrideCloudOffset;                              // 0x03C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CloudSpeed;                                        // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CloudOffset;                                       // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReversed;                                        // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsReversedTemp;                                    // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x2];                                      // 0x03D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReversedZHeightBias;                               // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CloudPrefab(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void EditorTick(float DeltaSeconds);
	void UserConstructionScript();
	void Active();
	void Hidden();
	void AddCloudRotation();
	void Timer(bool Forward, float DeltaTime, float Speed, float* time, bool* Stop_0);
	void Cloud_Initial();
	void Single_Cloud_Parameters_Initial(class UMaterialInstanceDynamic* DMI_0, class UStaticMeshComponent* Mesh, const struct FCloudParameters& CloudStructParameter, int32 TransSortNumber_0);
	void UpdatePerFourFrame();
	void Single_Building_Parameters_Initial(class UMaterialInstanceDynamic* DMI_0, class UStaticMeshComponent* Mesh, const struct FAnomaliesParameters& CloudStructParameter, int32 TransSortNumber_0);
	void Single_POICloud_Parameters_Initial(class UMaterialInstanceDynamic* DMI_0, class UStaticMeshComponent* Mesh, const struct FPOICloudParameters& CloudStructParameter, int32 TransSortNumber_0);
	void ShouldCloudMove(const struct FVectorDouble& InLocation, bool* bMove, struct FVectorDouble* NewLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CloudPrefab_C">();
	}
	static class ABP_CloudPrefab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CloudPrefab_C>();
	}
};
static_assert(alignof(ABP_CloudPrefab_C) == 0x000008, "Wrong alignment on ABP_CloudPrefab_C");
static_assert(sizeof(ABP_CloudPrefab_C) == 0x0003D8, "Wrong size on ABP_CloudPrefab_C");
static_assert(offsetof(ABP_CloudPrefab_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_CloudPrefab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Cloud_Top) == 0x0002D0, "Member 'ABP_CloudPrefab_C::Cloud_Top' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Mountain) == 0x0002D8, "Member 'ABP_CloudPrefab_C::Mountain' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Cloud_BigShape) == 0x0002E0, "Member 'ABP_CloudPrefab_C::Cloud_BigShape' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Cloud_Cover) == 0x0002E8, "Member 'ABP_CloudPrefab_C::Cloud_Cover' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Parent) == 0x0002F0, "Member 'ABP_CloudPrefab_C::Parent' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, DefaultSceneRoot) == 0x0002F8, "Member 'ABP_CloudPrefab_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, CloudColorMap) == 0x000300, "Member 'ABP_CloudPrefab_C::CloudColorMap' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, CloudMaskMap) == 0x000308, "Member 'ABP_CloudPrefab_C::CloudMaskMap' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, ChangeSpeed) == 0x000310, "Member 'ABP_CloudPrefab_C::ChangeSpeed' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, CloudRotateSpeed) == 0x000314, "Member 'ABP_CloudPrefab_C::CloudRotateSpeed' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Time) == 0x000318, "Member 'ABP_CloudPrefab_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, change) == 0x00031C, "Member 'ABP_CloudPrefab_C::change' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Stop) == 0x00031D, "Member 'ABP_CloudPrefab_C::Stop' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Farward) == 0x00031E, "Member 'ABP_CloudPrefab_C::Farward' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, DMI) == 0x000320, "Member 'ABP_CloudPrefab_C::DMI' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Delta_Seconds) == 0x000330, "Member 'ABP_CloudPrefab_C::Delta_Seconds' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, TimerInit) == 0x000334, "Member 'ABP_CloudPrefab_C::TimerInit' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, ColoredCloud_) == 0x000335, "Member 'ABP_CloudPrefab_C::ColoredCloud_' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, CloudSaturation) == 0x000338, "Member 'ABP_CloudPrefab_C::CloudSaturation' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, CurrentOpacity___别改我__) == 0x00033C, "Member 'ABP_CloudPrefab_C::CurrentOpacity___别改我__' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, DMI_Top) == 0x000340, "Member 'ABP_CloudPrefab_C::DMI_Top' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, DMI_Cover) == 0x000348, "Member 'ABP_CloudPrefab_C::DMI_Cover' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, DMI_Anomalies) == 0x000350, "Member 'ABP_CloudPrefab_C::DMI_Anomalies' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, DMI_BigShape) == 0x000358, "Member 'ABP_CloudPrefab_C::DMI_BigShape' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, DMI_Mountain) == 0x000360, "Member 'ABP_CloudPrefab_C::DMI_Mountain' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, CloudInitialZAngle) == 0x000368, "Member 'ABP_CloudPrefab_C::CloudInitialZAngle' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, UpdatePerFourFrame01) == 0x00036C, "Member 'ABP_CloudPrefab_C::UpdatePerFourFrame01' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, UpdatePerFourFrame02) == 0x00036D, "Member 'ABP_CloudPrefab_C::UpdatePerFourFrame02' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, SetCoverMaterial) == 0x00036E, "Member 'ABP_CloudPrefab_C::SetCoverMaterial' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Cloud_Cover_Material) == 0x000370, "Member 'ABP_CloudPrefab_C::Cloud_Cover_Material' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, TransSortNumber) == 0x000378, "Member 'ABP_CloudPrefab_C::TransSortNumber' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, MeshArray) == 0x000380, "Member 'ABP_CloudPrefab_C::MeshArray' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, DMIArray) == 0x000390, "Member 'ABP_CloudPrefab_C::DMIArray' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Random) == 0x0003A0, "Member 'ABP_CloudPrefab_C::Random' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, Trans) == 0x0003A8, "Member 'ABP_CloudPrefab_C::Trans' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, SDFTime) == 0x0003B8, "Member 'ABP_CloudPrefab_C::SDFTime' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, bFollowChar) == 0x0003BC, "Member 'ABP_CloudPrefab_C::bFollowChar' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, bFollowCamera) == 0x0003BD, "Member 'ABP_CloudPrefab_C::bFollowCamera' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, SmoothWidth) == 0x0003C0, "Member 'ABP_CloudPrefab_C::SmoothWidth' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, bOverrideCloudOffset) == 0x0003C4, "Member 'ABP_CloudPrefab_C::bOverrideCloudOffset' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, CloudSpeed) == 0x0003C8, "Member 'ABP_CloudPrefab_C::CloudSpeed' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, CloudOffset) == 0x0003CC, "Member 'ABP_CloudPrefab_C::CloudOffset' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, IsReversed) == 0x0003D0, "Member 'ABP_CloudPrefab_C::IsReversed' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, IsReversedTemp) == 0x0003D1, "Member 'ABP_CloudPrefab_C::IsReversedTemp' has a wrong offset!");
static_assert(offsetof(ABP_CloudPrefab_C, ReversedZHeightBias) == 0x0003D4, "Member 'ABP_CloudPrefab_C::ReversedZHeightBias' has a wrong offset!");

}

