#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fx_Hook_Beam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Fx_Hook_Beam.BP_Fx_Hook_Beam_C.ExecuteUbergraph_BP_Fx_Hook_Beam
// 0x0028 (0x0028 - 0x0000)
struct BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam) == 0x000008, "Wrong alignment on BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam");
static_assert(sizeof(BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam) == 0x000028, "Wrong size on BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam");
static_assert(offsetof(BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam, EntryPoint) == 0x000000, "Member 'BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BP_Fx_Hook_Beam_C_ExecuteUbergraph_BP_Fx_Hook_Beam::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_Fx_Hook_Beam.BP_Fx_Hook_Beam_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Fx_Hook_Beam_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fx_Hook_Beam_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Fx_Hook_Beam_C_ReceiveTick");
static_assert(sizeof(BP_Fx_Hook_Beam_C_ReceiveTick) == 0x000004, "Wrong size on BP_Fx_Hook_Beam_C_ReceiveTick");
static_assert(offsetof(BP_Fx_Hook_Beam_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Fx_Hook_Beam_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Fx_Hook_Beam.BP_Fx_Hook_Beam_C.CalculateTangents
// 0x00BC (0x00BC - 0x0000)
struct BP_Fx_Hook_Beam_C_CalculateTangents final
{
public:
	struct FVector                                ControllerTangent;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ItemTangent;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetDirection;                                   // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MidNormalize;                                      // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MidLength;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MidDir;                                            // 0x0034(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fx_Hook_Beam_C_CalculateTangents) == 0x000004, "Wrong alignment on BP_Fx_Hook_Beam_C_CalculateTangents");
static_assert(sizeof(BP_Fx_Hook_Beam_C_CalculateTangents) == 0x0000BC, "Wrong size on BP_Fx_Hook_Beam_C_CalculateTangents");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, ControllerTangent) == 0x000000, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::ControllerTangent' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, ItemTangent) == 0x00000C, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::ItemTangent' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, TargetDirection) == 0x000018, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::TargetDirection' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, MidNormalize) == 0x000024, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::MidNormalize' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, MidLength) == 0x000030, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::MidLength' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, MidDir) == 0x000034, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::MidDir' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_VSize_ReturnValue) == 0x000040, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Add_VectorVector_ReturnValue) == 0x000044, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000050, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00005C, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_FClamp_ReturnValue) == 0x00006C, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000070, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Dot_VectorVector_ReturnValue) == 0x00007C, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000080, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_FClamp_ReturnValue_1) == 0x000084, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000088, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000094, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000098, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000A4, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Fx_Hook_Beam_C_CalculateTangents, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000B0, "Member 'BP_Fx_Hook_Beam_C_CalculateTangents::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");

}

