#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Input_Sanhua

#include "Basic.hpp"

#include "SSkillInfo_structs.hpp"
#include "SInputCommand_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Input_Sanhua.BP_Input_Sanhua_C.{a2	
// 0x0280 (0x0280 - 0x0000)
struct BP_Input_Sanhua_C__a2__ final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___o;                                              // 0x0018(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          _0__J__;                                           // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C1[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     SM__;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand;                   // 0x0038(0x0014)(NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc___2___ReturnValue;                        // 0x004C(0x0014)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_1;                 // 0x0070(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C2[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C3[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc_GetEntityId_self_CastInput;               // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIntValueByEntity_ReturnValue;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C4[0x2];                                     // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPriority_ReturnValue;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue;        // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue;                 // 0x00D0(0x0170)(HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue;            // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C5[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         ___wildcard_Variable;                              // 0x024C(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C6[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_Sanhua_C__a2__) == 0x000008, "Wrong alignment on BP_Input_Sanhua_C__a2__");
static_assert(sizeof(BP_Input_Sanhua_C__a2__) == 0x000280, "Wrong size on BP_Input_Sanhua_C__a2__");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, Time) == 0x000000, "Member 'BP_Input_Sanhua_C__a2__::Time' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, ReturnValue) == 0x000004, "Member 'BP_Input_Sanhua_C__a2__::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, ___o) == 0x000018, "Member 'BP_Input_Sanhua_C__a2__::___o' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, _0__J__) == 0x00002C, "Member 'BP_Input_Sanhua_C__a2__::_0__J__' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, SM__) == 0x000030, "Member 'BP_Input_Sanhua_C__a2__::SM__' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, K2Node_MakeStruct_SInputCommand) == 0x000038, "Member 'BP_Input_Sanhua_C__a2__::K2Node_MakeStruct_SInputCommand' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc___2___ReturnValue) == 0x00004C, "Member 'BP_Input_Sanhua_C__a2__::CallFunc___2___ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, K2Node_MakeStruct_SInputCommand_1) == 0x000070, "Member 'BP_Input_Sanhua_C__a2__::K2Node_MakeStruct_SInputCommand_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000088, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_GetSkillAcceptInput_ReturnValue) == 0x000098, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_GetSkillAcceptInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_GetEntityId_self_CastInput) == 0x0000A0, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_GetEntityId_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_GetEntityId_ReturnValue) == 0x0000B0, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_GetIntValueByEntity_ReturnValue) == 0x0000B4, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_GetIntValueByEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue) == 0x0000B8, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B9, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_GetPriority_ReturnValue) == 0x0000BC, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_GetPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_GetSkillIdWithGroupId_ReturnValue) == 0x0000C0, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_GetSkillIdWithGroupId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_GetSkillInfo_ReturnValue) == 0x0000D0, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_GetSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_GetActivePriority_ReturnValue) == 0x000240, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_GetActivePriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000244, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000245, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_BooleanAND_ReturnValue) == 0x000246, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_Not_PreBool_ReturnValue) == 0x000247, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000248, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, ___wildcard_Variable) == 0x00024C, "Member 'BP_Input_Sanhua_C__a2__::___wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_BooleanOR_ReturnValue) == 0x000260, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_BooleanOR_ReturnValue_1) == 0x000261, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_BooleanOR_ReturnValue_2) == 0x000262, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000263, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000268, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a2__, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000278, "Member 'BP_Input_Sanhua_C__a2__::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function BP_Input_Sanhua.BP_Input_Sanhua_C.cNÄ›Ÿ$š
// 0x0005 (0x0005 - 0x0000)
struct BP_Input_Sanhua_C_CN______ final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_2;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_Sanhua_C_CN______) == 0x000001, "Wrong alignment on BP_Input_Sanhua_C_CN______");
static_assert(sizeof(BP_Input_Sanhua_C_CN______) == 0x000005, "Wrong size on BP_Input_Sanhua_C_CN______");
static_assert(offsetof(BP_Input_Sanhua_C_CN______, NewParam) == 0x000000, "Member 'BP_Input_Sanhua_C_CN______::NewParam' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_CN______, K2Node_SwitchInteger_CmpSuccess) == 0x000001, "Member 'BP_Input_Sanhua_C_CN______::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_CN______, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000002, "Member 'BP_Input_Sanhua_C_CN______::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_CN______, CallFunc_InRange_FloatFloat_ReturnValue_1) == 0x000003, "Member 'BP_Input_Sanhua_C_CN______::CallFunc_InRange_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_CN______, CallFunc_InRange_FloatFloat_ReturnValue_2) == 0x000004, "Member 'BP_Input_Sanhua_C_CN______::CallFunc_InRange_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function BP_Input_Sanhua.BP_Input_Sanhua_C.ê	
// 0x0440 (0x0440 - 0x0000)
struct BP_Input_Sanhua_C_____ final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___wildcard_Variable;                              // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc______ReturnValue;                         // 0x002C(0x0014)(NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand;                   // 0x0040(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C7[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C8[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_1;                 // 0x006C(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C9[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___wildcard_Variable_1;                            // 0x0098(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue;          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CA[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_2;                 // 0x00B0(0x0014)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPriority_ReturnValue;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue;        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue;                 // 0x00D8(0x0170)(HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue;            // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x024E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x024F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_3;                 // 0x0260(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37CB[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_1; // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CC[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPriority_ReturnValue_1;                // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CD[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue_1;      // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue_1;               // 0x02A8(0x0170)(HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue_1;          // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x041D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x041E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x041F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue_1;        // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0426(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0427(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0428(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_Sanhua_C_____) == 0x000008, "Wrong alignment on BP_Input_Sanhua_C_____");
static_assert(sizeof(BP_Input_Sanhua_C_____) == 0x000440, "Wrong size on BP_Input_Sanhua_C_____");
static_assert(offsetof(BP_Input_Sanhua_C_____, Time) == 0x000000, "Member 'BP_Input_Sanhua_C_____::Time' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, ReturnValue) == 0x000004, "Member 'BP_Input_Sanhua_C_____::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, ___wildcard_Variable) == 0x000018, "Member 'BP_Input_Sanhua_C_____::___wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc______ReturnValue) == 0x00002C, "Member 'BP_Input_Sanhua_C_____::CallFunc______ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, K2Node_MakeStruct_SInputCommand) == 0x000040, "Member 'BP_Input_Sanhua_C_____::K2Node_MakeStruct_SInputCommand' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000054, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000055, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'BP_Input_Sanhua_C_____::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue) == 0x000068, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, K2Node_MakeStruct_SInputCommand_1) == 0x00006C, "Member 'BP_Input_Sanhua_C_____::K2Node_MakeStruct_SInputCommand_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue) == 0x000080, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000088, "Member 'BP_Input_Sanhua_C_____::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, ___wildcard_Variable_1) == 0x000098, "Member 'BP_Input_Sanhua_C_____::___wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetSkillAcceptInput_ReturnValue) == 0x0000AC, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetSkillAcceptInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, K2Node_MakeStruct_SInputCommand_2) == 0x0000B0, "Member 'BP_Input_Sanhua_C_____::K2Node_MakeStruct_SInputCommand_2' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetPriority_ReturnValue) == 0x0000C4, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetSkillIdWithGroupId_ReturnValue) == 0x0000C8, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetSkillIdWithGroupId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetSkillInfo_ReturnValue) == 0x0000D8, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetActivePriority_ReturnValue) == 0x000248, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetActivePriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00024C, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00024D, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00024E, "Member 'BP_Input_Sanhua_C_____::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Not_PreBool_ReturnValue) == 0x00024F, "Member 'BP_Input_Sanhua_C_____::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000250, "Member 'BP_Input_Sanhua_C_____::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, K2Node_MakeStruct_SInputCommand_3) == 0x000260, "Member 'BP_Input_Sanhua_C_____::K2Node_MakeStruct_SInputCommand_3' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000278, "Member 'BP_Input_Sanhua_C_____::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_1) == 0x000288, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetPriority_ReturnValue_1) == 0x00028C, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue_1) == 0x000290, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetSkillIdWithGroupId_ReturnValue_1) == 0x000298, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetSkillIdWithGroupId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetSkillInfo_ReturnValue_1) == 0x0002A8, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetSkillInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetActivePriority_ReturnValue_1) == 0x000418, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetActivePriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x00041C, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00041D, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanAND_ReturnValue) == 0x00041E, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Not_PreBool_ReturnValue_1) == 0x00041F, "Member 'BP_Input_Sanhua_C_____::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000420, "Member 'BP_Input_Sanhua_C_____::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue_2) == 0x000421, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue_3) == 0x000422, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetSkillAcceptInput_ReturnValue_1) == 0x000423, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetSkillAcceptInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue_4) == 0x000424, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanAND_ReturnValue_1) == 0x000425, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue_5) == 0x000426, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue_6) == 0x000427, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000428, "Member 'BP_Input_Sanhua_C_____::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000438, "Member 'BP_Input_Sanhua_C_____::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function BP_Input_Sanhua.BP_Input_Sanhua_C.{a1	
// 0x0018 (0x0018 - 0x0000)
struct BP_Input_Sanhua_C__a1__ final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Input_Sanhua_C__a1__) == 0x000004, "Wrong alignment on BP_Input_Sanhua_C__a1__");
static_assert(sizeof(BP_Input_Sanhua_C__a1__) == 0x000018, "Wrong size on BP_Input_Sanhua_C__a1__");
static_assert(offsetof(BP_Input_Sanhua_C__a1__, Time) == 0x000000, "Member 'BP_Input_Sanhua_C__a1__::Time' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C__a1__, ReturnValue) == 0x000004, "Member 'BP_Input_Sanhua_C__a1__::ReturnValue' has a wrong offset!");

// Function BP_Input_Sanhua.BP_Input_Sanhua_C.'Û	
// 0x0228 (0x0228 - 0x0000)
struct BP_Input_Sanhua_C_____ final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand;                   // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37CE[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CF[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_1;                 // 0x0044(0x0014)(NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___wildcard_Variable;                              // 0x0058(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D0[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPriority_ReturnValue;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D1[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue;        // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue;                 // 0x0098(0x0170)(HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue;            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x020F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue; // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMovingOnGround_ReturnValue;             // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D2[0x2];                                     // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAttributeCurrentValue_ReturnValue;     // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttributeCurrentValue_ReturnValue_1;   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_Sanhua_C_____) == 0x000008, "Wrong alignment on BP_Input_Sanhua_C_____");
static_assert(sizeof(BP_Input_Sanhua_C_____) == 0x000228, "Wrong size on BP_Input_Sanhua_C_____");
static_assert(offsetof(BP_Input_Sanhua_C_____, Time) == 0x000000, "Member 'BP_Input_Sanhua_C_____::Time' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, ReturnValue) == 0x000004, "Member 'BP_Input_Sanhua_C_____::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, K2Node_MakeStruct_SInputCommand) == 0x000018, "Member 'BP_Input_Sanhua_C_____::K2Node_MakeStruct_SInputCommand' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'BP_Input_Sanhua_C_____::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_CanResponseInput_ReturnValue) == 0x000040, "Member 'BP_Input_Sanhua_C_____::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, K2Node_MakeStruct_SInputCommand_1) == 0x000044, "Member 'BP_Input_Sanhua_C_____::K2Node_MakeStruct_SInputCommand_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, ___wildcard_Variable) == 0x000058, "Member 'BP_Input_Sanhua_C_____::___wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000070, "Member 'BP_Input_Sanhua_C_____::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetPriority_ReturnValue) == 0x000080, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetSkillAcceptInput_ReturnValue) == 0x000084, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetSkillAcceptInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetSkillIdWithGroupId_ReturnValue) == 0x000088, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetSkillIdWithGroupId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetSkillInfo_ReturnValue) == 0x000098, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetActivePriority_ReturnValue) == 0x000208, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetActivePriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00020C, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00020D, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanAND_ReturnValue) == 0x00020E, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Not_PreBool_ReturnValue) == 0x00020F, "Member 'BP_Input_Sanhua_C_____::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000210, "Member 'BP_Input_Sanhua_C_____::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue) == 0x000211, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000212, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue) == 0x000213, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue_1) == 0x000214, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000215, "Member 'BP_Input_Sanhua_C_____::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue_2) == 0x000216, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanAND_ReturnValue_1) == 0x000217, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_IsMovingOnGround_ReturnValue) == 0x000218, "Member 'BP_Input_Sanhua_C_____::CallFunc_IsMovingOnGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_BooleanOR_ReturnValue_3) == 0x000219, "Member 'BP_Input_Sanhua_C_____::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetAttributeCurrentValue_ReturnValue) == 0x00021C, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetAttributeCurrentValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GetAttributeCurrentValue_ReturnValue_1) == 0x000220, "Member 'BP_Input_Sanhua_C_____::CallFunc_GetAttributeCurrentValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C_____, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000224, "Member 'BP_Input_Sanhua_C_____::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Input_Sanhua.BP_Input_Sanhua_C.€ý1	
// 0x0238 (0x0238 - 0x0000)
struct BP_Input_Sanhua_C___1__ final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand;                   // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D3[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_1;                 // 0x0040(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D4[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___wildcard_Variable;                              // 0x0068(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D5[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPriority_ReturnValue;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue; // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D6[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue;        // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue;                 // 0x0098(0x0170)(HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue;            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x020F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D7[0x3];                                     // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         CallFunc___1___ReturnValue;                        // 0x0218(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMovingOnGround_ReturnValue;             // 0x022E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x022F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Input_Sanhua_C___1__) == 0x000008, "Wrong alignment on BP_Input_Sanhua_C___1__");
static_assert(sizeof(BP_Input_Sanhua_C___1__) == 0x000238, "Wrong size on BP_Input_Sanhua_C___1__");
static_assert(offsetof(BP_Input_Sanhua_C___1__, Time) == 0x000000, "Member 'BP_Input_Sanhua_C___1__::Time' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, ReturnValue) == 0x000004, "Member 'BP_Input_Sanhua_C___1__::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, K2Node_MakeStruct_SInputCommand) == 0x000018, "Member 'BP_Input_Sanhua_C___1__::K2Node_MakeStruct_SInputCommand' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'BP_Input_Sanhua_C___1__::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, K2Node_MakeStruct_SInputCommand_1) == 0x000040, "Member 'BP_Input_Sanhua_C___1__::K2Node_MakeStruct_SInputCommand_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000058, "Member 'BP_Input_Sanhua_C___1__::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, ___wildcard_Variable) == 0x000068, "Member 'BP_Input_Sanhua_C___1__::___wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_GetSkillAcceptInput_ReturnValue) == 0x00007C, "Member 'BP_Input_Sanhua_C___1__::CallFunc_GetSkillAcceptInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_GetPriority_ReturnValue) == 0x000080, "Member 'BP_Input_Sanhua_C___1__::CallFunc_GetPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue) == 0x000084, "Member 'BP_Input_Sanhua_C___1__::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_GetSkillIdWithGroupId_ReturnValue) == 0x000088, "Member 'BP_Input_Sanhua_C___1__::CallFunc_GetSkillIdWithGroupId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_GetSkillInfo_ReturnValue) == 0x000098, "Member 'BP_Input_Sanhua_C___1__::CallFunc_GetSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_GetActivePriority_ReturnValue) == 0x000208, "Member 'BP_Input_Sanhua_C___1__::CallFunc_GetActivePriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00020C, "Member 'BP_Input_Sanhua_C___1__::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00020D, "Member 'BP_Input_Sanhua_C___1__::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_BooleanAND_ReturnValue) == 0x00020E, "Member 'BP_Input_Sanhua_C___1__::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_Not_PreBool_ReturnValue) == 0x00020F, "Member 'BP_Input_Sanhua_C___1__::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000210, "Member 'BP_Input_Sanhua_C___1__::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_BooleanOR_ReturnValue) == 0x000211, "Member 'BP_Input_Sanhua_C___1__::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_BooleanOR_ReturnValue_1) == 0x000212, "Member 'BP_Input_Sanhua_C___1__::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_CanResponseInput_ReturnValue) == 0x000213, "Member 'BP_Input_Sanhua_C___1__::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_BooleanOR_ReturnValue_2) == 0x000214, "Member 'BP_Input_Sanhua_C___1__::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc___1___ReturnValue) == 0x000218, "Member 'BP_Input_Sanhua_C___1__::CallFunc___1___ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00022C, "Member 'BP_Input_Sanhua_C___1__::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00022D, "Member 'BP_Input_Sanhua_C___1__::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_IsMovingOnGround_ReturnValue) == 0x00022E, "Member 'BP_Input_Sanhua_C___1__::CallFunc_IsMovingOnGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_BooleanAND_ReturnValue_1) == 0x00022F, "Member 'BP_Input_Sanhua_C___1__::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Input_Sanhua_C___1__, CallFunc_BooleanOR_ReturnValue_3) == 0x000230, "Member 'BP_Input_Sanhua_C___1__::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function BP_Input_Sanhua.BP_Input_Sanhua_C.;û¬w
// 0x0430 (0x0430 - 0x0000)
struct BP_Input_Sanhua_C____w final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc______ReturnValue;                         // 0x0028(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D8[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         ___wildcard_Variable;                              // 0x0040(0x0014)(NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand;                   // 0x0054(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D9[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue;        // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue;                 // 0x0080(0x0170)(HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue;            // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___wildcard_Variable_1;                            // 0x01F4(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37DA[0x1];                                     // 0x020B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_1;                 // 0x020C(0x0014)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
