#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractFoliageManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractFoliageManager.BP_InteractFoliageManager_C
// 0x0070 (0x0320 - 0x02B0)
class ABP_InteractFoliageManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Interactor;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CharacterTransform;                                // 0x02D0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void CheckActive();
	void DebugInteractor();
	void ExecuteUbergraph_BP_InteractFoliageManager(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractFoliageManager_C">();
	}
	static class ABP_InteractFoliageManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractFoliageManager_C>();
	}
};
static_assert(alignof(ABP_InteractFoliageManager_C) == 0x000010, "Wrong alignment on ABP_InteractFoliageManager_C");
static_assert(sizeof(ABP_InteractFoliageManager_C) == 0x000320, "Wrong size on ABP_InteractFoliageManager_C");
static_assert(offsetof(ABP_InteractFoliageManager_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_InteractFoliageManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InteractFoliageManager_C, Interactor) == 0x0002B8, "Member 'ABP_InteractFoliageManager_C::Interactor' has a wrong offset!");
static_assert(offsetof(ABP_InteractFoliageManager_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_InteractFoliageManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_InteractFoliageManager_C, CharacterTransform) == 0x0002D0, "Member 'ABP_InteractFoliageManager_C::CharacterTransform' has a wrong offset!");
static_assert(offsetof(ABP_InteractFoliageManager_C, Active) == 0x000310, "Member 'ABP_InteractFoliageManager_C::Active' has a wrong offset!");

}

