#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KuroISMGroup

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_KuroISMGroup.BP_KuroISMGroup_C
// 0x0040 (0x02F0 - 0x02B0)
class ABP_KuroISMGroup_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HideLogicallyOnBeginPlay;                          // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DitherProgress;                                    // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTick;                                            // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaSeconds;                                      // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShow;                                            // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParameterName;                                     // 0x02DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatPar_Start;                                    // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloatPar_End;                                      // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_KuroISMGroup(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds_0);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void IsEditor(bool* IsEditor_0);
	void EditorValidCheck();
	void SeyLogicallyHiddenForAllChildren();
	void SeyLogicallyShowForAllChildren();
	void MaterialParameterGradient(float DeltalTime);
	void Timer(float* ElapsedTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_KuroISMGroup_C">();
	}
	static class ABP_KuroISMGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_KuroISMGroup_C>();
	}
};
static_assert(alignof(ABP_KuroISMGroup_C) == 0x000008, "Wrong alignment on ABP_KuroISMGroup_C");
static_assert(sizeof(ABP_KuroISMGroup_C) == 0x0002F0, "Wrong size on ABP_KuroISMGroup_C");
static_assert(offsetof(ABP_KuroISMGroup_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_KuroISMGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_KuroISMGroup_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, HideLogicallyOnBeginPlay) == 0x0002C0, "Member 'ABP_KuroISMGroup_C::HideLogicallyOnBeginPlay' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, DitherProgress) == 0x0002C4, "Member 'ABP_KuroISMGroup_C::DitherProgress' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, Duration) == 0x0002C8, "Member 'ABP_KuroISMGroup_C::Duration' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, IsTick) == 0x0002CC, "Member 'ABP_KuroISMGroup_C::IsTick' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, DeltaSeconds) == 0x0002D0, "Member 'ABP_KuroISMGroup_C::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, Time) == 0x0002D4, "Member 'ABP_KuroISMGroup_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, IsShow) == 0x0002D8, "Member 'ABP_KuroISMGroup_C::IsShow' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, ParameterName) == 0x0002DC, "Member 'ABP_KuroISMGroup_C::ParameterName' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, FloatPar_Start) == 0x0002E8, "Member 'ABP_KuroISMGroup_C::FloatPar_Start' has a wrong offset!");
static_assert(offsetof(ABP_KuroISMGroup_C, FloatPar_End) == 0x0002EC, "Member 'ABP_KuroISMGroup_C::FloatPar_End' has a wrong offset!");

}

