#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Portal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Portal.BP_Portal_C
// 0x0330 (0x05E0 - 0x02B0)
class ABP_Portal_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneCaptureComponent2D*               CapturePosition1;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               CapturePosition2;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       PortalWorldTransform1;                             // 0x02D0(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransformDouble                       PortalWorldTransform2;                             // 0x0310(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               DMI_Portal1;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Portal2;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PortalColor1;                                      // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PortalColor2;                                      // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DebugActor1;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DebugActor2;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Portal1Enable;                                     // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Portal2Enable;                                     // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RT2;                                               // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimShowLen_Portal1;                               // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimFadeLen_Portal1;                               // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimIsShowing_Portal1;                             // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            AnimShowCurve_Portal1;                             // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            AnimFadeCurve_Portal1;                             // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimCounter_Portal1;                               // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimShowLen_Portal2;                               // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimFadeLen_Portal2;                               // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnimIsShowing_Portal2;                             // 0x03CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            AnimShowCurve_Portal2;                             // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            AnimFadeCurve_Portal2;                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimCounter_Portal2;                               // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RT1;                                               // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        EffectData_1;                                      // 0x03F0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        EffectData_2;                                      // 0x0410(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                PortalBounds1;                                     // 0x0430(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableDebugCamera1;                                // 0x043C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EnableDebugCamera2;                                // 0x043D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43E[0x2];                                      // 0x043E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PortalBounds2;                                     // 0x0440(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSceneCaptureComponent2DParams         CaptureConfig_Mobile_VeryLow;                      // 0x044C(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSceneCaptureComponent2DParams         CaptureConfig_Mobile_Low;                          // 0x0464(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSceneCaptureComponent2DParams         CaptureConfig_Mobile_Mid;                          // 0x047C(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSceneCaptureComponent2DParams         CaptureConfig_Mobile_High;                         // 0x0494(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSceneCaptureComponent2DParams         CaptureConfig_Pc_VeryLow;                          // 0x04AC(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSceneCaptureComponent2DParams         CaptureConfig_Pc_Low;                              // 0x04C4(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSceneCaptureComponent2DParams         CaptureConfig_Pc_Mid;                              // 0x04DC(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSceneCaptureComponent2DParams         CaptureConfig_Pc_High;                             // 0x04F4(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsMobile;                                          // 0x050C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50D[0x3];                                      // 0x050D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PerformanceLevel_A;                                // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PerformanceLevel_B;                                // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CaptureMaxViewDistance_A;                          // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CaptureMaxViewDistance_B;                          // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableDebugCapture1Params;                         // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EnableDebugCapture2Params;                         // 0x0521(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_522[0x2];                                      // 0x0522(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CapturePerf_Lv0_MaxDist;                           // 0x0524(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapturePerf_Lv1_MaxDist;                           // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapturePerf_Lv2_MaxDist;                           // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, bool>                     Capture1InitShowFlags;                             // 0x0530(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, bool>                     Capture2InitShowFlags;                             // 0x0580(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsMac;                                             // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Portal(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void DEBUG_开启1();
	void SetPortal1Bounds(const struct FVector& Bounds);
	void SetPortal2Bounds(const struct FVector& Bounds);
	void SetPortal1Transform(const struct FTransformDouble& Transform, const struct FTransformDouble& CaptureTransform);
	void SetPortal2Transform(const struct FTransformDouble& Transform, const struct FTransformDouble& CaptureTransform);
	void EnablePortal1Rendering();
	void DisablePortal1Rendering();
	void EnablePortal2Rendering();
	void DisablePortal2Rendering();
	void DEBUG_开启2();
	void DEBUG_关闭1();
	void DEBUG_关闭2();
	void SetCaptureShowingActors(bool IsCapture1, TArray<class AActor*>& HiddenActors, TArray<class AActor*>& ForceShowActors);
	void SetCaptureMaxViewDistance(bool IsCapture1, float MaxViewDistance);
	void GetCaptureShowFlags(bool IsCapture1, TMap<class FString, bool>* ShowFlags);
	void SetCaptureShowFlags(bool IsCapture1, const TMap<class FString, bool>& ShowFlags);
	void UpdatePortalAnimation(float ShowLen, float FadeLen, bool IsShown, class UCurveFloat* ShowCurve, class UCurveFloat* FadeCurve, float Counter, class UStaticMeshComponent* SM, class UStaticMeshComponent* DMI, float* OutputCounter, float* Factor);
	void UpdatePortalsCameraPosition();
	void GetMappingTransformToOtherPortal(const struct FTransformDouble& SourceTransform, bool bA2B, struct FTransformDouble* TargetTransform);
	void DrawDebugFrustum(const struct FTransformDouble& Transform, float FovX, float NearClipPlane, float AspectRatio);
	void GetAngleBetweenVector(const struct FVector& Vector1, const struct FVector& Vector2, float* Angle);
	void ApplyCapturePerformace(bool IsPortalA, int32 ConfigLevel, float CaptureMaxViewDistance);
	void CheckCapturePerformanceLevel(bool isPortalA, const struct FTransformDouble& targetTrans);
	void PrintDebugCaptureParams(bool IsCapture1, const struct FSceneCaptureComponent2DParams& CaptureParam);
	void DrawDebugPortalBounds(bool IsPortal1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Portal_C">();
	}
	static class ABP_Portal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Portal_C>();
	}
};
static_assert(alignof(ABP_Portal_C) == 0x000010, "Wrong alignment on ABP_Portal_C");
static_assert(sizeof(ABP_Portal_C) == 0x0005E0, "Wrong size on ABP_Portal_C");
static_assert(offsetof(ABP_Portal_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_Portal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CapturePosition1) == 0x0002B8, "Member 'ABP_Portal_C::CapturePosition1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CapturePosition2) == 0x0002C0, "Member 'ABP_Portal_C::CapturePosition2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_Portal_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, PortalWorldTransform1) == 0x0002D0, "Member 'ABP_Portal_C::PortalWorldTransform1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, PortalWorldTransform2) == 0x000310, "Member 'ABP_Portal_C::PortalWorldTransform2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, DMI_Portal1) == 0x000350, "Member 'ABP_Portal_C::DMI_Portal1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, DMI_Portal2) == 0x000358, "Member 'ABP_Portal_C::DMI_Portal2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, PortalColor1) == 0x000360, "Member 'ABP_Portal_C::PortalColor1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, PortalColor2) == 0x000370, "Member 'ABP_Portal_C::PortalColor2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, DebugActor1) == 0x000380, "Member 'ABP_Portal_C::DebugActor1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, DebugActor2) == 0x000388, "Member 'ABP_Portal_C::DebugActor2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, Portal1Enable) == 0x000390, "Member 'ABP_Portal_C::Portal1Enable' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, Portal2Enable) == 0x000391, "Member 'ABP_Portal_C::Portal2Enable' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, RT2) == 0x000398, "Member 'ABP_Portal_C::RT2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimShowLen_Portal1) == 0x0003A0, "Member 'ABP_Portal_C::AnimShowLen_Portal1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimFadeLen_Portal1) == 0x0003A4, "Member 'ABP_Portal_C::AnimFadeLen_Portal1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimIsShowing_Portal1) == 0x0003A8, "Member 'ABP_Portal_C::AnimIsShowing_Portal1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimShowCurve_Portal1) == 0x0003B0, "Member 'ABP_Portal_C::AnimShowCurve_Portal1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimFadeCurve_Portal1) == 0x0003B8, "Member 'ABP_Portal_C::AnimFadeCurve_Portal1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimCounter_Portal1) == 0x0003C0, "Member 'ABP_Portal_C::AnimCounter_Portal1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimShowLen_Portal2) == 0x0003C4, "Member 'ABP_Portal_C::AnimShowLen_Portal2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimFadeLen_Portal2) == 0x0003C8, "Member 'ABP_Portal_C::AnimFadeLen_Portal2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimIsShowing_Portal2) == 0x0003CC, "Member 'ABP_Portal_C::AnimIsShowing_Portal2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimShowCurve_Portal2) == 0x0003D0, "Member 'ABP_Portal_C::AnimShowCurve_Portal2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimFadeCurve_Portal2) == 0x0003D8, "Member 'ABP_Portal_C::AnimFadeCurve_Portal2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, AnimCounter_Portal2) == 0x0003E0, "Member 'ABP_Portal_C::AnimCounter_Portal2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, RT1) == 0x0003E8, "Member 'ABP_Portal_C::RT1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, EffectData_1) == 0x0003F0, "Member 'ABP_Portal_C::EffectData_1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, EffectData_2) == 0x000410, "Member 'ABP_Portal_C::EffectData_2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, PortalBounds1) == 0x000430, "Member 'ABP_Portal_C::PortalBounds1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, EnableDebugCamera1) == 0x00043C, "Member 'ABP_Portal_C::EnableDebugCamera1' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, EnableDebugCamera2) == 0x00043D, "Member 'ABP_Portal_C::EnableDebugCamera2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, PortalBounds2) == 0x000440, "Member 'ABP_Portal_C::PortalBounds2' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureConfig_Mobile_VeryLow) == 0x00044C, "Member 'ABP_Portal_C::CaptureConfig_Mobile_VeryLow' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureConfig_Mobile_Low) == 0x000464, "Member 'ABP_Portal_C::CaptureConfig_Mobile_Low' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureConfig_Mobile_Mid) == 0x00047C, "Member 'ABP_Portal_C::CaptureConfig_Mobile_Mid' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureConfig_Mobile_High) == 0x000494, "Member 'ABP_Portal_C::CaptureConfig_Mobile_High' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureConfig_Pc_VeryLow) == 0x0004AC, "Member 'ABP_Portal_C::CaptureConfig_Pc_VeryLow' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureConfig_Pc_Low) == 0x0004C4, "Member 'ABP_Portal_C::CaptureConfig_Pc_Low' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureConfig_Pc_Mid) == 0x0004DC, "Member 'ABP_Portal_C::CaptureConfig_Pc_Mid' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureConfig_Pc_High) == 0x0004F4, "Member 'ABP_Portal_C::CaptureConfig_Pc_High' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, IsMobile) == 0x00050C, "Member 'ABP_Portal_C::IsMobile' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, PerformanceLevel_A) == 0x000510, "Member 'ABP_Portal_C::PerformanceLevel_A' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, PerformanceLevel_B) == 0x000514, "Member 'ABP_Portal_C::PerformanceLevel_B' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureMaxViewDistance_A) == 0x000518, "Member 'ABP_Portal_C::CaptureMaxViewDistance_A' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CaptureMaxViewDistance_B) == 0x00051C, "Member 'ABP_Portal_C::CaptureMaxViewDistance_B' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, EnableDebugCapture1Params) == 0x000520, "Member 'ABP_Portal_C::EnableDebugCapture1Params' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, EnableDebugCapture2Params) == 0x000521, "Member 'ABP_Portal_C::EnableDebugCapture2Params' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CapturePerf_Lv0_MaxDist) == 0x000524, "Member 'ABP_Portal_C::CapturePerf_Lv0_MaxDist' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CapturePerf_Lv1_MaxDist) == 0x000528, "Member 'ABP_Portal_C::CapturePerf_Lv1_MaxDist' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, CapturePerf_Lv2_MaxDist) == 0x00052C, "Member 'ABP_Portal_C::CapturePerf_Lv2_MaxDist' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, Capture1InitShowFlags) == 0x000530, "Member 'ABP_Portal_C::Capture1InitShowFlags' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, Capture2InitShowFlags) == 0x000580, "Member 'ABP_Portal_C::Capture2InitShowFlags' has a wrong offset!");
static_assert(offsetof(ABP_Portal_C, IsMac) == 0x0005D0, "Member 'ABP_Portal_C::IsMac' has a wrong offset!");

}

