#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Portal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"


namespace SDK::Params
{

// Function BP_Portal.BP_Portal_C.ExecuteUbergraph_BP_Portal
// 0x0028 (0x0028 - 0x0000)
struct BP_Portal_C_ExecuteUbergraph_BP_Portal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroFeatureLevel                             CallFunc_GetWorldFeatureLevel_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Portal_C_ExecuteUbergraph_BP_Portal) == 0x000008, "Wrong alignment on BP_Portal_C_ExecuteUbergraph_BP_Portal");
static_assert(sizeof(BP_Portal_C_ExecuteUbergraph_BP_Portal) == 0x000028, "Wrong size on BP_Portal_C_ExecuteUbergraph_BP_Portal");
static_assert(offsetof(BP_Portal_C_ExecuteUbergraph_BP_Portal, EntryPoint) == 0x000000, "Member 'BP_Portal_C_ExecuteUbergraph_BP_Portal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_ExecuteUbergraph_BP_Portal, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'BP_Portal_C_ExecuteUbergraph_BP_Portal::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_ExecuteUbergraph_BP_Portal, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'BP_Portal_C_ExecuteUbergraph_BP_Portal::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_ExecuteUbergraph_BP_Portal, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_Portal_C_ExecuteUbergraph_BP_Portal::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_ExecuteUbergraph_BP_Portal, CallFunc_GetWorldFeatureLevel_ReturnValue) == 0x000020, "Member 'BP_Portal_C_ExecuteUbergraph_BP_Portal::CallFunc_GetWorldFeatureLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_ExecuteUbergraph_BP_Portal, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'BP_Portal_C_ExecuteUbergraph_BP_Portal::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Portal_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Portal_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Portal_C_ReceiveTick");
static_assert(sizeof(BP_Portal_C_ReceiveTick) == 0x000004, "Wrong size on BP_Portal_C_ReceiveTick");
static_assert(offsetof(BP_Portal_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Portal_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Portal_C_UserConstructionScript final
{
public:
	bool                                          IsPortalA;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               CaptureComp;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, bool>                     CallFunc_GetCaptureShowFlags_ShowFlags;            // 0x0010(0x0050)()
	TMap<class FString, bool>                     CallFunc_GetCaptureShowFlags_ShowFlags_1;          // 0x0060(0x0050)()
};
static_assert(alignof(BP_Portal_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Portal_C_UserConstructionScript");
static_assert(sizeof(BP_Portal_C_UserConstructionScript) == 0x0000B0, "Wrong size on BP_Portal_C_UserConstructionScript");
static_assert(offsetof(BP_Portal_C_UserConstructionScript, IsPortalA) == 0x000000, "Member 'BP_Portal_C_UserConstructionScript::IsPortalA' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UserConstructionScript, CaptureComp) == 0x000008, "Member 'BP_Portal_C_UserConstructionScript::CaptureComp' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UserConstructionScript, CallFunc_GetCaptureShowFlags_ShowFlags) == 0x000010, "Member 'BP_Portal_C_UserConstructionScript::CallFunc_GetCaptureShowFlags_ShowFlags' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UserConstructionScript, CallFunc_GetCaptureShowFlags_ShowFlags_1) == 0x000060, "Member 'BP_Portal_C_UserConstructionScript::CallFunc_GetCaptureShowFlags_ShowFlags_1' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.DEBUG_开启1
// 0x0040 (0x0040 - 0x0000)
struct BP_Portal_C_DEBUG_开启1 final
{
public:
	struct FTransformDouble                       CallFunc_D_GetTransform_ReturnValue;               // 0x0000(0x0040)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Portal_C_DEBUG_开启1) == 0x000010, "Wrong alignment on BP_Portal_C_DEBUG_开启1");
static_assert(sizeof(BP_Portal_C_DEBUG_开启1) == 0x000040, "Wrong size on BP_Portal_C_DEBUG_开启1");
static_assert(offsetof(BP_Portal_C_DEBUG_开启1, CallFunc_D_GetTransform_ReturnValue) == 0x000000, "Member 'BP_Portal_C_DEBUG_开启1::CallFunc_D_GetTransform_ReturnValue' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.SetPortal1Bounds
// 0x0024 (0x0024 - 0x0000)
struct BP_Portal_C_SetPortal1Bounds final
{
public:
	struct FVector                                Bounds;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Portal_C_SetPortal1Bounds) == 0x000004, "Wrong alignment on BP_Portal_C_SetPortal1Bounds");
static_assert(sizeof(BP_Portal_C_SetPortal1Bounds) == 0x000024, "Wrong size on BP_Portal_C_SetPortal1Bounds");
static_assert(offsetof(BP_Portal_C_SetPortal1Bounds, Bounds) == 0x000000, "Member 'BP_Portal_C_SetPortal1Bounds::Bounds' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal1Bounds, CallFunc_BreakVector_X) == 0x00000C, "Member 'BP_Portal_C_SetPortal1Bounds::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal1Bounds, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_Portal_C_SetPortal1Bounds::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal1Bounds, CallFunc_BreakVector_Z) == 0x000014, "Member 'BP_Portal_C_SetPortal1Bounds::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal1Bounds, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_Portal_C_SetPortal1Bounds::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.SetPortal2Bounds
// 0x0024 (0x0024 - 0x0000)
struct BP_Portal_C_SetPortal2Bounds final
{
public:
	struct FVector                                Bounds;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Portal_C_SetPortal2Bounds) == 0x000004, "Wrong alignment on BP_Portal_C_SetPortal2Bounds");
static_assert(sizeof(BP_Portal_C_SetPortal2Bounds) == 0x000024, "Wrong size on BP_Portal_C_SetPortal2Bounds");
static_assert(offsetof(BP_Portal_C_SetPortal2Bounds, Bounds) == 0x000000, "Member 'BP_Portal_C_SetPortal2Bounds::Bounds' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal2Bounds, CallFunc_BreakVector_X) == 0x00000C, "Member 'BP_Portal_C_SetPortal2Bounds::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal2Bounds, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_Portal_C_SetPortal2Bounds::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal2Bounds, CallFunc_BreakVector_Z) == 0x000014, "Member 'BP_Portal_C_SetPortal2Bounds::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal2Bounds, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_Portal_C_SetPortal2Bounds::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.SetPortal1Transform
// 0x0080 (0x0080 - 0x0000)
struct BP_Portal_C_SetPortal1Transform final
{
public:
	struct FTransformDouble                       Transform;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FTransformDouble                       CaptureTransform;                                  // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Portal_C_SetPortal1Transform) == 0x000010, "Wrong alignment on BP_Portal_C_SetPortal1Transform");
static_assert(sizeof(BP_Portal_C_SetPortal1Transform) == 0x000080, "Wrong size on BP_Portal_C_SetPortal1Transform");
static_assert(offsetof(BP_Portal_C_SetPortal1Transform, Transform) == 0x000000, "Member 'BP_Portal_C_SetPortal1Transform::Transform' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal1Transform, CaptureTransform) == 0x000040, "Member 'BP_Portal_C_SetPortal1Transform::CaptureTransform' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.SetPortal2Transform
// 0x0080 (0x0080 - 0x0000)
struct BP_Portal_C_SetPortal2Transform final
{
public:
	struct FTransformDouble                       Transform;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FTransformDouble                       CaptureTransform;                                  // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Portal_C_SetPortal2Transform) == 0x000010, "Wrong alignment on BP_Portal_C_SetPortal2Transform");
static_assert(sizeof(BP_Portal_C_SetPortal2Transform) == 0x000080, "Wrong size on BP_Portal_C_SetPortal2Transform");
static_assert(offsetof(BP_Portal_C_SetPortal2Transform, Transform) == 0x000000, "Member 'BP_Portal_C_SetPortal2Transform::Transform' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetPortal2Transform, CaptureTransform) == 0x000040, "Member 'BP_Portal_C_SetPortal2Transform::CaptureTransform' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.DEBUG_开启2
// 0x0040 (0x0040 - 0x0000)
struct BP_Portal_C_DEBUG_开启2 final
{
public:
	struct FTransformDouble                       CallFunc_D_GetTransform_ReturnValue;               // 0x0000(0x0040)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Portal_C_DEBUG_开启2) == 0x000010, "Wrong alignment on BP_Portal_C_DEBUG_开启2");
static_assert(sizeof(BP_Portal_C_DEBUG_开启2) == 0x000040, "Wrong size on BP_Portal_C_DEBUG_开启2");
static_assert(offsetof(BP_Portal_C_DEBUG_开启2, CallFunc_D_GetTransform_ReturnValue) == 0x000000, "Member 'BP_Portal_C_DEBUG_开启2::CallFunc_D_GetTransform_ReturnValue' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.SetCaptureShowingActors
// 0x0030 (0x0030 - 0x0000)
struct BP_Portal_C_SetCaptureShowingActors final
{
public:
	bool                                          IsCapture1;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         HiddenActors;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class AActor*>                         ForceShowActors;                                   // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class USceneCaptureComponent2D*               CaptureComp;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Portal_C_SetCaptureShowingActors) == 0x000008, "Wrong alignment on BP_Portal_C_SetCaptureShowingActors");
static_assert(sizeof(BP_Portal_C_SetCaptureShowingActors) == 0x000030, "Wrong size on BP_Portal_C_SetCaptureShowingActors");
static_assert(offsetof(BP_Portal_C_SetCaptureShowingActors, IsCapture1) == 0x000000, "Member 'BP_Portal_C_SetCaptureShowingActors::IsCapture1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowingActors, HiddenActors) == 0x000008, "Member 'BP_Portal_C_SetCaptureShowingActors::HiddenActors' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowingActors, ForceShowActors) == 0x000018, "Member 'BP_Portal_C_SetCaptureShowingActors::ForceShowActors' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowingActors, CaptureComp) == 0x000028, "Member 'BP_Portal_C_SetCaptureShowingActors::CaptureComp' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.SetCaptureMaxViewDistance
// 0x0008 (0x0008 - 0x0000)
struct BP_Portal_C_SetCaptureMaxViewDistance final
{
public:
	bool                                          IsCapture1;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxViewDistance;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Portal_C_SetCaptureMaxViewDistance) == 0x000004, "Wrong alignment on BP_Portal_C_SetCaptureMaxViewDistance");
static_assert(sizeof(BP_Portal_C_SetCaptureMaxViewDistance) == 0x000008, "Wrong size on BP_Portal_C_SetCaptureMaxViewDistance");
static_assert(offsetof(BP_Portal_C_SetCaptureMaxViewDistance, IsCapture1) == 0x000000, "Member 'BP_Portal_C_SetCaptureMaxViewDistance::IsCapture1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureMaxViewDistance, MaxViewDistance) == 0x000004, "Member 'BP_Portal_C_SetCaptureMaxViewDistance::MaxViewDistance' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.GetCaptureShowFlags
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Portal_C_GetCaptureShowFlags final
{
public:
	bool                                          IsCapture1;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, bool>                     ShowFlags;                                         // 0x0008(0x0050)(Parm, OutParm)
	TMap<class FString, bool>                     ShowFlagCopy;                                      // 0x0058(0x0050)(Edit, BlueprintVisible)
	class USceneCaptureComponent2D*               CaptureComp;                                       // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEngineShowFlagsSetting                CallFunc_Array_Get_Item;                           // 0x00C0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Portal_C_GetCaptureShowFlags) == 0x000008, "Wrong alignment on BP_Portal_C_GetCaptureShowFlags");
static_assert(sizeof(BP_Portal_C_GetCaptureShowFlags) == 0x0000E0, "Wrong size on BP_Portal_C_GetCaptureShowFlags");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, IsCapture1) == 0x000000, "Member 'BP_Portal_C_GetCaptureShowFlags::IsCapture1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, ShowFlags) == 0x000008, "Member 'BP_Portal_C_GetCaptureShowFlags::ShowFlags' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, ShowFlagCopy) == 0x000058, "Member 'BP_Portal_C_GetCaptureShowFlags::ShowFlagCopy' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, CaptureComp) == 0x0000A8, "Member 'BP_Portal_C_GetCaptureShowFlags::CaptureComp' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, ___int_Array_Index_Variable) == 0x0000B0, "Member 'BP_Portal_C_GetCaptureShowFlags::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, ___int_Loop_Counter_Variable) == 0x0000B4, "Member 'BP_Portal_C_GetCaptureShowFlags::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_Portal_C_GetCaptureShowFlags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'BP_Portal_C_GetCaptureShowFlags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'BP_Portal_C_GetCaptureShowFlags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_GetCaptureShowFlags, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'BP_Portal_C_GetCaptureShowFlags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.SetCaptureShowFlags
// 0x0220 (0x0220 - 0x0000)
struct BP_Portal_C_SetCaptureShowFlags final
{
public:
	bool                                          IsCapture1;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, bool>                     ShowFlags;                                         // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	TMap<class FString, bool>                     NewShowFlags;                                      // 0x0058(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, bool>                     InitShowFlags;                                     // 0x00A8(0x0050)(Edit, BlueprintVisible)
	TSet<class FString>                           ExistFlagNameSet;                                  // 0x00F8(0x0050)(Edit, BlueprintVisible)
	class USceneCaptureComponent2D*               CaptureComp;                                       // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0168(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEngineShowFlagsSetting                K2Node_MakeStruct_EngineShowFlagsSetting;          // 0x0190(0x0018)()
	TArray<class FString>                         CallFunc_Map_Keys_Keys_1;                          // 0x01A8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value_1;                         // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys_2;                          // 0x01D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value_2;                         // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Portal_C_SetCaptureShowFlags) == 0x000008, "Wrong alignment on BP_Portal_C_SetCaptureShowFlags");
static_assert(sizeof(BP_Portal_C_SetCaptureShowFlags) == 0x000220, "Wrong size on BP_Portal_C_SetCaptureShowFlags");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, IsCapture1) == 0x000000, "Member 'BP_Portal_C_SetCaptureShowFlags::IsCapture1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, ShowFlags) == 0x000008, "Member 'BP_Portal_C_SetCaptureShowFlags::ShowFlags' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, NewShowFlags) == 0x000058, "Member 'BP_Portal_C_SetCaptureShowFlags::NewShowFlags' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, InitShowFlags) == 0x0000A8, "Member 'BP_Portal_C_SetCaptureShowFlags::InitShowFlags' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, ExistFlagNameSet) == 0x0000F8, "Member 'BP_Portal_C_SetCaptureShowFlags::ExistFlagNameSet' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CaptureComp) == 0x000148, "Member 'BP_Portal_C_SetCaptureShowFlags::CaptureComp' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, ___int_Array_Index_Variable) == 0x000150, "Member 'BP_Portal_C_SetCaptureShowFlags::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, ___int_Array_Index_Variable_1) == 0x000154, "Member 'BP_Portal_C_SetCaptureShowFlags::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, ___int_Loop_Counter_Variable) == 0x000158, "Member 'BP_Portal_C_SetCaptureShowFlags::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Add_IntInt_ReturnValue) == 0x00015C, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, ___int_Array_Index_Variable_2) == 0x000160, "Member 'BP_Portal_C_SetCaptureShowFlags::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Map_Keys_Keys) == 0x000168, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Array_Get_Item) == 0x000178, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Map_Find_Value) == 0x00018C, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Map_Find_ReturnValue) == 0x00018D, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Less_IntInt_ReturnValue) == 0x00018E, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, K2Node_MakeStruct_EngineShowFlagsSetting) == 0x000190, "Member 'BP_Portal_C_SetCaptureShowFlags::K2Node_MakeStruct_EngineShowFlagsSetting' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Map_Keys_Keys_1) == 0x0001A8, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Array_Get_Item_1) == 0x0001B8, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Array_Length_ReturnValue_1) == 0x0001C8, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Map_Find_Value_1) == 0x0001CC, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Map_Find_ReturnValue_1) == 0x0001CD, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, ___int_Loop_Counter_Variable_1) == 0x0001D0, "Member 'BP_Portal_C_SetCaptureShowFlags::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Map_Keys_Keys_2) == 0x0001D8, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001E8, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Array_Get_Item_2) == 0x0001F0, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Map_Find_Value_2) == 0x000200, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Map_Find_ReturnValue_2) == 0x000201, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Array_Length_ReturnValue_2) == 0x000204, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Add_IntInt_ReturnValue_1) == 0x000208, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, ___int_Loop_Counter_Variable_2) == 0x00020C, "Member 'BP_Portal_C_SetCaptureShowFlags::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Less_IntInt_ReturnValue_2) == 0x000210, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Add_IntInt_ReturnValue_2) == 0x000214, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_SetCaptureShowFlags, CallFunc_Array_Add_ReturnValue) == 0x000218, "Member 'BP_Portal_C_SetCaptureShowFlags::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.UpdatePortalAnimation
// 0x0068 (0x0068 - 0x0000)
struct BP_Portal_C_UpdatePortalAnimation final
{
public:
	float                                         ShowLen;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeLen;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShown;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            ShowCurve;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            FadeCurve;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Counter;                                           // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   SM;                                                // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DMI;                                               // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutputCounter;                                     // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Factor;                                            // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         temp;                                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Portal_C_UpdatePortalAnimation) == 0x000008, "Wrong alignment on BP_Portal_C_UpdatePortalAnimation");
static_assert(sizeof(BP_Portal_C_UpdatePortalAnimation) == 0x000068, "Wrong size on BP_Portal_C_UpdatePortalAnimation");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, ShowLen) == 0x000000, "Member 'BP_Portal_C_UpdatePortalAnimation::ShowLen' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, FadeLen) == 0x000004, "Member 'BP_Portal_C_UpdatePortalAnimation::FadeLen' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, IsShown) == 0x000008, "Member 'BP_Portal_C_UpdatePortalAnimation::IsShown' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, ShowCurve) == 0x000010, "Member 'BP_Portal_C_UpdatePortalAnimation::ShowCurve' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, FadeCurve) == 0x000018, "Member 'BP_Portal_C_UpdatePortalAnimation::FadeCurve' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, Counter) == 0x000020, "Member 'BP_Portal_C_UpdatePortalAnimation::Counter' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, SM) == 0x000028, "Member 'BP_Portal_C_UpdatePortalAnimation::SM' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, DMI) == 0x000030, "Member 'BP_Portal_C_UpdatePortalAnimation::DMI' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, OutputCounter) == 0x000038, "Member 'BP_Portal_C_UpdatePortalAnimation::OutputCounter' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, Factor) == 0x00003C, "Member 'BP_Portal_C_UpdatePortalAnimation::Factor' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, temp) == 0x000040, "Member 'BP_Portal_C_UpdatePortalAnimation::temp' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, CallFunc_FClamp_ReturnValue) == 0x000044, "Member 'BP_Portal_C_UpdatePortalAnimation::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, CallFunc_FClamp_ReturnValue_1) == 0x000048, "Member 'BP_Portal_C_UpdatePortalAnimation::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_Portal_C_UpdatePortalAnimation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000050, "Member 'BP_Portal_C_UpdatePortalAnimation::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, CallFunc_GetFloatValue_ReturnValue) == 0x000054, "Member 'BP_Portal_C_UpdatePortalAnimation::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, CallFunc_GetFloatValue_ReturnValue_1) == 0x000058, "Member 'BP_Portal_C_UpdatePortalAnimation::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00005C, "Member 'BP_Portal_C_UpdatePortalAnimation::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Portal_C_UpdatePortalAnimation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_Portal_C_UpdatePortalAnimation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Portal.BP_Portal_C.UpdatePortalsCameraPosition
// 0x0CD0 (0x0CD0 - 0x0000)
struct BP_Portal_C_UpdatePortalsCameraPosition final
{
public:
	struct FVector                                ScaledPortalBounds2;                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ScaledPortalBounds1;                               // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PortalEdgeFarPoint2;                               // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PortalEdgeFarPoint1;                               // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CameraTempTrans2;                                  // 0x0030(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransformDouble                       CameraTempTrans1;                                  // 0x0070(0x0040)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_GetCameraLocation_ReturnValue;          // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_GetCameraLocation_ReturnValue_1;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue_1;          // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue;          // 0x0110(0x0040)(IsPlainOldData, NoDestructor)
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue_1;        // 0x0150(0x0040)(IsPlainOldData, NoDestructor)
	struct FVectorDouble                          CallFunc_BreakTransformDouble_Location;            // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransformDouble_Rotation;            // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransformDouble_Scale;               // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_BreakTransformDouble_Location_1;          // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransformDouble_Rotation_1;          // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransformDouble_Scale_1;             // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_6;      // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_BreakTransformDouble_Location_2;          // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransformDouble_Rotation_2;          // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransformDouble_Scale_2;             // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue_2;        // 0x02B0(0x0040)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_7;      // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_8;      // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_9;      // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_BreakTransformDouble_Location_3;          // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransformDouble_Rotation_3;          // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransformDouble_Scale_3;             // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue_3;        // 0x0350(0x0040)(IsPlainOldData, NoDestructor)
	struct FVectorDouble                          CallFunc_BreakTransformDouble_Location_4;          // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransformDouble_Rotation_4;          // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransformDouble_Scale_4;             // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue_4;        // 0x03C0(0x0040)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue_1;                // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue_2;                // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue_3;                // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_BreakTransformDouble_Location_5;          // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransformDouble_Rotation_5;          // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransformDouble_Scale_5;             // 0x0474(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_BreakTransformDouble_Location_6;          // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransformDouble_Rotation_6;          // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransformDouble_Scale_6;             // 0x04A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_BreakTransformDouble_Location_7;          // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransformDouble_Rotation_7;          // 0x04C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransformDouble_Scale_7;             // 0x04D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue_5;        // 0x04E0(0x0040)(IsPlainOldData, NoDestructor)
	struct FVectorDouble                          CallFunc_D_InverseTransformLocation_ReturnValue;   // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_6;                          // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_6;                          // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_6;                          // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue;    // 0x0544(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
