#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PerformanceDisableLight

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PerformanceDisableLight.BP_PerformanceDisableLight_C
// 0x0018 (0x02D8 - 0x02C0)
class ABP_PerformanceDisableLight_C final : public AKuroEditorTickActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableLight;                                      // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          IsEnableDisable;                                   // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_PerformanceDisableLight(int32 EntryPoint);
	void ReceiveDestroyed();
	void EditorTick(float DeltaSeconds);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void DisableLightFun();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PerformanceDisableLight_C">();
	}
	static class ABP_PerformanceDisableLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PerformanceDisableLight_C>();
	}
};
static_assert(alignof(ABP_PerformanceDisableLight_C) == 0x000008, "Wrong alignment on ABP_PerformanceDisableLight_C");
static_assert(sizeof(ABP_PerformanceDisableLight_C) == 0x0002D8, "Wrong size on ABP_PerformanceDisableLight_C");
static_assert(offsetof(ABP_PerformanceDisableLight_C, UberGraphFrame) == 0x0002C0, "Member 'ABP_PerformanceDisableLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PerformanceDisableLight_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_PerformanceDisableLight_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PerformanceDisableLight_C, DisableLight) == 0x0002D0, "Member 'ABP_PerformanceDisableLight_C::DisableLight' has a wrong offset!");
static_assert(offsetof(ABP_PerformanceDisableLight_C, IsEnableDisable) == 0x0002D1, "Member 'ABP_PerformanceDisableLight_C::IsEnableDisable' has a wrong offset!");

}

