#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RainComponent_CommonDrop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RainComponent_CommonDrop.BP_RainComponent_CommonDrop_C
// 0x0160 (0x0390 - 0x0230)
class UBP_RainComponent_CommonDrop_C final : public UKuroRainComponent
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         RandomSpawnerHandle;                               // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArraySpawnerHandle;                                // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CycleBoxHandle;                                    // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          Center;                                            // 0x0248(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Drag;                                              // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Gravity;                                           // 0x0264(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Wind;                                              // 0x0270(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WindHandle;                                        // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GravityHandle;                                     // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DragHandle;                                        // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TempSpawnSpeed;                                    // 0x0288(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPDA_RainConfig_CommonDrop_C*           RainConfig;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, int32>                            ArraySpawnerHandles;                               // 0x02A0(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TMap<int32, int32>                            RandomSpawnerHandles;                              // 0x02F0(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	float                                         PassTime;                                          // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnScale;                                        // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPendingDeactivate;                               // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          ActualSpawnCenter;                                 // 0x0350(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GlobalWind;                                        // 0x0368(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GlobalDensity;                                     // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NiagaraValid;                                      // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RainFogDensity;                                    // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DeactivateRain();
	void StopRain();
	void Start_Rain();
	void PreSolveRainParticles(float DeltaSeconds);
	void SetupRainEmitters();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_RainComponent_CommonDrop(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RainComponent_CommonDrop_C">();
	}
	static class UBP_RainComponent_CommonDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RainComponent_CommonDrop_C>();
	}
};
static_assert(alignof(UBP_RainComponent_CommonDrop_C) == 0x000010, "Wrong alignment on UBP_RainComponent_CommonDrop_C");
static_assert(sizeof(UBP_RainComponent_CommonDrop_C) == 0x000390, "Wrong size on UBP_RainComponent_CommonDrop_C");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, UberGraphFrame) == 0x000230, "Member 'UBP_RainComponent_CommonDrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, RandomSpawnerHandle) == 0x000238, "Member 'UBP_RainComponent_CommonDrop_C::RandomSpawnerHandle' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, ArraySpawnerHandle) == 0x00023C, "Member 'UBP_RainComponent_CommonDrop_C::ArraySpawnerHandle' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, CycleBoxHandle) == 0x000240, "Member 'UBP_RainComponent_CommonDrop_C::CycleBoxHandle' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, Center) == 0x000248, "Member 'UBP_RainComponent_CommonDrop_C::Center' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, Drag) == 0x000260, "Member 'UBP_RainComponent_CommonDrop_C::Drag' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, Gravity) == 0x000264, "Member 'UBP_RainComponent_CommonDrop_C::Gravity' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, Wind) == 0x000270, "Member 'UBP_RainComponent_CommonDrop_C::Wind' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, WindHandle) == 0x00027C, "Member 'UBP_RainComponent_CommonDrop_C::WindHandle' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, GravityHandle) == 0x000280, "Member 'UBP_RainComponent_CommonDrop_C::GravityHandle' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, DragHandle) == 0x000284, "Member 'UBP_RainComponent_CommonDrop_C::DragHandle' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, TempSpawnSpeed) == 0x000288, "Member 'UBP_RainComponent_CommonDrop_C::TempSpawnSpeed' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, RainConfig) == 0x000298, "Member 'UBP_RainComponent_CommonDrop_C::RainConfig' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, ArraySpawnerHandles) == 0x0002A0, "Member 'UBP_RainComponent_CommonDrop_C::ArraySpawnerHandles' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, RandomSpawnerHandles) == 0x0002F0, "Member 'UBP_RainComponent_CommonDrop_C::RandomSpawnerHandles' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, PassTime) == 0x000340, "Member 'UBP_RainComponent_CommonDrop_C::PassTime' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, SpawnScale) == 0x000344, "Member 'UBP_RainComponent_CommonDrop_C::SpawnScale' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, IsPendingDeactivate) == 0x000348, "Member 'UBP_RainComponent_CommonDrop_C::IsPendingDeactivate' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, ActualSpawnCenter) == 0x000350, "Member 'UBP_RainComponent_CommonDrop_C::ActualSpawnCenter' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, GlobalWind) == 0x000368, "Member 'UBP_RainComponent_CommonDrop_C::GlobalWind' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, GlobalDensity) == 0x000374, "Member 'UBP_RainComponent_CommonDrop_C::GlobalDensity' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, NiagaraComponent) == 0x000378, "Member 'UBP_RainComponent_CommonDrop_C::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, NiagaraValid) == 0x000380, "Member 'UBP_RainComponent_CommonDrop_C::NiagaraValid' has a wrong offset!");
static_assert(offsetof(UBP_RainComponent_CommonDrop_C, RainFogDensity) == 0x000384, "Member 'UBP_RainComponent_CommonDrop_C::RainFogDensity' has a wrong offset!");

}

