#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RippleWater_Data

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RippleWater_Data.BP_RippleWater_Data_C
// 0x0018 (0x0050 - 0x0038)
class UBP_RippleWater_Data_C final : public UPrimaryDataAsset
{
public:
	float                                         Step;                                              // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         captureSize;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerSize;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RippleDistanceNormal;                              // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RippleDistanceFluo;                                // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SwimRippleOffset;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RippleWater_Data_C">();
	}
	static class UBP_RippleWater_Data_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RippleWater_Data_C>();
	}
};
static_assert(alignof(UBP_RippleWater_Data_C) == 0x000008, "Wrong alignment on UBP_RippleWater_Data_C");
static_assert(sizeof(UBP_RippleWater_Data_C) == 0x000050, "Wrong size on UBP_RippleWater_Data_C");
static_assert(offsetof(UBP_RippleWater_Data_C, Step) == 0x000038, "Member 'UBP_RippleWater_Data_C::Step' has a wrong offset!");
static_assert(offsetof(UBP_RippleWater_Data_C, captureSize) == 0x00003C, "Member 'UBP_RippleWater_Data_C::captureSize' has a wrong offset!");
static_assert(offsetof(UBP_RippleWater_Data_C, PlayerSize) == 0x000040, "Member 'UBP_RippleWater_Data_C::PlayerSize' has a wrong offset!");
static_assert(offsetof(UBP_RippleWater_Data_C, RippleDistanceNormal) == 0x000044, "Member 'UBP_RippleWater_Data_C::RippleDistanceNormal' has a wrong offset!");
static_assert(offsetof(UBP_RippleWater_Data_C, RippleDistanceFluo) == 0x000048, "Member 'UBP_RippleWater_Data_C::RippleDistanceFluo' has a wrong offset!");
static_assert(offsetof(UBP_RippleWater_Data_C, SwimRippleOffset) == 0x00004C, "Member 'UBP_RippleWater_Data_C::SwimRippleOffset' has a wrong offset!");

}

