#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SuperFarFog

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_structs.hpp"


namespace SDK::Params
{

// Function BP_SuperFarFog.BP_SuperFarFog_C.UserConstructionScript
// 0x0003 (0x0003 - 0x0000)
struct BP_SuperFarFog_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SuperFarFog_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_SuperFarFog_C_UserConstructionScript");
static_assert(sizeof(BP_SuperFarFog_C_UserConstructionScript) == 0x000003, "Wrong size on BP_SuperFarFog_C_UserConstructionScript");
static_assert(offsetof(BP_SuperFarFog_C_UserConstructionScript, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000000, "Member 'BP_SuperFarFog_C_UserConstructionScript::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_UserConstructionScript, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000001, "Member 'BP_SuperFarFog_C_UserConstructionScript::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000002, "Member 'BP_SuperFarFog_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_SuperFarFog.BP_SuperFarFog_C.ExecuteUbergraph_BP_SuperFarFog
// 0x0020 (0x0020 - 0x0000)
struct BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKuroFeatureLevel                             CallFunc_GetWorldFeatureLevel_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog) == 0x000004, "Wrong alignment on BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog");
static_assert(sizeof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog) == 0x000020, "Wrong size on BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog");
static_assert(offsetof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog, EntryPoint) == 0x000000, "Member 'BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog, CallFunc_BreakVector2D_X) == 0x00000C, "Member 'BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog, CallFunc_GetWorldFeatureLevel_ReturnValue) == 0x000018, "Member 'BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog::CallFunc_GetWorldFeatureLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog, CallFunc_SelectFloat_ReturnValue) == 0x00001C, "Member 'BP_SuperFarFog_C_ExecuteUbergraph_BP_SuperFarFog::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

}

