#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkiConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkiConfig.BP_SkiConfig_C
// 0x0050 (0x0088 - 0x0038)
class UBP_SkiConfig_C final : public UPrimaryDataAsset
{
public:
	float                                         ____;                                              // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L___;                                              // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _____;                                             // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______0;                                           // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______;                                            // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _a_____;                                           // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _a______;                                          // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __6___;                                            // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __l____p;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___z___p;                                          // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______p;                                          // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______sb__;                                        // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  __Tag;                                             // 0x0068(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkiConfig_C">();
	}
	static class UBP_SkiConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkiConfig_C>();
	}
};
static_assert(alignof(UBP_SkiConfig_C) == 0x000008, "Wrong alignment on UBP_SkiConfig_C");
static_assert(sizeof(UBP_SkiConfig_C) == 0x000088, "Wrong size on UBP_SkiConfig_C");
static_assert(offsetof(UBP_SkiConfig_C, ____) == 0x000038, "Member 'UBP_SkiConfig_C::____' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, L___) == 0x00003C, "Member 'UBP_SkiConfig_C::L___' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, _____) == 0x000040, "Member 'UBP_SkiConfig_C::_____' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, ______0) == 0x000044, "Member 'UBP_SkiConfig_C::______0' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, ______) == 0x000048, "Member 'UBP_SkiConfig_C::______' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, _a_____) == 0x00004C, "Member 'UBP_SkiConfig_C::_a_____' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, _a______) == 0x000050, "Member 'UBP_SkiConfig_C::_a______' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, __6___) == 0x000054, "Member 'UBP_SkiConfig_C::__6___' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, __l____p) == 0x000058, "Member 'UBP_SkiConfig_C::__l____p' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, ___z___p) == 0x00005C, "Member 'UBP_SkiConfig_C::___z___p' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, _______p) == 0x000060, "Member 'UBP_SkiConfig_C::_______p' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, ______sb__) == 0x000064, "Member 'UBP_SkiConfig_C::______sb__' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, __Tag) == 0x000068, "Member 'UBP_SkiConfig_C::__Tag' has a wrong offset!");

}

