#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenEffectPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"
#include "E_SE_PlayState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ScreenEffectPlayer.BP_ScreenEffectPlayer_C
// 0x0080 (0x0330 - 0x02B0)
class ABP_ScreenEffectPlayer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UEffectScreenPlayData_C*                Data;                                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SE_PlayState                                State;                                             // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeCounter;                                       // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UActorComponent*>                CachedComponents;                                  // 0x02D8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          bToHide;                                           // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeSpeed;                                         // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CachedUIActors;                                    // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          bVisible;                                          // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AUIContainerActor*                      ScreenEffectRoot;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedToDestroy;                                    // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CacheEnvironmentFactor;                            // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParameterTweenProgress;                            // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParameterTweenSpeed;                               // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParameterTweenTarget;                              // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AlmostEqual(float val1, float val2, bool* isequal);
	void SetExtraState(int32 ExtraState);
	void Refresh_Addition_Parameter(float TweenProgress);
	void TweenParameterSpeed(float TweenTarget, float TweenSpeed, float TweenDeltaSecond);
	void BP_ScreenEffectPlayer_AutoGenFunc();
	void DelayEndAudioCall();
	void UpdatePlayerSEEnvironmentFactor(float EnvironmentFactor);
	void Destroy_Player();
	void ClearPlayer();
	void InitPlayer(class UEffectScreenPlayData_C* Data_0, class AUIContainerActor* ScreenEffectRoot_0);
	void BeforeStart();
	void Set_Effect_Hidden(bool bToHide_0, bool bOverrideFadeSpeed, float OverrideFadeSpeed);
	void SetUIVisible(bool Visible);
	void UpdateComponentsAlpha();
	void UpdateComponents();
	void EndPlayer();
	void Start_Player();
	void TweenParameter(float TweenTarget);
	void TweenParameterImmediately(float TweenTarget);
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_ScreenEffectPlayer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ScreenEffectPlayer_C">();
	}
	static class ABP_ScreenEffectPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ScreenEffectPlayer_C>();
	}
};
static_assert(alignof(ABP_ScreenEffectPlayer_C) == 0x000008, "Wrong alignment on ABP_ScreenEffectPlayer_C");
static_assert(sizeof(ABP_ScreenEffectPlayer_C) == 0x000330, "Wrong size on ABP_ScreenEffectPlayer_C");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_ScreenEffectPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_ScreenEffectPlayer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, Data) == 0x0002C0, "Member 'ABP_ScreenEffectPlayer_C::Data' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, State) == 0x0002C8, "Member 'ABP_ScreenEffectPlayer_C::State' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, TimeCounter) == 0x0002CC, "Member 'ABP_ScreenEffectPlayer_C::TimeCounter' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, TargetActor) == 0x0002D0, "Member 'ABP_ScreenEffectPlayer_C::TargetActor' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, CachedComponents) == 0x0002D8, "Member 'ABP_ScreenEffectPlayer_C::CachedComponents' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, bToHide) == 0x0002E8, "Member 'ABP_ScreenEffectPlayer_C::bToHide' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, Alpha) == 0x0002EC, "Member 'ABP_ScreenEffectPlayer_C::Alpha' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, FadeSpeed) == 0x0002F0, "Member 'ABP_ScreenEffectPlayer_C::FadeSpeed' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, CachedUIActors) == 0x0002F8, "Member 'ABP_ScreenEffectPlayer_C::CachedUIActors' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, bVisible) == 0x000308, "Member 'ABP_ScreenEffectPlayer_C::bVisible' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, ScreenEffectRoot) == 0x000310, "Member 'ABP_ScreenEffectPlayer_C::ScreenEffectRoot' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, bNeedToDestroy) == 0x000318, "Member 'ABP_ScreenEffectPlayer_C::bNeedToDestroy' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, CacheEnvironmentFactor) == 0x00031C, "Member 'ABP_ScreenEffectPlayer_C::CacheEnvironmentFactor' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, ParameterTweenProgress) == 0x000320, "Member 'ABP_ScreenEffectPlayer_C::ParameterTweenProgress' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, ParameterTweenSpeed) == 0x000324, "Member 'ABP_ScreenEffectPlayer_C::ParameterTweenSpeed' has a wrong offset!");
static_assert(offsetof(ABP_ScreenEffectPlayer_C, ParameterTweenTarget) == 0x000328, "Member 'ABP_ScreenEffectPlayer_C::ParameterTweenTarget' has a wrong offset!");

}

