#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurfaceRipple

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SurfaceRipple.BP_SurfaceRipple_C.SetRainIntensity
// 0x0004 (0x0004 - 0x0000)
struct BP_SurfaceRipple_C_SetRainIntensity final
{
public:
	float                                         RainIntensity;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurfaceRipple_C_SetRainIntensity) == 0x000004, "Wrong alignment on BP_SurfaceRipple_C_SetRainIntensity");
static_assert(sizeof(BP_SurfaceRipple_C_SetRainIntensity) == 0x000004, "Wrong size on BP_SurfaceRipple_C_SetRainIntensity");
static_assert(offsetof(BP_SurfaceRipple_C_SetRainIntensity, RainIntensity) == 0x000000, "Member 'BP_SurfaceRipple_C_SetRainIntensity::RainIntensity' has a wrong offset!");

// Function BP_SurfaceRipple.BP_SurfaceRipple_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_SurfaceRipple_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurfaceRipple_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_SurfaceRipple_C_UserConstructionScript");
static_assert(sizeof(BP_SurfaceRipple_C_UserConstructionScript) == 0x000008, "Wrong size on BP_SurfaceRipple_C_UserConstructionScript");
static_assert(offsetof(BP_SurfaceRipple_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_SurfaceRipple_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_SurfaceRipple.BP_SurfaceRipple_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SurfaceRipple_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurfaceRipple_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SurfaceRipple_C_ReceiveTick");
static_assert(sizeof(BP_SurfaceRipple_C_ReceiveTick) == 0x000004, "Wrong size on BP_SurfaceRipple_C_ReceiveTick");
static_assert(offsetof(BP_SurfaceRipple_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SurfaceRipple_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SurfaceRipple.BP_SurfaceRipple_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_SurfaceRipple_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurfaceRipple_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_SurfaceRipple_C_ReceiveEndPlay");
static_assert(sizeof(BP_SurfaceRipple_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_SurfaceRipple_C_ReceiveEndPlay");
static_assert(offsetof(BP_SurfaceRipple_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_SurfaceRipple_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_SurfaceRipple.BP_SurfaceRipple_C.EditorTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SurfaceRipple_C_EditorTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurfaceRipple_C_EditorTick) == 0x000004, "Wrong alignment on BP_SurfaceRipple_C_EditorTick");
static_assert(sizeof(BP_SurfaceRipple_C_EditorTick) == 0x000004, "Wrong size on BP_SurfaceRipple_C_EditorTick");
static_assert(offsetof(BP_SurfaceRipple_C_EditorTick, DeltaSeconds) == 0x000000, "Member 'BP_SurfaceRipple_C_EditorTick::DeltaSeconds' has a wrong offset!");

// Function BP_SurfaceRipple.BP_SurfaceRipple_C.ExecuteUbergraph_BP_SurfaceRipple
// 0x0014 (0x0014 - 0x0000)
struct BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds_1;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple) == 0x000004, "Wrong alignment on BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple");
static_assert(sizeof(BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple) == 0x000014, "Wrong size on BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple");
static_assert(offsetof(BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple, EntryPoint) == 0x000000, "Member 'BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple, K2Node_Event_DeltaSeconds_1) == 0x000004, "Member 'BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple::K2Node_Event_DeltaSeconds_1' has a wrong offset!");
static_assert(offsetof(BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple, K2Node_Event_EndPlayReason) == 0x000009, "Member 'BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'BP_SurfaceRipple_C_ExecuteUbergraph_BP_SurfaceRipple::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

}

