#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurfaceRipple

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SurfaceRipple.BP_SurfaceRipple_C
// 0x0038 (0x02F8 - 0x02C0)
class ABP_SurfaceRipple_C final : public AKuroEditorTickActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EKuroRainType                                 CurrentRainType;                                   // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RainDensity;                                       // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Ripple;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RT_Ripple;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 FollowActor;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSim;                                              // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SetRainIntensity(float RainIntensity);
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void EditorTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_SurfaceRipple(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SurfaceRipple_C">();
	}
	static class ABP_SurfaceRipple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SurfaceRipple_C>();
	}
};
static_assert(alignof(ABP_SurfaceRipple_C) == 0x000008, "Wrong alignment on ABP_SurfaceRipple_C");
static_assert(sizeof(ABP_SurfaceRipple_C) == 0x0002F8, "Wrong size on ABP_SurfaceRipple_C");
static_assert(offsetof(ABP_SurfaceRipple_C, UberGraphFrame) == 0x0002C0, "Member 'ABP_SurfaceRipple_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SurfaceRipple_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_SurfaceRipple_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SurfaceRipple_C, CurrentRainType) == 0x0002D0, "Member 'ABP_SurfaceRipple_C::CurrentRainType' has a wrong offset!");
static_assert(offsetof(ABP_SurfaceRipple_C, RainDensity) == 0x0002D4, "Member 'ABP_SurfaceRipple_C::RainDensity' has a wrong offset!");
static_assert(offsetof(ABP_SurfaceRipple_C, MID_Ripple) == 0x0002D8, "Member 'ABP_SurfaceRipple_C::MID_Ripple' has a wrong offset!");
static_assert(offsetof(ABP_SurfaceRipple_C, RT_Ripple) == 0x0002E0, "Member 'ABP_SurfaceRipple_C::RT_Ripple' has a wrong offset!");
static_assert(offsetof(ABP_SurfaceRipple_C, FollowActor) == 0x0002E8, "Member 'ABP_SurfaceRipple_C::FollowActor' has a wrong offset!");
static_assert(offsetof(ABP_SurfaceRipple_C, bSim) == 0x0002F0, "Member 'ABP_SurfaceRipple_C::bSim' has a wrong offset!");

}

