#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkiConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkiConfig.BP_SkiConfig_C
// 0x0050 (0x0088 - 0x0038)
class UBP_SkiConfig_C final : public UPrimaryDataAsset
{
public:
	float                                         初始速度;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         转向速度;                                          // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         基础加速度;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         基础减速度;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         基础目标速度;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         斜坡额外加速度;                                    // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         斜坡额外目标速度;                                  // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         忽视阶梯高度;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         跳跃转向速度系数;                                  // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         跳跃滞空缩放系数;                                  // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         跳跃高度缩放系数;                                  // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         跳跃下落最大平面速度;                              // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  期间Tag;                                           // 0x0068(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkiConfig_C">();
	}
	static class UBP_SkiConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkiConfig_C>();
	}
};
static_assert(alignof(UBP_SkiConfig_C) == 0x000008, "Wrong alignment on UBP_SkiConfig_C");
static_assert(sizeof(UBP_SkiConfig_C) == 0x000088, "Wrong size on UBP_SkiConfig_C");
static_assert(offsetof(UBP_SkiConfig_C, 初始速度) == 0x000038, "Member 'UBP_SkiConfig_C::初始速度' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 转向速度) == 0x00003C, "Member 'UBP_SkiConfig_C::转向速度' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 基础加速度) == 0x000040, "Member 'UBP_SkiConfig_C::基础加速度' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 基础减速度) == 0x000044, "Member 'UBP_SkiConfig_C::基础减速度' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 基础目标速度) == 0x000048, "Member 'UBP_SkiConfig_C::基础目标速度' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 斜坡额外加速度) == 0x00004C, "Member 'UBP_SkiConfig_C::斜坡额外加速度' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 斜坡额外目标速度) == 0x000050, "Member 'UBP_SkiConfig_C::斜坡额外目标速度' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 忽视阶梯高度) == 0x000054, "Member 'UBP_SkiConfig_C::忽视阶梯高度' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 跳跃转向速度系数) == 0x000058, "Member 'UBP_SkiConfig_C::跳跃转向速度系数' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 跳跃滞空缩放系数) == 0x00005C, "Member 'UBP_SkiConfig_C::跳跃滞空缩放系数' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 跳跃高度缩放系数) == 0x000060, "Member 'UBP_SkiConfig_C::跳跃高度缩放系数' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 跳跃下落最大平面速度) == 0x000064, "Member 'UBP_SkiConfig_C::跳跃下落最大平面速度' has a wrong offset!");
static_assert(offsetof(UBP_SkiConfig_C, 期间Tag) == 0x000068, "Member 'UBP_SkiConfig_C::期间Tag' has a wrong offset!");

}

