#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TestGameMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TestGameMode.BP_TestGameMode_C.GetServerIpAndPort
// 0x0140 (0x0140 - 0x0000)
struct BP_TestGameMode_C_GetServerIpAndPort final
{
public:
	class FString                                 ServerIp;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ApiServerPort;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LoginServerPort;                                   // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DefaultApiServerPort;                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ResultApiPort;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ResultIp;                                          // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DefaultServerIp;                                   // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ResultLoginPort;                                   // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DefaultLoginServerPort;                            // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TestSceneLoadServerIp_ReturnValue;        // 0x00B0(0x0010)(ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCommandLine_ReturnValue;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x00D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TestGameMode_C_GetServerIpAndPort) == 0x000008, "Wrong alignment on BP_TestGameMode_C_GetServerIpAndPort");
static_assert(sizeof(BP_TestGameMode_C_GetServerIpAndPort) == 0x000140, "Wrong size on BP_TestGameMode_C_GetServerIpAndPort");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, ServerIp) == 0x000000, "Member 'BP_TestGameMode_C_GetServerIpAndPort::ServerIp' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, ApiServerPort) == 0x000010, "Member 'BP_TestGameMode_C_GetServerIpAndPort::ApiServerPort' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, LoginServerPort) == 0x000020, "Member 'BP_TestGameMode_C_GetServerIpAndPort::LoginServerPort' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, DefaultApiServerPort) == 0x000030, "Member 'BP_TestGameMode_C_GetServerIpAndPort::DefaultApiServerPort' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, ResultApiPort) == 0x000040, "Member 'BP_TestGameMode_C_GetServerIpAndPort::ResultApiPort' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, ResultIp) == 0x000050, "Member 'BP_TestGameMode_C_GetServerIpAndPort::ResultIp' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, DefaultServerIp) == 0x000060, "Member 'BP_TestGameMode_C_GetServerIpAndPort::DefaultServerIp' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, ResultLoginPort) == 0x000070, "Member 'BP_TestGameMode_C_GetServerIpAndPort::ResultLoginPort' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, DefaultLoginServerPort) == 0x000080, "Member 'BP_TestGameMode_C_GetServerIpAndPort::DefaultLoginServerPort' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, ___int_Loop_Counter_Variable) == 0x000090, "Member 'BP_TestGameMode_C_GetServerIpAndPort::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, ___int_Array_Index_Variable) == 0x000098, "Member 'BP_TestGameMode_C_GetServerIpAndPort::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A0, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_TestSceneLoadServerIp_ReturnValue) == 0x0000B0, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_TestSceneLoadServerIp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_IsEmpty_ReturnValue) == 0x0000C0, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_GetCommandLine_ReturnValue) == 0x0000C8, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_GetCommandLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_ParseIntoArray_ReturnValue) == 0x0000D8, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000101, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000102, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Conv_StringToInt_ReturnValue) == 0x000104, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Conv_IntToString_ReturnValue) == 0x000108, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Add_IntInt_ReturnValue_2) == 0x000118, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000120, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_IsNumeric_ReturnValue) == 0x000130, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Array_Length_ReturnValue_1) == 0x000134, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_GetServerIpAndPort, CallFunc_Less_IntInt_ReturnValue_1) == 0x000138, "Member 'BP_TestGameMode_C_GetServerIpAndPort::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_TestGameMode.BP_TestGameMode_C.DelayStreamingSource
// 0x0001 (0x0001 - 0x0000)
struct BP_TestGameMode_C_DelayStreamingSource final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TestGameMode_C_DelayStreamingSource) == 0x000001, "Wrong alignment on BP_TestGameMode_C_DelayStreamingSource");
static_assert(sizeof(BP_TestGameMode_C_DelayStreamingSource) == 0x000001, "Wrong size on BP_TestGameMode_C_DelayStreamingSource");
static_assert(offsetof(BP_TestGameMode_C_DelayStreamingSource, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_TestGameMode_C_DelayStreamingSource::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_TestGameMode.BP_TestGameMode_C.StreamingCompleted
// 0x0018 (0x0018 - 0x0000)
struct BP_TestGameMode_C_StreamingCompleted final
{
public:
	class UWorldPartitionSubsystem*               CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TestGameMode_C_StreamingCompleted) == 0x000008, "Wrong alignment on BP_TestGameMode_C_StreamingCompleted");
static_assert(sizeof(BP_TestGameMode_C_StreamingCompleted) == 0x000018, "Wrong size on BP_TestGameMode_C_StreamingCompleted");
static_assert(offsetof(BP_TestGameMode_C_StreamingCompleted, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BP_TestGameMode_C_StreamingCompleted::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_StreamingCompleted, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_TestGameMode_C_StreamingCompleted::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_StreamingCompleted, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'BP_TestGameMode_C_StreamingCompleted::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function BP_TestGameMode.BP_TestGameMode_C.Get Player Starts
// 0x0038 (0x0038 - 0x0000)
struct BP_TestGameMode_C_Get_Player_Starts final
{
public:
	bool                                          Exist;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStart*>                   PlayerStarts_0;                                    // 0x0008(0x0010)(Parm, OutParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStart*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TestGameMode_C_Get_Player_Starts) == 0x000008, "Wrong alignment on BP_TestGameMode_C_Get_Player_Starts");
static_assert(sizeof(BP_TestGameMode_C_Get_Player_Starts) == 0x000038, "Wrong size on BP_TestGameMode_C_Get_Player_Starts");
static_assert(offsetof(BP_TestGameMode_C_Get_Player_Starts, Exist) == 0x000000, "Member 'BP_TestGameMode_C_Get_Player_Starts::Exist' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_Get_Player_Starts, PlayerStarts_0) == 0x000008, "Member 'BP_TestGameMode_C_Get_Player_Starts::PlayerStarts_0' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_Get_Player_Starts, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_TestGameMode_C_Get_Player_Starts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_Get_Player_Starts, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_TestGameMode_C_Get_Player_Starts::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_Get_Player_Starts, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'BP_TestGameMode_C_Get_Player_Starts::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_Get_Player_Starts, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'BP_TestGameMode_C_Get_Player_Starts::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_Get_Player_Starts, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_TestGameMode_C_Get_Player_Starts::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_TestGameMode.BP_TestGameMode_C.CheckStreamingHandler
// 0x01D0 (0x01D0 - 0x0000)
struct BP_TestGameMode_C_CheckStreamingHandler final
{
public:
	struct FVectorDouble                          Location;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue;          // 0x0020(0x0040)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_Conv_TransformDoubleToTransform_ReturnValue; // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_D_SpawnActorFromClass_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorldPartitionSubsystem*               CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue;    // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsStreamingCompleted_CellNum;             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsStreamingCompleted_MatchCellNum;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStreamingCompleted_ReturnValue;         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldPartitionStreamingQuerySource    K2Node_MakeStruct_WorldPartitionStreamingQuerySource; // 0x00B8(0x00A0)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWorldPartitionStreamingQuerySource> K2Node_MakeArray_Array;                       // 0x0160(0x0010)(ReferenceParm)
	class APlayerStart*                           CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorldPartitionStreamingSourceComponent* CallFunc_AddComponentByClass_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetComponentLocation_ReturnValue;    // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_AddComponentByClass_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_Player_Starts_Exist;                  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStart*>                   CallFunc_Get_Player_Starts_PlayerStarts;           // 0x01B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TestGameMode_C_CheckStreamingHandler) == 0x000010, "Wrong alignment on BP_TestGameMode_C_CheckStreamingHandler");
static_assert(sizeof(BP_TestGameMode_C_CheckStreamingHandler) == 0x0001D0, "Wrong size on BP_TestGameMode_C_CheckStreamingHandler");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, Location) == 0x000000, "Member 'BP_TestGameMode_C_CheckStreamingHandler::Location' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_MakeTransformDouble_ReturnValue) == 0x000020, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_MakeTransformDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_Conv_TransformDoubleToTransform_ReturnValue) == 0x000060, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_Conv_TransformDoubleToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_D_SpawnActorFromClass_ReturnValue) == 0x000090, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_D_SpawnActorFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000098, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_Conv_VectorDoubleToVector_ReturnValue) == 0x0000A0, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_Conv_VectorDoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_IsStreamingCompleted_CellNum) == 0x0000AC, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_IsStreamingCompleted_CellNum' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_IsStreamingCompleted_MatchCellNum) == 0x0000B0, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_IsStreamingCompleted_MatchCellNum' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_IsStreamingCompleted_ReturnValue) == 0x0000B4, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_IsStreamingCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, K2Node_MakeStruct_WorldPartitionStreamingQuerySource) == 0x0000B8, "Member 'BP_TestGameMode_C_CheckStreamingHandler::K2Node_MakeStruct_WorldPartitionStreamingQuerySource' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_Not_PreBool_ReturnValue) == 0x000158, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, K2Node_MakeArray_Array) == 0x000160, "Member 'BP_TestGameMode_C_CheckStreamingHandler::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_Array_Get_Item) == 0x000170, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_AddComponentByClass_ReturnValue) == 0x000178, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000180, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_D_K2_GetComponentLocation_ReturnValue) == 0x000188, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_D_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_AddComponentByClass_ReturnValue_1) == 0x0001A0, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_AddComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_IsValid_ReturnValue) == 0x0001A8, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_Get_Player_Starts_Exist) == 0x0001A9, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_Get_Player_Starts_Exist' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_Get_Player_Starts_PlayerStarts) == 0x0001B0, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_Get_Player_Starts_PlayerStarts' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_CheckStreamingHandler, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C0, "Member 'BP_TestGameMode_C_CheckStreamingHandler::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BP_TestGameMode.BP_TestGameMode_C.Check
// 0x0018 (0x0018 - 0x0000)
struct BP_TestGameMode_C_Check final
{
public:
	class UWorldPartitionSubsystem*               CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TestGameMode_C_Check) == 0x000008, "Wrong alignment on BP_TestGameMode_C_Check");
static_assert(sizeof(BP_TestGameMode_C_Check) == 0x000018, "Wrong size on BP_TestGameMode_C_Check");
static_assert(offsetof(BP_TestGameMode_C_Check, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BP_TestGameMode_C_Check::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_Check, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_TestGameMode_C_Check::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_Check, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'BP_TestGameMode_C_Check::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function BP_TestGameMode.BP_TestGameMode_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TestGameMode_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TestGameMode_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TestGameMode_C_ReceiveTick");
static_assert(sizeof(BP_TestGameMode_C_ReceiveTick) == 0x000004, "Wrong size on BP_TestGameMode_C_ReceiveTick");
static_assert(offsetof(BP_TestGameMode_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TestGameMode_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TestGameMode.BP_TestGameMode_C.LoginServerStatusResponse
// 0x0018 (0x0018 - 0x0000)
struct BP_TestGameMode_C_LoginServerStatusResponse final
{
public:
	bool                                          bConnectedSuccessfully;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HttpResponseCode;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Data;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TestGameMode_C_LoginServerStatusResponse) == 0x000008, "Wrong alignment on BP_TestGameMode_C_LoginServerStatusResponse");
static_assert(sizeof(BP_TestGameMode_C_LoginServerStatusResponse) == 0x000018, "Wrong size on BP_TestGameMode_C_LoginServerStatusResponse");
static_assert(offsetof(BP_TestGameMode_C_LoginServerStatusResponse, bConnectedSuccessfully) == 0x000000, "Member 'BP_TestGameMode_C_LoginServerStatusResponse::bConnectedSuccessfully' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_LoginServerStatusResponse, HttpResponseCode) == 0x000004, "Member 'BP_TestGameMode_C_LoginServerStatusResponse::HttpResponseCode' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_LoginServerStatusResponse, Data) == 0x000008, "Member 'BP_TestGameMode_C_LoginServerStatusResponse::Data' has a wrong offset!");

// Function BP_TestGameMode.BP_TestGameMode_C.ApiServereStatusResponse
// 0x0018 (0x0018 - 0x0000)
struct BP_TestGameMode_C_ApiServereStatusResponse final
{
public:
	bool                                          bConnectedSuccessfully;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HttpResponseCode;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Data;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TestGameMode_C_ApiServereStatusResponse) == 0x000008, "Wrong alignment on BP_TestGameMode_C_ApiServereStatusResponse");
static_assert(sizeof(BP_TestGameMode_C_ApiServereStatusResponse) == 0x000018, "Wrong size on BP_TestGameMode_C_ApiServereStatusResponse");
static_assert(offsetof(BP_TestGameMode_C_ApiServereStatusResponse, bConnectedSuccessfully) == 0x000000, "Member 'BP_TestGameMode_C_ApiServereStatusResponse::bConnectedSuccessfully' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_ApiServereStatusResponse, HttpResponseCode) == 0x000004, "Member 'BP_TestGameMode_C_ApiServereStatusResponse::HttpResponseCode' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_ApiServereStatusResponse, Data) == 0x000008, "Member 'BP_TestGameMode_C_ApiServereStatusResponse::Data' has a wrong offset!");

// Function BP_TestGameMode.BP_TestGameMode_C.ExecuteUbergraph_BP_TestGameMode
// 0x0410 (0x0410 - 0x0000)
struct BP_TestGameMode_C_ExecuteUbergraph_BP_TestGameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_D_GetCameraLocation_Success;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_GetCameraLocation_Location;             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bConnectedSuccessfully, int32 HttpResponseCode, const class FString& Data)> K2Node_CreateDelegate_OutputDelegate; // 0x0020(0x0028)(ZeroConstructor)
	TDelegate<void(bool bConnectedSuccessfully, int32 HttpResponseCode, const class FString& Data)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0048(0x0028)(ZeroConstructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MainGameInstance_C*                 K2Node_DynamicCast_AsBP_Main_Game_Instance;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MainGameInstance_C*                 K2Node_DynamicCast_AsBP_Main_Game_Instance_1;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TestSceneLoadNetMode_ReturnValue;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATsEntityBase_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x00A0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class APlayerStart*>                   CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x00C8(0x0010)(ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MainGameInstance_C*                 K2Node_DynamicCast_AsBP_Main_Game_Instance_2;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_D_K2_SetActorLocation_SweepHitResult;     // 0x0104(0x0094)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_D_K2_SetActorLocation_ReturnValue;        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameInited_ReturnValue;                 // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameInited_ReturnValue_1;               // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetServerIpAndPort_ServerIp;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetServerIpAndPort_ApiServerPort;         // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetServerIpAndPort_LoginServerPort;       // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            CallFunc_GetDefaultHeader_ReturnValue;             // 0x01D0(0x0050)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bConnectedSuccessfully_1;       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_HttpResponseCode_1;             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Data_1;                         // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsEntityBase_C*                        CallFunc_Array_Get_Item;                           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerStart*                           CallFunc_Array_Get_Item_1;                         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetComponentLocation_ReturnValue;    // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue;    // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetServerIpAndPort_ServerIp_1;            // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetServerIpAndPort_ApiServerPort_1;       // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetServerIpAndPort_LoginServerPort_1;     // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            CallFunc_GetDefaultHeader_ReturnValue_1;           // 0x0318(0x0050)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bConnectedSuccessfully;         // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_HttpResponseCode;               // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Data;                           // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x03FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_2;        // 0x03FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FE[0x2];                                      // 0x03FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TestGameMode_C_ExecuteUbergraph_BP_TestGameMode) == 0x000008, "Wrong alignment on BP_TestGameMode_C_ExecuteUbergraph_BP_TestGameMode");
static_assert(sizeof(BP_TestGameMode_C_ExecuteUbergraph_BP_TestGameMode) == 0x000410, "Wrong size on BP_TestGameMode_C_ExecuteUbergraph_BP_TestGameMode");
static_assert(offsetof(BP_TestGameMode_C_ExecuteUbergraph_BP_TestGameMode, EntryPoint) == 0x000000, "Member 'BP_TestGameMode_C_ExecuteUbergraph_BP_TestGameMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TestGameMode_C_ExecuteUbergraph_BP_TestGameMode, CallFunc_D_GetCameraLocation_Success) == 0x000004, "Member 'BP_TestGameMode_C_ExecuteUbergraph_BP_TestGameMode::CallFunc_D_GetCameraLocation_Success' has a wrong offset!");
