#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VolumetricSphereLightSuperFar

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VolumetricSphereLightSuperFar.BP_VolumetricSphereLightSuperFar_C
// 0x00B8 (0x0378 - 0x02C0)
class ABP_VolumetricSphereLightSuperFar_C final : public AKuroEditorTickActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SphereLightStaticMesh;                             // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SphereLightMat;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReverseCulling;                                  // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsWholeDay;                                        // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OutDistanceFade;                                   // 0x02F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ApplyFog;                                          // 0x02F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsTickIntenisty;                                   // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShoulderRenderInLowQuality;                        // 0x02F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F6[0x2];                                      // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NearDestroyDistance;                               // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogInt;                                            // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         FogPower;                                          // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkyLightInt;                                       // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkyLightOffset;                                    // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InsideColor;                                       // 0x030C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OutSideColor;                                      // 0x031C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SphereRadius;                                      // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightStart;                                        // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NearFadeStart;                                     // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FullIntLength;                                     // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarFadeLength;                                     // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SphereLightMatWithOutDF;                           // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SphereLightMatWithOutFog;                          // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SphereLightMatWithOutDFWithOutFog;                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SphereLightMat_LR;                                 // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SphereLightMatWithOutDF_LR;                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SphereLightMatWithOutFog_LR;                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SphereLightMatWithOutDFWithOutFog_LR;              // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateFogInt();
	void UpdateVolumetricSphereLight();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void EditorTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_VolumetricSphereLightSuperFar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VolumetricSphereLightSuperFar_C">();
	}
	static class ABP_VolumetricSphereLightSuperFar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VolumetricSphereLightSuperFar_C>();
	}
};
static_assert(alignof(ABP_VolumetricSphereLightSuperFar_C) == 0x000008, "Wrong alignment on ABP_VolumetricSphereLightSuperFar_C");
static_assert(sizeof(ABP_VolumetricSphereLightSuperFar_C) == 0x000378, "Wrong size on ABP_VolumetricSphereLightSuperFar_C");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, UberGraphFrame) == 0x0002C0, "Member 'ABP_VolumetricSphereLightSuperFar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, StaticMeshComponent) == 0x0002C8, "Member 'ABP_VolumetricSphereLightSuperFar_C::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_VolumetricSphereLightSuperFar_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereLightStaticMesh) == 0x0002D8, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereLightStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, MaterialInstanceDynamic) == 0x0002E0, "Member 'ABP_VolumetricSphereLightSuperFar_C::MaterialInstanceDynamic' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereLightMat) == 0x0002E8, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereLightMat' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, IsReverseCulling) == 0x0002F0, "Member 'ABP_VolumetricSphereLightSuperFar_C::IsReverseCulling' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, IsWholeDay) == 0x0002F1, "Member 'ABP_VolumetricSphereLightSuperFar_C::IsWholeDay' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, OutDistanceFade) == 0x0002F2, "Member 'ABP_VolumetricSphereLightSuperFar_C::OutDistanceFade' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, ApplyFog) == 0x0002F3, "Member 'ABP_VolumetricSphereLightSuperFar_C::ApplyFog' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, IsTickIntenisty) == 0x0002F4, "Member 'ABP_VolumetricSphereLightSuperFar_C::IsTickIntenisty' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, ShoulderRenderInLowQuality) == 0x0002F5, "Member 'ABP_VolumetricSphereLightSuperFar_C::ShoulderRenderInLowQuality' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, NearDestroyDistance) == 0x0002F8, "Member 'ABP_VolumetricSphereLightSuperFar_C::NearDestroyDistance' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, FogInt) == 0x0002FC, "Member 'ABP_VolumetricSphereLightSuperFar_C::FogInt' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, FogPower) == 0x000300, "Member 'ABP_VolumetricSphereLightSuperFar_C::FogPower' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SkyLightInt) == 0x000304, "Member 'ABP_VolumetricSphereLightSuperFar_C::SkyLightInt' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SkyLightOffset) == 0x000308, "Member 'ABP_VolumetricSphereLightSuperFar_C::SkyLightOffset' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, InsideColor) == 0x00030C, "Member 'ABP_VolumetricSphereLightSuperFar_C::InsideColor' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, OutSideColor) == 0x00031C, "Member 'ABP_VolumetricSphereLightSuperFar_C::OutSideColor' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereRadius) == 0x00032C, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereRadius' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, LightStart) == 0x000330, "Member 'ABP_VolumetricSphereLightSuperFar_C::LightStart' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, NearFadeStart) == 0x000334, "Member 'ABP_VolumetricSphereLightSuperFar_C::NearFadeStart' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, FullIntLength) == 0x000338, "Member 'ABP_VolumetricSphereLightSuperFar_C::FullIntLength' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, FarFadeLength) == 0x00033C, "Member 'ABP_VolumetricSphereLightSuperFar_C::FarFadeLength' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereLightMatWithOutDF) == 0x000340, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereLightMatWithOutDF' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereLightMatWithOutFog) == 0x000348, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereLightMatWithOutFog' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereLightMatWithOutDFWithOutFog) == 0x000350, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereLightMatWithOutDFWithOutFog' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereLightMat_LR) == 0x000358, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereLightMat_LR' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereLightMatWithOutDF_LR) == 0x000360, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereLightMatWithOutDF_LR' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereLightMatWithOutFog_LR) == 0x000368, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereLightMatWithOutFog_LR' has a wrong offset!");
static_assert(offsetof(ABP_VolumetricSphereLightSuperFar_C, SphereLightMatWithOutDFWithOutFog_LR) == 0x000370, "Member 'ABP_VolumetricSphereLightSuperFar_C::SphereLightMatWithOutDFWithOutFog_LR' has a wrong offset!");

}

