#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleConfig

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VehicleConfig.BP_VehicleConfig_C
// 0x0058 (0x0090 - 0x0038)
class UBP_VehicleConfig_C final : public UPrimaryDataAsset
{
public:
	float                                         M_______;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ________;                                          // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _________0;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F62[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           _____;                                             // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_l____c_p;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_l____c_p_0;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_l____c_p_1;                                      // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Four_______;                                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Four__8____;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______;                                            // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____i__;                                           // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Star___i__;                                        // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __________i__;                                     // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __l___;                                            // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_i___p;                                           // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_Ybi__;                                           // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L___;                                              // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______p;                                           // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _l____p;                                           // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VehicleConfig_C">();
	}
	static class UBP_VehicleConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VehicleConfig_C>();
	}
};
static_assert(alignof(UBP_VehicleConfig_C) == 0x000008, "Wrong alignment on UBP_VehicleConfig_C");
static_assert(sizeof(UBP_VehicleConfig_C) == 0x000090, "Wrong size on UBP_VehicleConfig_C");
static_assert(offsetof(UBP_VehicleConfig_C, M_______) == 0x000038, "Member 'UBP_VehicleConfig_C::M_______' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, ________) == 0x00003C, "Member 'UBP_VehicleConfig_C::________' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, _________0) == 0x000040, "Member 'UBP_VehicleConfig_C::_________0' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, _____) == 0x000048, "Member 'UBP_VehicleConfig_C::_____' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, L_l____c_p) == 0x000050, "Member 'UBP_VehicleConfig_C::L_l____c_p' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, L_l____c_p_0) == 0x000054, "Member 'UBP_VehicleConfig_C::L_l____c_p_0' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, L_l____c_p_1) == 0x000058, "Member 'UBP_VehicleConfig_C::L_l____c_p_1' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, Four_______) == 0x00005C, "Member 'UBP_VehicleConfig_C::Four_______' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, Four__8____) == 0x000060, "Member 'UBP_VehicleConfig_C::Four__8____' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, ______) == 0x000064, "Member 'UBP_VehicleConfig_C::______' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, ____i__) == 0x000068, "Member 'UBP_VehicleConfig_C::____i__' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, Star___i__) == 0x00006C, "Member 'UBP_VehicleConfig_C::Star___i__' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, __________i__) == 0x000070, "Member 'UBP_VehicleConfig_C::__________i__' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, __l___) == 0x000074, "Member 'UBP_VehicleConfig_C::__l___' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, L_i___p) == 0x000078, "Member 'UBP_VehicleConfig_C::L_i___p' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, L_Ybi__) == 0x00007C, "Member 'UBP_VehicleConfig_C::L_Ybi__' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, L___) == 0x000080, "Member 'UBP_VehicleConfig_C::L___' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, ______p) == 0x000084, "Member 'UBP_VehicleConfig_C::______p' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, _l____p) == 0x000088, "Member 'UBP_VehicleConfig_C::_l____p' has a wrong offset!");

}

