#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleConfig

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VehicleConfig.BP_VehicleConfig_C
// 0x00A0 (0x00D8 - 0x0038)
class UBP_VehicleConfig_C final : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  载具出生Tag;                                       // 0x0038(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  载具乘坐期间Tag;                                   // 0x0058(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  角色乘坐期间Tag;                                   // 0x0078(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         弹射时间;                                          // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         弹射高度;                                          // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         打开滑翔伞延迟时间;                                // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveFloat>             弹射时间路径曲线;                                  // 0x00A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VehicleConfig_C">();
	}
	static class UBP_VehicleConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VehicleConfig_C>();
	}
};
static_assert(alignof(UBP_VehicleConfig_C) == 0x000008, "Wrong alignment on UBP_VehicleConfig_C");
static_assert(sizeof(UBP_VehicleConfig_C) == 0x0000D8, "Wrong size on UBP_VehicleConfig_C");
static_assert(offsetof(UBP_VehicleConfig_C, 载具出生Tag) == 0x000038, "Member 'UBP_VehicleConfig_C::载具出生Tag' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 载具乘坐期间Tag) == 0x000058, "Member 'UBP_VehicleConfig_C::载具乘坐期间Tag' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 角色乘坐期间Tag) == 0x000078, "Member 'UBP_VehicleConfig_C::角色乘坐期间Tag' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 弹射时间) == 0x000098, "Member 'UBP_VehicleConfig_C::弹射时间' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 弹射高度) == 0x00009C, "Member 'UBP_VehicleConfig_C::弹射高度' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 打开滑翔伞延迟时间) == 0x0000A0, "Member 'UBP_VehicleConfig_C::打开滑翔伞延迟时间' has a wrong offset!");
static_assert(offsetof(UBP_VehicleConfig_C, 弹射时间路径曲线) == 0x0000A8, "Member 'UBP_VehicleConfig_C::弹射时间路径曲线' has a wrong offset!");

}

