#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletBlueprintFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SReBulletDataMain_structs.hpp"


namespace SDK::Params
{

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.GetBulletActorById
// 0x0018 (0x0018 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_GetBulletActorById final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_GetBulletActorById) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_GetBulletActorById");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_GetBulletActorById) == 0x000018, "Wrong size on BulletBlueprintFunctionLibrary_C_GetBulletActorById");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletActorById, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletActorById::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletActorById, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletActorById::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletActorById, ReturnValue) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletActorById::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.DestroyBullet
// 0x0018 (0x0018 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_DestroyBullet final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          isSummonChildBullet;                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_DestroyBullet) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_DestroyBullet");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_DestroyBullet) == 0x000018, "Wrong size on BulletBlueprintFunctionLibrary_C_DestroyBullet");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DestroyBullet, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_DestroyBullet::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DestroyBullet, isSummonChildBullet) == 0x000004, "Member 'BulletBlueprintFunctionLibrary_C_DestroyBullet::isSummonChildBullet' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DestroyBullet, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_DestroyBullet::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DestroyBullet, ReturnValue) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_DestroyBullet::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.FrozenBulletTimeByBulletName
// 0x0028 (0x0028 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName final
{
public:
	class ATsBaseCharacter_C*                     character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 bulletDataName;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         time;                                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName) == 0x000028, "Wrong size on BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName, character) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName::character' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName, bulletDataName) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName::bulletDataName' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName, time) == 0x000018, "Member 'BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName::time' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName, __WorldContext) == 0x000020, "Member 'BulletBlueprintFunctionLibrary_C_FrozenBulletTimeByBulletName::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.SetEntityIdByCustomKey
// 0x0028 (0x0028 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey final
{
public:
	int32                                         attackerId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 customKey;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         targetId;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey) == 0x000028, "Wrong size on BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey, attackerId) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey::attackerId' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey, customKey) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey::customKey' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey, targetId) == 0x000018, "Member 'BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey::targetId' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey, __WorldContext) == 0x000020, "Member 'BulletBlueprintFunctionLibrary_C_SetEntityIdByCustomKey::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.GetAllBullet
// 0x0018 (0x0018 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_GetAllBullet final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_GetAllBullet) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_GetAllBullet");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_GetAllBullet) == 0x000018, "Wrong size on BulletBlueprintFunctionLibrary_C_GetAllBullet");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetAllBullet, __WorldContext) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_GetAllBullet::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetAllBullet, ReturnValue) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_GetAllBullet::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.DebugShowBulletTrace
// 0x0010 (0x0010 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace final
{
public:
	bool                                          isShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         entityId1;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace) == 0x000010, "Wrong size on BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace, isShow) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace::isShow' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace, entityId1) == 0x000004, "Member 'BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace::entityId1' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_DebugShowBulletTrace::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.GetCharacterLaunchedBulletIds
// 0x0020 (0x0020 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds final
{
public:
	int32                                         characterId;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds) == 0x000020, "Wrong size on BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds, characterId) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds::characterId' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds, ReturnValue) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_GetCharacterLaunchedBulletIds::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.GetBulletTransform
// 0x0050 (0x0050 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_GetBulletTransform final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_GetBulletTransform) == 0x000010, "Wrong alignment on BulletBlueprintFunctionLibrary_C_GetBulletTransform");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_GetBulletTransform) == 0x000050, "Wrong size on BulletBlueprintFunctionLibrary_C_GetBulletTransform");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletTransform, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletTransform::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletTransform, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletTransform::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletTransform, ReturnValue) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletTransform::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.GetBulletAttacker
// 0x0018 (0x0018 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_GetBulletAttacker final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_GetBulletAttacker) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_GetBulletAttacker");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_GetBulletAttacker) == 0x000018, "Wrong size on BulletBlueprintFunctionLibrary_C_GetBulletAttacker");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletAttacker, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletAttacker::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletAttacker, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletAttacker::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletAttacker, ReturnValue) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletAttacker::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.GetBulletCollision
// 0x0018 (0x0018 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_GetBulletCollision final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_GetBulletCollision) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_GetBulletCollision");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_GetBulletCollision) == 0x000018, "Wrong size on BulletBlueprintFunctionLibrary_C_GetBulletCollision");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletCollision, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletCollision::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletCollision, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletCollision::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletCollision, ReturnValue) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletCollision::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.GetBulletName
// 0x0020 (0x0020 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_GetBulletName final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_GetBulletName) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_GetBulletName");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_GetBulletName) == 0x000020, "Wrong size on BulletBlueprintFunctionLibrary_C_GetBulletName");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletName, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletName::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletName, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletName::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetBulletName, ReturnValue) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_GetBulletName::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.SetBulletStopHitTrue
// 0x0010 (0x0010 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_SetBulletStopHitTrue final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_SetBulletStopHitTrue) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_SetBulletStopHitTrue");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_SetBulletStopHitTrue) == 0x000010, "Wrong size on BulletBlueprintFunctionLibrary_C_SetBulletStopHitTrue");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletStopHitTrue, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletStopHitTrue::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletStopHitTrue, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletStopHitTrue::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.SetBulletTarget
// 0x0018 (0x0018 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_SetBulletTarget final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_SetBulletTarget) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_SetBulletTarget");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_SetBulletTarget) == 0x000018, "Wrong size on BulletBlueprintFunctionLibrary_C_SetBulletTarget");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletTarget, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletTarget::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletTarget, character) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletTarget::character' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletTarget, __WorldContext) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletTarget::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.SetBulletSummon
// 0x0010 (0x0010 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_SetBulletSummon final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_SetBulletSummon) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_SetBulletSummon");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_SetBulletSummon) == 0x000010, "Wrong size on BulletBlueprintFunctionLibrary_C_SetBulletSummon");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletSummon, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletSummon::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletSummon, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletSummon::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.SetBulletTransform
// 0x0060 (0x0060 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_SetBulletTransform final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       newTransform;                                      // 0x0010(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_SetBulletTransform) == 0x000010, "Wrong alignment on BulletBlueprintFunctionLibrary_C_SetBulletTransform");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_SetBulletTransform) == 0x000060, "Wrong size on BulletBlueprintFunctionLibrary_C_SetBulletTransform");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletTransform, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletTransform::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletTransform, newTransform) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletTransform::newTransform' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBulletTransform, __WorldContext) == 0x000050, "Member 'BulletBlueprintFunctionLibrary_C_SetBulletTransform::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.SetBeginSpeed
// 0x0010 (0x0010 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_SetBeginSpeed final
{
public:
	int32                                         id;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         newSpeed;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_SetBeginSpeed) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_SetBeginSpeed");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_SetBeginSpeed) == 0x000010, "Wrong size on BulletBlueprintFunctionLibrary_C_SetBeginSpeed");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBeginSpeed, id) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_SetBeginSpeed::id' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBeginSpeed, newSpeed) == 0x000004, "Member 'BulletBlueprintFunctionLibrary_C_SetBeginSpeed::newSpeed' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_SetBeginSpeed, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_SetBeginSpeed::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.DebugShowBulletCollision
// 0x0010 (0x0010 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision final
{
public:
	bool                                          isShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         entityId;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision) == 0x000010, "Wrong size on BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision, isShow) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision::isShow' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision, entityId) == 0x000004, "Member 'BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision::entityId' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_DebugShowBulletCollision::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.GetIsShowBulletTrace
// 0x0018 (0x0018 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace) == 0x000018, "Wrong size on BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace, entityId) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace::entityId' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace, ReturnValue) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_GetIsShowBulletTrace::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.GetIsShowBulletCollision
// 0x0018 (0x0018 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision) == 0x000018, "Wrong size on BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision, entityId) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision::entityId' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision, __WorldContext) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision, ReturnValue) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_GetIsShowBulletCollision::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.CalcPipe
// 0x0060 (0x0060 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_CalcPipe final
{
public:
	struct FVector                                centerPoint;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                forward;                                           // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                up;                                                // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         outsideRadius;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         insideRadius;                                      // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         height;                                            // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         sectionNum;                                        // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        outVerticesRef;                                    // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 outTrianglesRef;                                   // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_CalcPipe) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_CalcPipe");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_CalcPipe) == 0x000060, "Wrong size on BulletBlueprintFunctionLibrary_C_CalcPipe");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, centerPoint) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::centerPoint' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, forward) == 0x00000C, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::forward' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, up) == 0x000018, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::up' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, outsideRadius) == 0x000024, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::outsideRadius' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, insideRadius) == 0x000028, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::insideRadius' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, height) == 0x00002C, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::height' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, sectionNum) == 0x000030, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::sectionNum' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, outVerticesRef) == 0x000038, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::outVerticesRef' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, outTrianglesRef) == 0x000048, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::outTrianglesRef' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcPipe, __WorldContext) == 0x000058, "Member 'BulletBlueprintFunctionLibrary_C_CalcPipe::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.CalcSector
// 0x0060 (0x0060 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_CalcSector final
{
public:
	struct FVector                                centerPoint;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                forward;                                           // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                up;                                                // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         inAngle;                                           // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         radius;                                            // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         height;                                            // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         sectionNum;                                        // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        verticesArrayRef;                                  // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 trianglesArrayRef;                                 // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_CalcSector) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_CalcSector");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_CalcSector) == 0x000060, "Wrong size on BulletBlueprintFunctionLibrary_C_CalcSector");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, centerPoint) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::centerPoint' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, forward) == 0x00000C, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::forward' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, up) == 0x000018, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::up' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, inAngle) == 0x000024, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::inAngle' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, radius) == 0x000028, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::radius' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, height) == 0x00002C, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::height' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, sectionNum) == 0x000030, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::sectionNum' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, verticesArrayRef) == 0x000038, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::verticesArrayRef' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, trianglesArrayRef) == 0x000048, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::trianglesArrayRef' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcSector, __WorldContext) == 0x000058, "Member 'BulletBlueprintFunctionLibrary_C_CalcSector::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.CalcBulletInitLocation
// 0x0800 (0x0800 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation final
{
public:
	struct FSReBulletDataMain                     dataMain;                                          // 0x0000(0x0790)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class AActor*                                 attacker;                                          // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_798[0x8];                                      // 0x0798(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       target;                                            // 0x07A0(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x07E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          ReturnValue;                                       // 0x07E8(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation) == 0x000010, "Wrong alignment on BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation) == 0x000800, "Wrong size on BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation, dataMain) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation::dataMain' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation, attacker) == 0x000790, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation::attacker' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation, target) == 0x0007A0, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation::target' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation, __WorldContext) == 0x0007E0, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation, ReturnValue) == 0x0007E8, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitLocation::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.AttachToBone
// 0x07A8 (0x07A8 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_AttachToBone final
{
public:
	class USkeletalMeshComponent*                 meshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 bulletActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSReBulletDataMain                     dataMain;                                          // 0x0010(0x0790)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x07A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_AttachToBone) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_AttachToBone");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_AttachToBone) == 0x0007A8, "Wrong size on BulletBlueprintFunctionLibrary_C_AttachToBone");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_AttachToBone, meshComp) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_AttachToBone::meshComp' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_AttachToBone, bulletActor) == 0x000008, "Member 'BulletBlueprintFunctionLibrary_C_AttachToBone::bulletActor' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_AttachToBone, dataMain) == 0x000010, "Member 'BulletBlueprintFunctionLibrary_C_AttachToBone::dataMain' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_AttachToBone, __WorldContext) == 0x0007A0, "Member 'BulletBlueprintFunctionLibrary_C_AttachToBone::__WorldContext' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.CalcBulletInitRotator
// 0x0800 (0x0800 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator final
{
public:
	struct FSReBulletDataMain                     dataMain;                                          // 0x0000(0x0790)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class AActor*                                 bulletActor;                                       // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 attacker;                                          // 0x0798(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       target;                                            // 0x07A0(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AActor*                                 parentBulletActor;                                 // 0x07E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x07E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x07F0(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator) == 0x000010, "Wrong alignment on BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator) == 0x000800, "Wrong size on BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator, dataMain) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator::dataMain' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator, bulletActor) == 0x000790, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator::bulletActor' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator, attacker) == 0x000798, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator::attacker' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator, target) == 0x0007A0, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator::target' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator, parentBulletActor) == 0x0007E0, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator::parentBulletActor' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator, __WorldContext) == 0x0007E8, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator, ReturnValue) == 0x0007F0, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletInitRotator::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.CalcBulletRotator
// 0x07D8 (0x07D8 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_CalcBulletRotator final
{
public:
	struct FSReBulletDataMain                     dataMain;                                          // 0x0000(0x0790)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class AActor*                                 bulletActor;                                       // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 attacker;                                          // 0x0798(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          target;                                            // 0x07A0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         delta;                                             // 0x07B8(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x07C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x07C8(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_CalcBulletRotator) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_CalcBulletRotator");
static_assert(sizeof(BulletBlueprintFunctionLibrary_C_CalcBulletRotator) == 0x0007D8, "Wrong size on BulletBlueprintFunctionLibrary_C_CalcBulletRotator");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletRotator, dataMain) == 0x000000, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletRotator::dataMain' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletRotator, bulletActor) == 0x000790, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletRotator::bulletActor' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletRotator, attacker) == 0x000798, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletRotator::attacker' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletRotator, target) == 0x0007A0, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletRotator::target' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletRotator, delta) == 0x0007B8, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletRotator::delta' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletRotator, __WorldContext) == 0x0007C0, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletRotator::__WorldContext' has a wrong offset!");
static_assert(offsetof(BulletBlueprintFunctionLibrary_C_CalcBulletRotator, ReturnValue) == 0x0007C8, "Member 'BulletBlueprintFunctionLibrary_C_CalcBulletRotator::ReturnValue' has a wrong offset!");

// Function BulletBlueprintFunctionLibrary.BulletBlueprintFunctionLibrary_C.CalcBulletLocation
// 0x07C0 (0x07C0 - 0x0000)
struct BulletBlueprintFunctionLibrary_C_CalcBulletLocation final
{
public:
	struct FSReBulletDataMain                     dataMain;                                          // 0x0000(0x0790)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class AActor*                                 bulletActor;                                       // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         delta;                                             // 0x0798(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79C[0x4];                                      // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x07A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          ReturnValue;                                       // 0x07A8(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BulletBlueprintFunctionLibrary_C_CalcBulletLocation) == 0x000008, "Wrong alignment on BulletBlueprintFunctionLibrary_C_CalcBulletLocation");
