#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EffectModelStaticMesh

#include "Basic.hpp"

#include "KuroCurve_structs.hpp"
#include "KuroGameplay_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass EffectModelStaticMesh.EffectModelStaticMesh_C
// 0x05D8 (0x0638 - 0x0060)
class UEffectModelStaticMesh_C final : public UEffectModelBase
{
public:
	struct FKuroCurveVector                       Location;                                          // 0x0060(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FKuroCurveVector                       Rotation;                                          // 0x0208(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FKuroCurveVector                       Scale;                                             // 0x03B0(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FKuroCurveLinearColor> MaterialColorParameters;                           // 0x0558(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FKuroCurveFloat>     MaterialFloatParameters;                           // 0x05A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ReceiveDecal;                                      // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableCollision;                                   // 0x05F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FA[0x6];                                      // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMeshRef;                                     // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialOverrideRef;                               // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseMultipleMaterialSlots;                          // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             MaterialOverrideArrayRef;                          // 0x0618(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CastShadow;                                        // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TranslucencySortPriority;                          // 0x062C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          EnableScreenSizeCullRatioOverride;                 // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScreenSizeCullRatio;                               // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EffectModelStaticMesh_C">();
	}
	static class UEffectModelStaticMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEffectModelStaticMesh_C>();
	}
};
static_assert(alignof(UEffectModelStaticMesh_C) == 0x000008, "Wrong alignment on UEffectModelStaticMesh_C");
static_assert(sizeof(UEffectModelStaticMesh_C) == 0x000638, "Wrong size on UEffectModelStaticMesh_C");
static_assert(offsetof(UEffectModelStaticMesh_C, Location) == 0x000060, "Member 'UEffectModelStaticMesh_C::Location' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, Rotation) == 0x000208, "Member 'UEffectModelStaticMesh_C::Rotation' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, Scale) == 0x0003B0, "Member 'UEffectModelStaticMesh_C::Scale' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, MaterialColorParameters) == 0x000558, "Member 'UEffectModelStaticMesh_C::MaterialColorParameters' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, MaterialFloatParameters) == 0x0005A8, "Member 'UEffectModelStaticMesh_C::MaterialFloatParameters' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, ReceiveDecal) == 0x0005F8, "Member 'UEffectModelStaticMesh_C::ReceiveDecal' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, EnableCollision) == 0x0005F9, "Member 'UEffectModelStaticMesh_C::EnableCollision' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, StaticMeshRef) == 0x000600, "Member 'UEffectModelStaticMesh_C::StaticMeshRef' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, MaterialOverrideRef) == 0x000608, "Member 'UEffectModelStaticMesh_C::MaterialOverrideRef' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, UseMultipleMaterialSlots) == 0x000610, "Member 'UEffectModelStaticMesh_C::UseMultipleMaterialSlots' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, MaterialOverrideArrayRef) == 0x000618, "Member 'UEffectModelStaticMesh_C::MaterialOverrideArrayRef' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, CastShadow) == 0x000628, "Member 'UEffectModelStaticMesh_C::CastShadow' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, TranslucencySortPriority) == 0x00062C, "Member 'UEffectModelStaticMesh_C::TranslucencySortPriority' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, EnableScreenSizeCullRatioOverride) == 0x000630, "Member 'UEffectModelStaticMesh_C::EnableScreenSizeCullRatioOverride' has a wrong offset!");
static_assert(offsetof(UEffectModelStaticMesh_C, ScreenSizeCullRatio) == 0x000634, "Member 'UEffectModelStaticMesh_C::ScreenSizeCullRatio' has a wrong offset!");

}

