#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EffectBlueprintFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "EEffectStatisticsSortType_structs.hpp"


namespace SDK::Params
{

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.RecycleEffect
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_RecycleEffect final
{
public:
	class UEffectViewComponent_C*                 view;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_RecycleEffect) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_RecycleEffect");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_RecycleEffect) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_RecycleEffect");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_RecycleEffect, view) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_RecycleEffect::view' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_RecycleEffect, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_RecycleEffect::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetEffectStatisticsCurrentCount
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetEffectStatisticsCurrentCount final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsCurrentCount) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsCurrentCount");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsCurrentCount) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsCurrentCount");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsCurrentCount, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsCurrentCount::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsCurrentCount, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsCurrentCount::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetEffectStatisticsTickCount
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetEffectStatisticsTickCount final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsTickCount) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsTickCount");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsTickCount) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsTickCount");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsTickCount, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsTickCount::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsTickCount, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsTickCount::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetEffectStatisticsRegisteredInterval
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetEffectStatisticsRegisteredInterval final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsRegisteredInterval) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsRegisteredInterval");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsRegisteredInterval) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsRegisteredInterval");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsRegisteredInterval, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsRegisteredInterval::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsRegisteredInterval, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsRegisteredInterval::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetEffectStatisticsReleasedInterval
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetEffectStatisticsReleasedInterval final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsReleasedInterval) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsReleasedInterval");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsReleasedInterval) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsReleasedInterval");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsReleasedInterval, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsReleasedInterval::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsReleasedInterval, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsReleasedInterval::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.RefreshEffectStatisticsData
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_RefreshEffectStatisticsData final
{
public:
	EEffectStatisticsSortType                     sortType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_RefreshEffectStatisticsData) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_RefreshEffectStatisticsData");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_RefreshEffectStatisticsData) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_RefreshEffectStatisticsData");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_RefreshEffectStatisticsData, sortType) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_RefreshEffectStatisticsData::sortType' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_RefreshEffectStatisticsData, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_RefreshEffectStatisticsData::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetEffectStatisticsEntryCount
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntryCount final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntryCount) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntryCount");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntryCount) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntryCount");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntryCount, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntryCount::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntryCount, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntryCount::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetEffectStatisticsEntry
// 0x0018 (0x0018 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry final
{
public:
	int32                                         index1;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUEffectStatisticsEntryData_C*          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry) == 0x000018, "Wrong size on EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry, index1) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry::index1' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry, ReturnValue) == 0x000010, "Member 'EffectBlueprintFunctionLibrary_C_GetEffectStatisticsEntry::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.AddDebugLineFromPlayer
// 0x0030 (0x0030 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer final
{
public:
	struct FVector                                location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           color;                                             // 0x000C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         width;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer) == 0x000030, "Wrong size on EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer, location) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer::location' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer, color) == 0x00000C, "Member 'EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer::color' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer, width) == 0x00001C, "Member 'EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer::width' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer, __WorldContext) == 0x000020, "Member 'EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer, ReturnValue) == 0x000028, "Member 'EffectBlueprintFunctionLibrary_C_AddDebugLineFromPlayer::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.ClearDebugDraw
// 0x0008 (0x0008 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_ClearDebugDraw final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_ClearDebugDraw) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_ClearDebugDraw");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_ClearDebugDraw) == 0x000008, "Wrong size on EffectBlueprintFunctionLibrary_C_ClearDebugDraw");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_ClearDebugDraw, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_ClearDebugDraw::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetClusteredStuffDensities
// 0x0028 (0x0028 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities final
{
public:
	class UWorld*                                 world;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         index1;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffectClusteredStuffSettings_C*        overrideData1;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         density1;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities) == 0x000028, "Wrong size on EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities, world) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities::world' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities, index1) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities::index1' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities, overrideData1) == 0x000010, "Member 'EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities::overrideData1' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities, density1) == 0x000018, "Member 'EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities::density1' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities, __WorldContext) == 0x000020, "Member 'EffectBlueprintFunctionLibrary_C_SetClusteredStuffDensities::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetMaterialControllerDataSync
// 0x0028 (0x0028 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 materialDataPath;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          isGroup;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync) == 0x000028, "Wrong size on EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync, entityId) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync::entityId' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync, materialDataPath) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync::materialDataPath' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync, isGroup) == 0x000018, "Member 'EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync::isGroup' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync, __WorldContext) == 0x000020, "Member 'EffectBlueprintFunctionLibrary_C_SetMaterialControllerDataSync::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.DisableGlobalInteractionEffect
// 0x0008 (0x0008 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_DisableGlobalInteractionEffect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_DisableGlobalInteractionEffect) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_DisableGlobalInteractionEffect");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_DisableGlobalInteractionEffect) == 0x000008, "Wrong size on EffectBlueprintFunctionLibrary_C_DisableGlobalInteractionEffect");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_DisableGlobalInteractionEffect, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_DisableGlobalInteractionEffect::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.EnableGlobalInteractionEffect
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_EnableGlobalInteractionEffect final
{
public:
	class UItemMaterialControllerGlobalData_C*    globalMaterialData;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_EnableGlobalInteractionEffect) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_EnableGlobalInteractionEffect");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_EnableGlobalInteractionEffect) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_EnableGlobalInteractionEffect");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_EnableGlobalInteractionEffect, globalMaterialData) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_EnableGlobalInteractionEffect::globalMaterialData' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_EnableGlobalInteractionEffect, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_EnableGlobalInteractionEffect::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.ValidateKuroAnimNotify
// 0x0018 (0x0018 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify final
{
public:
	class UKuroAnimNotify*                        asset;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify) == 0x000018, "Wrong size on EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify, asset) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify::asset' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify, ReturnValue) == 0x000010, "Member 'EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotify::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.ValidateKuroAnimNotifyState
// 0x0018 (0x0018 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState final
{
public:
	class UKuroAnimNotifyState*                   asset;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState) == 0x000018, "Wrong size on EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState, asset) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState::asset' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState, ReturnValue) == 0x000010, "Member 'EffectBlueprintFunctionLibrary_C_ValidateKuroAnimNotifyState::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetEffectSpawnLogEnabled
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled final
{
public:
	bool                                          enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled, enabled) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled::enabled' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_SetEffectSpawnLogEnabled::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.BeginDebugDrawFoliageDetect
// 0x0020 (0x0020 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect final
{
public:
	struct FLinearColor                           color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         width;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect) == 0x000020, "Wrong size on EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect, color) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect::color' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect, width) == 0x000010, "Member 'EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect::width' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect, __WorldContext) == 0x000018, "Member 'EffectBlueprintFunctionLibrary_C_BeginDebugDrawFoliageDetect::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.EndDebugDrawFoliageDetect
// 0x0008 (0x0008 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_EndDebugDrawFoliageDetect final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_EndDebugDrawFoliageDetect) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_EndDebugDrawFoliageDetect");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_EndDebugDrawFoliageDetect) == 0x000008, "Wrong size on EffectBlueprintFunctionLibrary_C_EndDebugDrawFoliageDetect");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_EndDebugDrawFoliageDetect, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_EndDebugDrawFoliageDetect::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.RefreshFoliageDetectConfig
// 0x0008 (0x0008 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_RefreshFoliageDetectConfig final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_RefreshFoliageDetectConfig) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_RefreshFoliageDetectConfig");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_RefreshFoliageDetectConfig) == 0x000008, "Wrong size on EffectBlueprintFunctionLibrary_C_RefreshFoliageDetectConfig");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_RefreshFoliageDetectConfig, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_RefreshFoliageDetectConfig::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetVisualizeCharacterWaterEffectTrace
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace, enable) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace::enable' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_SetVisualizeCharacterWaterEffectTrace::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetEffectInPoolEnabled
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled, enable) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled::enable' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_SetEffectInPoolEnabled::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetEffectOutPoolEnabled
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled, enable) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled::enable' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_SetEffectOutPoolEnabled::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetNumEffectUpdateNonRearrange
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNonRearrange final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNonRearrange) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNonRearrange");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNonRearrange) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNonRearrange");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNonRearrange, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNonRearrange::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNonRearrange, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNonRearrange::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetNumEffectUpdateArbitrary
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateArbitrary final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateArbitrary) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateArbitrary");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateArbitrary) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateArbitrary");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateArbitrary, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateArbitrary::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateArbitrary, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateArbitrary::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetNumEffectUpdateHigh
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateHigh final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateHigh) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateHigh");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateHigh) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateHigh");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateHigh, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateHigh::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateHigh, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateHigh::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetNumEffectUpdateLow
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateLow final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateLow) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateLow");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateLow) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateLow");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateLow, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateLow::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateLow, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateLow::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetNumEffectUpdateNearlyPaused
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNearlyPaused final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNearlyPaused) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNearlyPaused");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNearlyPaused) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNearlyPaused");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNearlyPaused, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNearlyPaused::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNearlyPaused, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectUpdateNearlyPaused::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetNumEffectAll
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetNumEffectAll final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetNumEffectAll) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetNumEffectAll");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetNumEffectAll) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetNumEffectAll");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectAll, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectAll::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectAll, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectAll::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.GetNumEffectTickThisFrame
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_GetNumEffectTickThisFrame final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_GetNumEffectTickThisFrame) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_GetNumEffectTickThisFrame");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_GetNumEffectTickThisFrame) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_GetNumEffectTickThisFrame");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectTickThisFrame, __WorldContext) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectTickThisFrame::__WorldContext' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_GetNumEffectTickThisFrame, ReturnValue) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_GetNumEffectTickThisFrame::ReturnValue' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.EnableSceneObjectWaterEffectShowDebugTrace
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace, enable) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace::enable' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_EnableSceneObjectWaterEffectShowDebugTrace::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.SetTsWriteTimeToCollectionEnabled
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled, enable) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled::enable' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_SetTsWriteTimeToCollectionEnabled::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.AudioVisualizationInstanceStart
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceStart final
{
public:
	class AAudioVisualizationInstanceBase_C*      actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceStart) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceStart");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceStart) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceStart");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceStart, actor) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceStart::actor' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceStart, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceStart::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.AudioVisualizationInstanceEnd
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceEnd final
{
public:
	class AAudioVisualizationInstanceBase_C*      actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceEnd) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceEnd");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceEnd) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceEnd");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceEnd, actor) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceEnd::actor' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceEnd, __WorldContext) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceEnd::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.AudioVisualizationInstanceCallback
// 0x0030 (0x0030 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback final
{
public:
	class AAudioVisualizationInstanceBase_C*      actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkCallbackInfo*                        callbackInfo;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkCallbackType                               callbackType;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 state;                                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback) == 0x000030, "Wrong size on EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback, actor) == 0x000000, "Member 'EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback::actor' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback, callbackInfo) == 0x000008, "Member 'EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback::callbackInfo' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback, callbackType) == 0x000010, "Member 'EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback::callbackType' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback, state) == 0x000018, "Member 'EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback::state' has a wrong offset!");
static_assert(offsetof(EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback, __WorldContext) == 0x000028, "Member 'EffectBlueprintFunctionLibrary_C_AudioVisualizationInstanceCallback::__WorldContext' has a wrong offset!");

// Function EffectBlueprintFunctionLibrary.EffectBlueprintFunctionLibrary_C.EffectCgMode
// 0x0010 (0x0010 - 0x0000)
struct EffectBlueprintFunctionLibrary_C_EffectCgMode final
{
public:
	bool                                          enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EffectBlueprintFunctionLibrary_C_EffectCgMode) == 0x000008, "Wrong alignment on EffectBlueprintFunctionLibrary_C_EffectCgMode");
static_assert(sizeof(EffectBlueprintFunctionLibrary_C_EffectCgMode) == 0x000010, "Wrong size on EffectBlueprintFunctionLibrary_C_EffectCgMode");
