#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Bulante_SwingCombo02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Bulante_SwingCombo02.GA_Bulante_SwingCombo02_C
// 0x0040 (0x05A8 - 0x0568)
class UGA_Bulante_SwingCombo02_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Bulante_SwingCombo02_C;          // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityTask_WaitGameplayTagAdded*      异步任务;                                          // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      异步任务_0;                                        // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      异步任务_1;                                        // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          落地攻击;                                          // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlockTime;                                         // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          正在Looping;                                       // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          正在主动Flerping;                                  // 0x0591(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          正在被动Flerping;                                  // 0x0592(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          正在动画1;                                         // 0x0593(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          正在动画5;                                         // 0x0594(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_595[0x3];                                      // 0x0595(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     技能目标;                                          // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     施法角色;                                          // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Bulante_SwingCombo02(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E8128AEEF1A();
	void OnBlendOut_5D118C384AE61F1C80292E8128AEEF1A();
	void OnInterrupted_5D118C384AE61F1C80292E8128AEEF1A();
	void OnCancelled_5D118C384AE61F1C80292E8128AEEF1A();
	void OnTick_5D118C384AE61F1C80292E8128AEEF1A();
	void OnFinish_7C02401544D401AA1C6BE4BA83C60F45();
	void Added_21071CB943CD992BF8EFD6A354F249EB(const struct FGameplayTag& Tag);
	void Removed_DB9F64004F8908FEAD99D381405A1AA6(const struct FGameplayTag& Tag);
	void Removed_DB9F64004F8908FEAD99D381C179BC0A(const struct FGameplayTag& Tag);
	void Added_21071CB943CD992BF8EFD6A337BFFB93(const struct FGameplayTag& Tag);
	void OnCompleted_5D118C384AE61F1C80292E813E6F5C8F();
	void OnBlendOut_5D118C384AE61F1C80292E813E6F5C8F();
	void OnInterrupted_5D118C384AE61F1C80292E813E6F5C8F();
	void OnCancelled_5D118C384AE61F1C80292E813E6F5C8F();
	void OnTick_5D118C384AE61F1C80292E813E6F5C8F();
	void OnCompleted_5D118C384AE61F1C80292E812A4FF98A();
	void OnBlendOut_5D118C384AE61F1C80292E812A4FF98A();
	void OnInterrupted_5D118C384AE61F1C80292E812A4FF98A();
	void OnCancelled_5D118C384AE61F1C80292E812A4FF98A();
	void OnTick_5D118C384AE61F1C80292E812A4FF98A();
	void Added_21071CB943CD992BF8EFD6A357C5C51C(const struct FGameplayTag& Tag);
	void OnCompleted_5D118C384AE61F1C80292E816A5B8780();
	void OnBlendOut_5D118C384AE61F1C80292E816A5B8780();
	void OnInterrupted_5D118C384AE61F1C80292E816A5B8780();
	void OnCancelled_5D118C384AE61F1C80292E816A5B8780();
	void OnTick_5D118C384AE61F1C80292E816A5B8780();
	void Added_21071CB943CD992BF8EFD6A348549FE8(const struct FGameplayTag& Tag);
	void OnCompleted_5D118C384AE61F1C80292E8136DD144E();
	void OnBlendOut_5D118C384AE61F1C80292E8136DD144E();
	void OnInterrupted_5D118C384AE61F1C80292E8136DD144E();
	void OnCancelled_5D118C384AE61F1C80292E8136DD144E();
	void OnTick_5D118C384AE61F1C80292E8136DD144E();
	void OnCompleted_5D118C384AE61F1C80292E8140561F95();
	void OnBlendOut_5D118C384AE61F1C80292E8140561F95();
	void OnInterrupted_5D118C384AE61F1C80292E8140561F95();
	void OnCancelled_5D118C384AE61F1C80292E8140561F95();
	void OnTick_5D118C384AE61F1C80292E8140561F95();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Bulante_SwingCombo02_C">();
	}
	static class UGA_Bulante_SwingCombo02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Bulante_SwingCombo02_C>();
	}
};
static_assert(alignof(UGA_Bulante_SwingCombo02_C) == 0x000008, "Wrong alignment on UGA_Bulante_SwingCombo02_C");
static_assert(sizeof(UGA_Bulante_SwingCombo02_C) == 0x0005A8, "Wrong size on UGA_Bulante_SwingCombo02_C");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, UberGraphFrame_GA_Bulante_SwingCombo02_C) == 0x000568, "Member 'UGA_Bulante_SwingCombo02_C::UberGraphFrame_GA_Bulante_SwingCombo02_C' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 异步任务) == 0x000570, "Member 'UGA_Bulante_SwingCombo02_C::异步任务' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 异步任务_0) == 0x000578, "Member 'UGA_Bulante_SwingCombo02_C::异步任务_0' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 异步任务_1) == 0x000580, "Member 'UGA_Bulante_SwingCombo02_C::异步任务_1' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 落地攻击) == 0x000588, "Member 'UGA_Bulante_SwingCombo02_C::落地攻击' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, BlockTime) == 0x00058C, "Member 'UGA_Bulante_SwingCombo02_C::BlockTime' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 正在Looping) == 0x000590, "Member 'UGA_Bulante_SwingCombo02_C::正在Looping' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 正在主动Flerping) == 0x000591, "Member 'UGA_Bulante_SwingCombo02_C::正在主动Flerping' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 正在被动Flerping) == 0x000592, "Member 'UGA_Bulante_SwingCombo02_C::正在被动Flerping' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 正在动画1) == 0x000593, "Member 'UGA_Bulante_SwingCombo02_C::正在动画1' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 正在动画5) == 0x000594, "Member 'UGA_Bulante_SwingCombo02_C::正在动画5' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 技能目标) == 0x000598, "Member 'UGA_Bulante_SwingCombo02_C::技能目标' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwingCombo02_C, 施法角色) == 0x0005A0, "Member 'UGA_Bulante_SwingCombo02_C::施法角色' has a wrong offset!");

}

