#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Bulante_QTE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Bulante_QTE.GA_Bulante_QTE_C
// 0x0030 (0x0588 - 0x0558)
class UGA_Bulante_QTE_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Bulante_QTE_C;                   // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Entity_Id;                                         // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_QTE_Camera_C*                       QTECamera;                                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      异步任务_0;                                        // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          成功命中并释放派生;                                // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     技能目标;                                          // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Bulante_QTE(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E8172335DA4();
	void OnBlendOut_5D118C384AE61F1C80292E8172335DA4();
	void OnInterrupted_5D118C384AE61F1C80292E8172335DA4();
	void OnCancelled_5D118C384AE61F1C80292E8172335DA4();
	void OnTick_5D118C384AE61F1C80292E8172335DA4();
	void OnFinish_90AD38134007381A0E456E96C7AFB856();
	void OnCompleted_5D118C384AE61F1C80292E815E8E3B2A();
	void OnBlendOut_5D118C384AE61F1C80292E815E8E3B2A();
	void OnInterrupted_5D118C384AE61F1C80292E815E8E3B2A();
	void OnCancelled_5D118C384AE61F1C80292E815E8E3B2A();
	void OnTick_5D118C384AE61F1C80292E815E8E3B2A();
	void Added_21071CB943CD992BF8EFD6A36138EBF2(const struct FGameplayTag& Tag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Bulante_QTE_C">();
	}
	static class UGA_Bulante_QTE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Bulante_QTE_C>();
	}
};
static_assert(alignof(UGA_Bulante_QTE_C) == 0x000008, "Wrong alignment on UGA_Bulante_QTE_C");
static_assert(sizeof(UGA_Bulante_QTE_C) == 0x000588, "Wrong size on UGA_Bulante_QTE_C");
static_assert(offsetof(UGA_Bulante_QTE_C, UberGraphFrame_GA_Bulante_QTE_C) == 0x000558, "Member 'UGA_Bulante_QTE_C::UberGraphFrame_GA_Bulante_QTE_C' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_QTE_C, Entity_Id) == 0x000560, "Member 'UGA_Bulante_QTE_C::Entity_Id' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_QTE_C, QTECamera) == 0x000568, "Member 'UGA_Bulante_QTE_C::QTECamera' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_QTE_C, 异步任务_0) == 0x000570, "Member 'UGA_Bulante_QTE_C::异步任务_0' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_QTE_C, 成功命中并释放派生) == 0x000578, "Member 'UGA_Bulante_QTE_C::成功命中并释放派生' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_QTE_C, 技能目标) == 0x000580, "Member 'UGA_Bulante_QTE_C::技能目标' has a wrong offset!");

}

