#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Bulante_SwA3_DownStrike

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Bulante_SwA3_DownStrike.GA_Bulante_SwA3_DownStrike_C
// 0x0018 (0x0580 - 0x0568)
class UGA_Bulante_SwA3_DownStrike_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Bulante_SwA3_DownStrike_C;       // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          落地攻击;                                          // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlockTime;                                         // 0x0574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     施法角色;                                          // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Bulante_SwA3_DownStrike(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnFinish_1D70D9BF444F9EFA199583B6DDF0CA9B();
	void OnCompleted_5D118C384AE61F1C80292E8156EF2A21();
	void OnBlendOut_5D118C384AE61F1C80292E8156EF2A21();
	void OnInterrupted_5D118C384AE61F1C80292E8156EF2A21();
	void OnCancelled_5D118C384AE61F1C80292E8156EF2A21();
	void OnTick_5D118C384AE61F1C80292E8156EF2A21();
	void OnCompleted_5D118C384AE61F1C80292E816A3C7483();
	void OnBlendOut_5D118C384AE61F1C80292E816A3C7483();
	void OnInterrupted_5D118C384AE61F1C80292E816A3C7483();
	void OnCancelled_5D118C384AE61F1C80292E816A3C7483();
	void OnTick_5D118C384AE61F1C80292E816A3C7483();
	void OnCompleted_5D118C384AE61F1C80292E81BDD61CC5();
	void OnBlendOut_5D118C384AE61F1C80292E81BDD61CC5();
	void OnInterrupted_5D118C384AE61F1C80292E81BDD61CC5();
	void OnCancelled_5D118C384AE61F1C80292E81BDD61CC5();
	void OnTick_5D118C384AE61F1C80292E81BDD61CC5();
	void OnCompleted_5D118C384AE61F1C80292E81778E9B40();
	void OnBlendOut_5D118C384AE61F1C80292E81778E9B40();
	void OnInterrupted_5D118C384AE61F1C80292E81778E9B40();
	void OnCancelled_5D118C384AE61F1C80292E81778E9B40();
	void OnTick_5D118C384AE61F1C80292E81778E9B40();
	void OnCompleted_5D118C384AE61F1C80292E81C5F7AF2C();
	void OnBlendOut_5D118C384AE61F1C80292E81C5F7AF2C();
	void OnInterrupted_5D118C384AE61F1C80292E81C5F7AF2C();
	void OnCancelled_5D118C384AE61F1C80292E81C5F7AF2C();
	void OnTick_5D118C384AE61F1C80292E81C5F7AF2C();
	void OnCompleted_5D118C384AE61F1C80292E810C8AD02E();
	void OnBlendOut_5D118C384AE61F1C80292E810C8AD02E();
	void OnInterrupted_5D118C384AE61F1C80292E810C8AD02E();
	void OnCancelled_5D118C384AE61F1C80292E810C8AD02E();
	void OnTick_5D118C384AE61F1C80292E810C8AD02E();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Bulante_SwA3_DownStrike_C">();
	}
	static class UGA_Bulante_SwA3_DownStrike_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Bulante_SwA3_DownStrike_C>();
	}
};
static_assert(alignof(UGA_Bulante_SwA3_DownStrike_C) == 0x000008, "Wrong alignment on UGA_Bulante_SwA3_DownStrike_C");
static_assert(sizeof(UGA_Bulante_SwA3_DownStrike_C) == 0x000580, "Wrong size on UGA_Bulante_SwA3_DownStrike_C");
static_assert(offsetof(UGA_Bulante_SwA3_DownStrike_C, UberGraphFrame_GA_Bulante_SwA3_DownStrike_C) == 0x000568, "Member 'UGA_Bulante_SwA3_DownStrike_C::UberGraphFrame_GA_Bulante_SwA3_DownStrike_C' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwA3_DownStrike_C, 落地攻击) == 0x000570, "Member 'UGA_Bulante_SwA3_DownStrike_C::落地攻击' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwA3_DownStrike_C, BlockTime) == 0x000574, "Member 'UGA_Bulante_SwA3_DownStrike_C::BlockTime' has a wrong offset!");
static_assert(offsetof(UGA_Bulante_SwA3_DownStrike_C, 施法角色) == 0x000578, "Member 'UGA_Bulante_SwA3_DownStrike_C::施法角色' has a wrong offset!");

}

