#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Bulante_QTE

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Bulante_QTE.GA_Bulante_QTE_C.ExecuteUbergraph_GA_Bulante_QTE
// 0x03A0 (0x03A0 - 0x0000)
struct GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc____________;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A8(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00D0(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________1;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0128(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA______________;                     // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________2;                              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0180(0x0028)(ZeroConstructor)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x01A8(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc__________SpeedRatio;                      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01F8(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________6;                              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0258(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________1;                   // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x02A0(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________7;                              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x02D8(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_11;         // 0x0308(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_1;                    // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable;                                // 0x0358(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_2;          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE) == 0x000008, "Wrong alignment on GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE");
static_assert(sizeof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE) == 0x0003A0, "Wrong size on GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, EntryPoint) == 0x000000, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc__________) == 0x000008, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_WaitDelay_ReturnValue) == 0x000010, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc____________) == 0x000018, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_DynamicCast_AsTs_Base_Character) == 0x000020, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000D0, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000F8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________1) == 0x000100, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_GetDisplayName_ReturnValue) == 0x000108, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_GetObjectClass_ReturnValue) == 0x000118, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000120, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_5) == 0x000128, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_____GA______________) == 0x000150, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_Conv_NameToString_ReturnValue) == 0x000160, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________2) == 0x000170, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_IsValid_ReturnValue_1) == 0x000178, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_6) == 0x000180, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CustomEvent_Tag) == 0x0001A8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc__________SpeedRatio) == 0x0001B4, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________3) == 0x0001B8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc______________) == 0x0001C0, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________4) == 0x0001C8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________5) == 0x0001D0, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_______________1) == 0x0001D8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0001E0, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x0001E8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001F4, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001F8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________6) == 0x000220, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000228, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_GetDisplayName_ReturnValue_1) == 0x000230, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_IsValid_ReturnValue_2) == 0x000240, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_GetObjectClass_ReturnValue_1) == 0x000248, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000250, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_8) == 0x000258, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_____GA_______________1) == 0x000280, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000290, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002A0, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________7) == 0x0002C8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_IsValid_ReturnValue_3) == 0x0002D0, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_10) == 0x0002D8, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________8) == 0x000300, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_CreateDelegate_OutputDelegate_11) == 0x000308, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________9) == 0x000330, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000338, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_IsValid_ReturnValue_4) == 0x000340, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________10) == 0x000348, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_______________2) == 0x000350, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc__________SpeedRatio_1) == 0x000354, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, ___struct_Variable) == 0x000358, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000368, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_IsValid_ReturnValue_5) == 0x000370, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000378, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_DynamicCast_AsTs_Base_Character_2) == 0x000380, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_DynamicCast_AsTs_Base_Character_2' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, K2Node_DynamicCast_bSuccess_2) == 0x000388, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc___________11) == 0x000390, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE, CallFunc_______________3) == 0x000398, "Member 'GA_Bulante_QTE_C_ExecuteUbergraph_GA_Bulante_QTE::CallFunc_______________3' has a wrong offset!");

// Function GA_Bulante_QTE.GA_Bulante_QTE_C.Added_21071CB943CD992BF8EFD6A36138EBF2
// 0x000C (0x000C - 0x0000)
struct GA_Bulante_QTE_C_Added_21071CB943CD992BF8EFD6A36138EBF2 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Bulante_QTE_C_Added_21071CB943CD992BF8EFD6A36138EBF2) == 0x000004, "Wrong alignment on GA_Bulante_QTE_C_Added_21071CB943CD992BF8EFD6A36138EBF2");
static_assert(sizeof(GA_Bulante_QTE_C_Added_21071CB943CD992BF8EFD6A36138EBF2) == 0x00000C, "Wrong size on GA_Bulante_QTE_C_Added_21071CB943CD992BF8EFD6A36138EBF2");
static_assert(offsetof(GA_Bulante_QTE_C_Added_21071CB943CD992BF8EFD6A36138EBF2, Tag) == 0x000000, "Member 'GA_Bulante_QTE_C_Added_21071CB943CD992BF8EFD6A36138EBF2::Tag' has a wrong offset!");

}

