#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Base

#include "Basic.hpp"

#include "EAimViewState_structs.hpp"
#include "EPawnChannel_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SSkillInfo_structs.hpp"


namespace SDK::Params
{

// Function GA_Base.GA_Base_C.ExecuteUbergraph_GA_Base
// 0x0018 (0x0018 - 0x0000)
struct GA_Base_C_ExecuteUbergraph_GA_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_OnActivateAbility_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_ExecuteUbergraph_GA_Base) == 0x000008, "Wrong alignment on GA_Base_C_ExecuteUbergraph_GA_Base");
static_assert(sizeof(GA_Base_C_ExecuteUbergraph_GA_Base) == 0x000018, "Wrong size on GA_Base_C_ExecuteUbergraph_GA_Base");
static_assert(offsetof(GA_Base_C_ExecuteUbergraph_GA_Base, EntryPoint) == 0x000000, "Member 'GA_Base_C_ExecuteUbergraph_GA_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Base_C_ExecuteUbergraph_GA_Base, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_Base_C_ExecuteUbergraph_GA_Base::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Base_C_ExecuteUbergraph_GA_Base, CallFunc_K2_CommitAbility_ReturnValue) == 0x000005, "Member 'GA_Base_C_ExecuteUbergraph_GA_Base::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_ExecuteUbergraph_GA_Base, CallFunc__________) == 0x000008, "Member 'GA_Base_C_ExecuteUbergraph_GA_Base::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Base_C_ExecuteUbergraph_GA_Base, CallFunc_OnActivateAbility_ReturnValue) == 0x000010, "Member 'GA_Base_C_ExecuteUbergraph_GA_Base::CallFunc_OnActivateAbility_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Base_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Base_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Base_C_K2_OnEndAbility");
static_assert(sizeof(GA_Base_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Base_C_K2_OnEndAbility");
static_assert(offsetof(GA_Base_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Base_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取施法者
// 0x0020 (0x0020 - 0x0000)
struct GA_Base_C_获取施法者 final
{
public:
	class ATsBaseCharacter_C*                     施法者;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Base_C_获取施法者) == 0x000008, "Wrong alignment on GA_Base_C_获取施法者");
static_assert(sizeof(GA_Base_C_获取施法者) == 0x000020, "Wrong size on GA_Base_C_获取施法者");
static_assert(offsetof(GA_Base_C_获取施法者, 施法者) == 0x000000, "Member 'GA_Base_C_获取施法者::施法者' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取施法者, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Base_C_获取施法者::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取施法者, K2Node_DynamicCast_AsTs_Base_Character) == 0x000010, "Member 'GA_Base_C_获取施法者::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取施法者, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Base_C_获取施法者::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取当前技能配置Id
// 0x0010 (0x0010 - 0x0000)
struct GA_Base_C_获取当前技能配置Id final
{
public:
	class FString                                 当前技能数据名_0;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取当前技能配置Id) == 0x000008, "Wrong alignment on GA_Base_C_获取当前技能配置Id");
static_assert(sizeof(GA_Base_C_获取当前技能配置Id) == 0x000010, "Wrong size on GA_Base_C_获取当前技能配置Id");
static_assert(offsetof(GA_Base_C_获取当前技能配置Id, 当前技能数据名_0) == 0x000000, "Member 'GA_Base_C_获取当前技能配置Id::当前技能数据名_0' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取当前技能配置
// 0x0170 (0x0170 - 0x0000)
struct GA_Base_C_获取当前技能配置 final
{
public:
	struct FSSkillInfo                            当前技能数据_0;                                    // 0x0000(0x0170)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取当前技能配置) == 0x000008, "Wrong alignment on GA_Base_C_获取当前技能配置");
static_assert(sizeof(GA_Base_C_获取当前技能配置) == 0x000170, "Wrong size on GA_Base_C_获取当前技能配置");
static_assert(offsetof(GA_Base_C_获取当前技能配置, 当前技能数据_0) == 0x000000, "Member 'GA_Base_C_获取当前技能配置::当前技能数据_0' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取技能动画
// 0x0318 (0x0318 - 0x0000)
struct GA_Base_C_获取技能动画 final
{
public:
	int32                                         编号;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           动画;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSSkillInfo                            SkillInfo;                                         // 0x0010(0x0170)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSSkillInfo                            CallFunc________________;                          // 0x0188(0x0170)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetSkillMontageInstance_ReturnValue;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取技能动画) == 0x000008, "Wrong alignment on GA_Base_C_获取技能动画");
static_assert(sizeof(GA_Base_C_获取技能动画) == 0x000318, "Wrong size on GA_Base_C_获取技能动画");
static_assert(offsetof(GA_Base_C_获取技能动画, 编号) == 0x000000, "Member 'GA_Base_C_获取技能动画::编号' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能动画, 动画) == 0x000008, "Member 'GA_Base_C_获取技能动画::动画' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能动画, SkillInfo) == 0x000010, "Member 'GA_Base_C_获取技能动画::SkillInfo' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能动画, Montage) == 0x000180, "Member 'GA_Base_C_获取技能动画::Montage' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能动画, CallFunc________________) == 0x000188, "Member 'GA_Base_C_获取技能动画::CallFunc________________' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能动画, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0002F8, "Member 'GA_Base_C_获取技能动画::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能动画, K2Node_DynamicCast_AsTs_Base_Character) == 0x000300, "Member 'GA_Base_C_获取技能动画::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能动画, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'GA_Base_C_获取技能动画::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能动画, CallFunc_GetSkillMontageInstance_ReturnValue) == 0x000310, "Member 'GA_Base_C_获取技能动画::CallFunc_GetSkillMontageInstance_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取技能所有动画
// 0x0040 (0x0040 - 0x0000)
struct GA_Base_C_获取技能所有动画 final
{
public:
	TArray<class UAnimMontage*>                   技能动画数组;                                      // 0x0000(0x0010)(Parm, OutParm)
	bool                                          LoopCondition;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TempInt;                                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   MontageArray;                                      // 0x0018(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc__________;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取技能所有动画) == 0x000008, "Wrong alignment on GA_Base_C_获取技能所有动画");
static_assert(sizeof(GA_Base_C_获取技能所有动画) == 0x000040, "Wrong size on GA_Base_C_获取技能所有动画");
static_assert(offsetof(GA_Base_C_获取技能所有动画, 技能动画数组) == 0x000000, "Member 'GA_Base_C_获取技能所有动画::技能动画数组' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能所有动画, LoopCondition) == 0x000010, "Member 'GA_Base_C_获取技能所有动画::LoopCondition' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能所有动画, TempInt) == 0x000014, "Member 'GA_Base_C_获取技能所有动画::TempInt' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能所有动画, MontageArray) == 0x000018, "Member 'GA_Base_C_获取技能所有动画::MontageArray' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能所有动画, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'GA_Base_C_获取技能所有动画::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能所有动画, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'GA_Base_C_获取技能所有动画::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能所有动画, CallFunc__________) == 0x000030, "Member 'GA_Base_C_获取技能所有动画::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能所有动画, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GA_Base_C_获取技能所有动画::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能所有动画, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'GA_Base_C_获取技能所有动画::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取技能标签
// 0x0180 (0x0180 - 0x0000)
struct GA_Base_C_获取技能标签 final
{
public:
	TArray<struct FGameplayTag>                   技能标签;                                          // 0x0000(0x0010)(Parm, OutParm)
	struct FSSkillInfo                            CallFunc________________;                          // 0x0010(0x0170)(HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取技能标签) == 0x000008, "Wrong alignment on GA_Base_C_获取技能标签");
static_assert(sizeof(GA_Base_C_获取技能标签) == 0x000180, "Wrong size on GA_Base_C_获取技能标签");
static_assert(offsetof(GA_Base_C_获取技能标签, 技能标签) == 0x000000, "Member 'GA_Base_C_获取技能标签::技能标签' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能标签, CallFunc________________) == 0x000010, "Member 'GA_Base_C_获取技能标签::CallFunc________________' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取AbilitySystemComponent
// 0x0010 (0x0010 - 0x0000)
struct GA_Base_C_获取AbilitySystemComponent final
{
public:
	class UBaseAbilitySystemComponent*            AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取AbilitySystemComponent) == 0x000008, "Wrong alignment on GA_Base_C_获取AbilitySystemComponent");
static_assert(sizeof(GA_Base_C_获取AbilitySystemComponent) == 0x000010, "Wrong size on GA_Base_C_获取AbilitySystemComponent");
static_assert(offsetof(GA_Base_C_获取AbilitySystemComponent, AbilitySystemComponent) == 0x000000, "Member 'GA_Base_C_获取AbilitySystemComponent::AbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取AbilitySystemComponent, CallFunc__________) == 0x000008, "Member 'GA_Base_C_获取AbilitySystemComponent::CallFunc__________' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取技能目标
// 0x0018 (0x0018 - 0x0000)
struct GA_Base_C_获取技能目标 final
{
public:
	class ATsBaseCharacter_C*                     目标;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 技能目标;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSkillTarget_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取技能目标) == 0x000008, "Wrong alignment on GA_Base_C_获取技能目标");
static_assert(sizeof(GA_Base_C_获取技能目标) == 0x000018, "Wrong size on GA_Base_C_获取技能目标");
static_assert(offsetof(GA_Base_C_获取技能目标, 目标) == 0x000000, "Member 'GA_Base_C_获取技能目标::目标' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标, 技能目标) == 0x000008, "Member 'GA_Base_C_获取技能目标::技能目标' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标, CallFunc_GetSkillTarget_ReturnValue) == 0x000010, "Member 'GA_Base_C_获取技能目标::CallFunc_GetSkillTarget_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取技能目标距离
// 0x0060 (0x0060 - 0x0000)
struct GA_Base_C_获取技能目标距离 final
{
public:
	bool                                          平面2D;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         距离;                                              // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc____________;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_D_Vector_Distance_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_D_Vector_Distance2D_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue_1;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取技能目标距离) == 0x000008, "Wrong alignment on GA_Base_C_获取技能目标距离");
static_assert(sizeof(GA_Base_C_获取技能目标距离) == 0x000060, "Wrong size on GA_Base_C_获取技能目标距离");
static_assert(offsetof(GA_Base_C_获取技能目标距离, 平面2D) == 0x000000, "Member 'GA_Base_C_获取技能目标距离::平面2D' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标距离, 距离) == 0x000004, "Member 'GA_Base_C_获取技能目标距离::距离' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标距离, CallFunc__________) == 0x000008, "Member 'GA_Base_C_获取技能目标距离::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标距离, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'GA_Base_C_获取技能目标距离::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标距离, CallFunc____________) == 0x000028, "Member 'GA_Base_C_获取技能目标距离::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标距离, CallFunc_D_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'GA_Base_C_获取技能目标距离::CallFunc_D_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标距离, CallFunc_D_Vector_Distance_ReturnValue) == 0x000048, "Member 'GA_Base_C_获取技能目标距离::CallFunc_D_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标距离, CallFunc_D_Vector_Distance2D_ReturnValue) == 0x000050, "Member 'GA_Base_C_获取技能目标距离::CallFunc_D_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标距离, CallFunc_Conv_DoubleToFloat_ReturnValue) == 0x000058, "Member 'GA_Base_C_获取技能目标距离::CallFunc_Conv_DoubleToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取技能目标距离, CallFunc_Conv_DoubleToFloat_ReturnValue_1) == 0x00005C, "Member 'GA_Base_C_获取技能目标距离::CallFunc_Conv_DoubleToFloat_ReturnValue_1' has a wrong offset!");

// Function GA_Base.GA_Base_C.是否拥有任意标签
// 0x0068 (0x0068 - 0x0000)
struct GA_Base_C_是否拥有任意标签 final
{
public:
	class ATsBaseCharacter_C*                     目标;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  标签;                                              // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          是否存在;                                          // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0030(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Base_C_是否拥有任意标签) == 0x000008, "Wrong alignment on GA_Base_C_是否拥有任意标签");
static_assert(sizeof(GA_Base_C_是否拥有任意标签) == 0x000068, "Wrong size on GA_Base_C_是否拥有任意标签");
static_assert(offsetof(GA_Base_C_是否拥有任意标签, 目标) == 0x000000, "Member 'GA_Base_C_是否拥有任意标签::目标' has a wrong offset!");
static_assert(offsetof(GA_Base_C_是否拥有任意标签, 标签) == 0x000008, "Member 'GA_Base_C_是否拥有任意标签::标签' has a wrong offset!");
static_assert(offsetof(GA_Base_C_是否拥有任意标签, 是否存在) == 0x000028, "Member 'GA_Base_C_是否拥有任意标签::是否存在' has a wrong offset!");
static_assert(offsetof(GA_Base_C_是否拥有任意标签, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000030, "Member 'GA_Base_C_是否拥有任意标签::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_是否拥有任意标签, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000050, "Member 'GA_Base_C_是否拥有任意标签::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Base_C_是否拥有任意标签, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000060, "Member 'GA_Base_C_是否拥有任意标签::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.设置强制速度
// 0x0020 (0x0020 - 0x0000)
struct GA_Base_C_设置强制速度 final
{
public:
	struct FVectorDouble                          速度;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_设置强制速度) == 0x000008, "Wrong alignment on GA_Base_C_设置强制速度");
static_assert(sizeof(GA_Base_C_设置强制速度) == 0x000020, "Wrong size on GA_Base_C_设置强制速度");
static_assert(offsetof(GA_Base_C_设置强制速度, 速度) == 0x000000, "Member 'GA_Base_C_设置强制速度::速度' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置强制速度, CallFunc__________) == 0x000018, "Member 'GA_Base_C_设置强制速度::CallFunc__________' has a wrong offset!");

// Function GA_Base.GA_Base_C.设置通道的碰撞响应
// 0x0010 (0x0010 - 0x0000)
struct GA_Base_C_设置通道的碰撞响应 final
{
public:
	class UPrimitiveComponent*                    目标;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             Channel;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            NewResponse;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_设置通道的碰撞响应) == 0x000008, "Wrong alignment on GA_Base_C_设置通道的碰撞响应");
static_assert(sizeof(GA_Base_C_设置通道的碰撞响应) == 0x000010, "Wrong size on GA_Base_C_设置通道的碰撞响应");
static_assert(offsetof(GA_Base_C_设置通道的碰撞响应, 目标) == 0x000000, "Member 'GA_Base_C_设置通道的碰撞响应::目标' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置通道的碰撞响应, Channel) == 0x000008, "Member 'GA_Base_C_设置通道的碰撞响应::Channel' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置通道的碰撞响应, NewResponse) == 0x000009, "Member 'GA_Base_C_设置通道的碰撞响应::NewResponse' has a wrong offset!");

// Function GA_Base.GA_Base_C.通过Tag移除自身Buff
// 0x0018 (0x0018 - 0x0000)
struct GA_Base_C_通过Tag移除自身Buff final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_通过Tag移除自身Buff) == 0x000008, "Wrong alignment on GA_Base_C_通过Tag移除自身Buff");
static_assert(sizeof(GA_Base_C_通过Tag移除自身Buff) == 0x000018, "Wrong size on GA_Base_C_通过Tag移除自身Buff");
static_assert(offsetof(GA_Base_C_通过Tag移除自身Buff, tag) == 0x000000, "Member 'GA_Base_C_通过Tag移除自身Buff::tag' has a wrong offset!");
static_assert(offsetof(GA_Base_C_通过Tag移除自身Buff, CallFunc__________) == 0x000010, "Member 'GA_Base_C_通过Tag移除自身Buff::CallFunc__________' has a wrong offset!");

// Function GA_Base.GA_Base_C.通过 ID给对象添加Buff
// 0x0030 (0x0030 - 0x0000)
struct GA_Base_C_通过_ID给对象添加Buff final
{
public:
	class ATsBaseCharacter_C*                     Buff对象;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         BuffId;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Buff层数;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_通过_ID给对象添加Buff) == 0x000008, "Wrong alignment on GA_Base_C_通过_ID给对象添加Buff");
static_assert(sizeof(GA_Base_C_通过_ID给对象添加Buff) == 0x000030, "Wrong size on GA_Base_C_通过_ID给对象添加Buff");
static_assert(offsetof(GA_Base_C_通过_ID给对象添加Buff, Buff对象) == 0x000000, "Member 'GA_Base_C_通过_ID给对象添加Buff::Buff对象' has a wrong offset!");
static_assert(offsetof(GA_Base_C_通过_ID给对象添加Buff, BuffId) == 0x000008, "Member 'GA_Base_C_通过_ID给对象添加Buff::BuffId' has a wrong offset!");
static_assert(offsetof(GA_Base_C_通过_ID给对象添加Buff, Buff层数) == 0x000010, "Member 'GA_Base_C_通过_ID给对象添加Buff::Buff层数' has a wrong offset!");
static_assert(offsetof(GA_Base_C_通过_ID给对象添加Buff, CallFunc__________) == 0x000018, "Member 'GA_Base_C_通过_ID给对象添加Buff::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Base_C_通过_ID给对象添加Buff, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'GA_Base_C_通过_ID给对象添加Buff::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取Base属性值
// 0x0018 (0x0018 - 0x0000)
struct GA_Base_C_获取Base属性值 final
{
public:
	class ATsBaseCharacter_C*                     目标;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         属性id;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         属性值;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttributeBaseValue_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取Base属性值) == 0x000008, "Wrong alignment on GA_Base_C_获取Base属性值");
static_assert(sizeof(GA_Base_C_获取Base属性值) == 0x000018, "Wrong size on GA_Base_C_获取Base属性值");
static_assert(offsetof(GA_Base_C_获取Base属性值, 目标) == 0x000000, "Member 'GA_Base_C_获取Base属性值::目标' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取Base属性值, 属性id) == 0x000008, "Member 'GA_Base_C_获取Base属性值::属性id' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取Base属性值, 属性值) == 0x00000C, "Member 'GA_Base_C_获取Base属性值::属性值' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取Base属性值, CallFunc_GetAttributeBaseValue_ReturnValue) == 0x000010, "Member 'GA_Base_C_获取Base属性值::CallFunc_GetAttributeBaseValue_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取Current属性值
// 0x0018 (0x0018 - 0x0000)
struct GA_Base_C_获取Current属性值 final
{
public:
	class ATsBaseCharacter_C*                     目标;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         属性id;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         属性值;                                            // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttributeCurrentValue_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取Current属性值) == 0x000008, "Wrong alignment on GA_Base_C_获取Current属性值");
static_assert(sizeof(GA_Base_C_获取Current属性值) == 0x000018, "Wrong size on GA_Base_C_获取Current属性值");
static_assert(offsetof(GA_Base_C_获取Current属性值, 目标) == 0x000000, "Member 'GA_Base_C_获取Current属性值::目标' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取Current属性值, 属性id) == 0x000008, "Member 'GA_Base_C_获取Current属性值::属性id' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取Current属性值, 属性值) == 0x00000C, "Member 'GA_Base_C_获取Current属性值::属性值' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取Current属性值, CallFunc_GetAttributeCurrentValue_ReturnValue) == 0x000010, "Member 'GA_Base_C_获取Current属性值::CallFunc_GetAttributeCurrentValue_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.通过 ID移除目标Buff
// 0x0028 (0x0028 - 0x0000)
struct GA_Base_C_通过_ID移除目标Buff final
{
public:
	int64                                         BuffId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         移除层数;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     目标;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Base_C_通过_ID移除目标Buff) == 0x000008, "Wrong alignment on GA_Base_C_通过_ID移除目标Buff");
static_assert(sizeof(GA_Base_C_通过_ID移除目标Buff) == 0x000028, "Wrong size on GA_Base_C_通过_ID移除目标Buff");
static_assert(offsetof(GA_Base_C_通过_ID移除目标Buff, BuffId) == 0x000000, "Member 'GA_Base_C_通过_ID移除目标Buff::BuffId' has a wrong offset!");
static_assert(offsetof(GA_Base_C_通过_ID移除目标Buff, 移除层数) == 0x000008, "Member 'GA_Base_C_通过_ID移除目标Buff::移除层数' has a wrong offset!");
static_assert(offsetof(GA_Base_C_通过_ID移除目标Buff, 目标) == 0x000010, "Member 'GA_Base_C_通过_ID移除目标Buff::目标' has a wrong offset!");
static_assert(offsetof(GA_Base_C_通过_ID移除目标Buff, CallFunc__________) == 0x000018, "Member 'GA_Base_C_通过_ID移除目标Buff::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Base_C_通过_ID移除目标Buff, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Base_C_通过_ID移除目标Buff::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.设置材质效果
// 0x0018 (0x0018 - 0x0000)
struct GA_Base_C_设置材质效果 final
{
public:
	class ATsBaseCharacter_C*                     设置对象;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPD_CharacterControllerData_C*          材质配置;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Handle;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddMaterialControllerData_ReturnValue;    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_设置材质效果) == 0x000008, "Wrong alignment on GA_Base_C_设置材质效果");
static_assert(sizeof(GA_Base_C_设置材质效果) == 0x000018, "Wrong size on GA_Base_C_设置材质效果");
static_assert(offsetof(GA_Base_C_设置材质效果, 设置对象) == 0x000000, "Member 'GA_Base_C_设置材质效果::设置对象' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置材质效果, 材质配置) == 0x000008, "Member 'GA_Base_C_设置材质效果::材质配置' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置材质效果, Handle) == 0x000010, "Member 'GA_Base_C_设置材质效果::Handle' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置材质效果, CallFunc_AddMaterialControllerData_ReturnValue) == 0x000014, "Member 'GA_Base_C_设置材质效果::CallFunc_AddMaterialControllerData_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.创建子弹
// 0x0080 (0x0080 - 0x0000)
struct GA_Base_C_创建子弹 final
{
public:
	class ATsBaseCharacter_C*                     施法者;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 子弹ID;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       初始变换;                                          // 0x0020(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FVectorDouble                          目标点;                                            // 0x0060(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         子弹;                                              // 0x0078(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateBulletFromGA_ReturnValue;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_创建子弹) == 0x000010, "Wrong alignment on GA_Base_C_创建子弹");
static_assert(sizeof(GA_Base_C_创建子弹) == 0x000080, "Wrong size on GA_Base_C_创建子弹");
static_assert(offsetof(GA_Base_C_创建子弹, 施法者) == 0x000000, "Member 'GA_Base_C_创建子弹::施法者' has a wrong offset!");
static_assert(offsetof(GA_Base_C_创建子弹, 子弹ID) == 0x000008, "Member 'GA_Base_C_创建子弹::子弹ID' has a wrong offset!");
static_assert(offsetof(GA_Base_C_创建子弹, 初始变换) == 0x000020, "Member 'GA_Base_C_创建子弹::初始变换' has a wrong offset!");
static_assert(offsetof(GA_Base_C_创建子弹, 目标点) == 0x000060, "Member 'GA_Base_C_创建子弹::目标点' has a wrong offset!");
static_assert(offsetof(GA_Base_C_创建子弹, 子弹) == 0x000078, "Member 'GA_Base_C_创建子弹::子弹' has a wrong offset!");
static_assert(offsetof(GA_Base_C_创建子弹, CallFunc_CreateBulletFromGA_ReturnValue) == 0x00007C, "Member 'GA_Base_C_创建子弹::CallFunc_CreateBulletFromGA_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.使用技能
// 0x0030 (0x0030 - 0x0000)
struct GA_Base_C_使用技能 final
{
public:
	class ATsBaseCharacter_C*                     释放者;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   技能ID;                                            // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 技能目标;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket;                                            // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否成功释放;                                      // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_BeginSkill_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Base_C_使用技能) == 0x000008, "Wrong alignment on GA_Base_C_使用技能");
static_assert(sizeof(GA_Base_C_使用技能) == 0x000030, "Wrong size on GA_Base_C_使用技能");
static_assert(offsetof(GA_Base_C_使用技能, 释放者) == 0x000000, "Member 'GA_Base_C_使用技能::释放者' has a wrong offset!");
static_assert(offsetof(GA_Base_C_使用技能, 技能ID) == 0x000008, "Member 'GA_Base_C_使用技能::技能ID' has a wrong offset!");
static_assert(offsetof(GA_Base_C_使用技能, 技能目标) == 0x000018, "Member 'GA_Base_C_使用技能::技能目标' has a wrong offset!");
static_assert(offsetof(GA_Base_C_使用技能, Socket) == 0x000020, "Member 'GA_Base_C_使用技能::Socket' has a wrong offset!");
static_assert(offsetof(GA_Base_C_使用技能, 是否成功释放) == 0x00002C, "Member 'GA_Base_C_使用技能::是否成功释放' has a wrong offset!");
static_assert(offsetof(GA_Base_C_使用技能, CallFunc_BeginSkill_ReturnValue) == 0x00002D, "Member 'GA_Base_C_使用技能::CallFunc_BeginSkill_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.召唤
// 0x0080 (0x0080 - 0x0000)
struct GA_Base_C_召唤 final
{
public:
	int32                                         配置表ID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       出生位置;                                          // 0x0010(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                          是否成功;                                          // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     召唤物;                                            // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         实体ID;                                            // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CreatureDataId;                                    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EntityID;                                          // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_召唤) == 0x000010, "Wrong alignment on GA_Base_C_召唤");
static_assert(sizeof(GA_Base_C_召唤) == 0x000080, "Wrong size on GA_Base_C_召唤");
static_assert(offsetof(GA_Base_C_召唤, 配置表ID) == 0x000000, "Member 'GA_Base_C_召唤::配置表ID' has a wrong offset!");
static_assert(offsetof(GA_Base_C_召唤, 出生位置) == 0x000010, "Member 'GA_Base_C_召唤::出生位置' has a wrong offset!");
static_assert(offsetof(GA_Base_C_召唤, 是否成功) == 0x000050, "Member 'GA_Base_C_召唤::是否成功' has a wrong offset!");
static_assert(offsetof(GA_Base_C_召唤, 召唤物) == 0x000058, "Member 'GA_Base_C_召唤::召唤物' has a wrong offset!");
static_assert(offsetof(GA_Base_C_召唤, 实体ID) == 0x000060, "Member 'GA_Base_C_召唤::实体ID' has a wrong offset!");
static_assert(offsetof(GA_Base_C_召唤, CreatureDataId) == 0x000068, "Member 'GA_Base_C_召唤::CreatureDataId' has a wrong offset!");
static_assert(offsetof(GA_Base_C_召唤, EntityID) == 0x000070, "Member 'GA_Base_C_召唤::EntityID' has a wrong offset!");

// Function GA_Base.GA_Base_C.是否联网
// 0x0003 (0x0003 - 0x0000)
struct GA_Base_C_是否联网 final
{
public:
	bool                                          联网;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EKuroNetMode                                  CallFunc_GetKuroNetMode_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Base_C_是否联网) == 0x000001, "Wrong alignment on GA_Base_C_是否联网");
static_assert(sizeof(GA_Base_C_是否联网) == 0x000003, "Wrong size on GA_Base_C_是否联网");
static_assert(offsetof(GA_Base_C_是否联网, 联网) == 0x000000, "Member 'GA_Base_C_是否联网::联网' has a wrong offset!");
static_assert(offsetof(GA_Base_C_是否联网, CallFunc_GetKuroNetMode_ReturnValue) == 0x000001, "Member 'GA_Base_C_是否联网::CallFunc_GetKuroNetMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_是否联网, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'GA_Base_C_是否联网::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取黑板 Int
// 0x0038 (0x0038 - 0x0000)
struct GA_Base_C_获取黑板_Int final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         值;                                                // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc_GetEntityId_self_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIntValueByEntity_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取黑板_Int) == 0x000008, "Wrong alignment on GA_Base_C_获取黑板_Int");
static_assert(sizeof(GA_Base_C_获取黑板_Int) == 0x000038, "Wrong size on GA_Base_C_获取黑板_Int");
static_assert(offsetof(GA_Base_C_获取黑板_Int, 角色) == 0x000000, "Member 'GA_Base_C_获取黑板_Int::角色' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板_Int, key) == 0x000008, "Member 'GA_Base_C_获取黑板_Int::key' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板_Int, 值) == 0x000018, "Member 'GA_Base_C_获取黑板_Int::值' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板_Int, CallFunc_GetEntityId_self_CastInput) == 0x000020, "Member 'GA_Base_C_获取黑板_Int::CallFunc_GetEntityId_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板_Int, CallFunc_GetEntityId_ReturnValue) == 0x000030, "Member 'GA_Base_C_获取黑板_Int::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板_Int, CallFunc_GetIntValueByEntity_ReturnValue) == 0x000034, "Member 'GA_Base_C_获取黑板_Int::CallFunc_GetIntValueByEntity_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.设置黑板Int
// 0x0038 (0x0038 - 0x0000)
struct GA_Base_C_设置黑板Int final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         值;                                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc_GetEntityId_self_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_设置黑板Int) == 0x000008, "Wrong alignment on GA_Base_C_设置黑板Int");
static_assert(sizeof(GA_Base_C_设置黑板Int) == 0x000038, "Wrong size on GA_Base_C_设置黑板Int");
static_assert(offsetof(GA_Base_C_设置黑板Int, 角色) == 0x000000, "Member 'GA_Base_C_设置黑板Int::角色' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置黑板Int, key) == 0x000008, "Member 'GA_Base_C_设置黑板Int::key' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置黑板Int, 值) == 0x000018, "Member 'GA_Base_C_设置黑板Int::值' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置黑板Int, CallFunc_GetEntityId_self_CastInput) == 0x000020, "Member 'GA_Base_C_设置黑板Int::CallFunc_GetEntityId_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置黑板Int, CallFunc_GetEntityId_ReturnValue) == 0x000030, "Member 'GA_Base_C_设置黑板Int::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取黑板Long
// 0x0040 (0x0040 - 0x0000)
struct GA_Base_C_获取黑板Long final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int64                                         值;                                                // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc_GetEntityId_self_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetLongValueByEntity_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取黑板Long) == 0x000008, "Wrong alignment on GA_Base_C_获取黑板Long");
static_assert(sizeof(GA_Base_C_获取黑板Long) == 0x000040, "Wrong size on GA_Base_C_获取黑板Long");
static_assert(offsetof(GA_Base_C_获取黑板Long, 角色) == 0x000000, "Member 'GA_Base_C_获取黑板Long::角色' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板Long, key) == 0x000008, "Member 'GA_Base_C_获取黑板Long::key' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板Long, 值) == 0x000018, "Member 'GA_Base_C_获取黑板Long::值' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板Long, CallFunc_GetEntityId_self_CastInput) == 0x000020, "Member 'GA_Base_C_获取黑板Long::CallFunc_GetEntityId_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板Long, CallFunc_GetEntityId_ReturnValue) == 0x000030, "Member 'GA_Base_C_获取黑板Long::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取黑板Long, CallFunc_GetLongValueByEntity_ReturnValue) == 0x000038, "Member 'GA_Base_C_获取黑板Long::CallFunc_GetLongValueByEntity_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.设置黑板Long
// 0x0038 (0x0038 - 0x0000)
struct GA_Base_C_设置黑板Long final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int64                                         值;                                                // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc_GetEntityId_self_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_设置黑板Long) == 0x000008, "Wrong alignment on GA_Base_C_设置黑板Long");
static_assert(sizeof(GA_Base_C_设置黑板Long) == 0x000038, "Wrong size on GA_Base_C_设置黑板Long");
static_assert(offsetof(GA_Base_C_设置黑板Long, 角色) == 0x000000, "Member 'GA_Base_C_设置黑板Long::角色' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置黑板Long, key) == 0x000008, "Member 'GA_Base_C_设置黑板Long::key' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置黑板Long, 值) == 0x000018, "Member 'GA_Base_C_设置黑板Long::值' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置黑板Long, CallFunc_GetEntityId_self_CastInput) == 0x000020, "Member 'GA_Base_C_设置黑板Long::CallFunc_GetEntityId_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Base_C_设置黑板Long, CallFunc_GetEntityId_ReturnValue) == 0x000030, "Member 'GA_Base_C_设置黑板Long::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取实体ID
// 0x0028 (0x0028 - 0x0000)
struct GA_Base_C_获取实体ID final
{
public:
	class ATsBaseCharacter_C*                     对象;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         实体ID;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc_GetEntityId_self_CastInput;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Base_C_获取实体ID) == 0x000008, "Wrong alignment on GA_Base_C_获取实体ID");
static_assert(sizeof(GA_Base_C_获取实体ID) == 0x000028, "Wrong size on GA_Base_C_获取实体ID");
static_assert(offsetof(GA_Base_C_获取实体ID, 对象) == 0x000000, "Member 'GA_Base_C_获取实体ID::对象' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取实体ID, 实体ID) == 0x000008, "Member 'GA_Base_C_获取实体ID::实体ID' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取实体ID, CallFunc_GetEntityId_self_CastInput) == 0x000010, "Member 'GA_Base_C_获取实体ID::CallFunc_GetEntityId_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Base_C_获取实体ID, CallFunc_GetEntityId_ReturnValue) == 0x000020, "Member 'GA_Base_C_获取实体ID::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");

// Function GA_Base.GA_Base_C.根据实体ID获取对象
// 0x0030 (0x0030 - 0x0000)
struct GA_Base_C_根据实体ID获取对象 final
{
public:
	int32                                         实体ID;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     对象;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否找到对象;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetDynamicEntity_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Base_C_根据实体ID获取对象) == 0x000008, "Wrong alignment on GA_Base_C_根据实体ID获取对象");
static_assert(sizeof(GA_Base_C_根据实体ID获取对象) == 0x000030, "Wrong size on GA_Base_C_根据实体ID获取对象");
static_assert(offsetof(GA_Base_C_根据实体ID获取对象, 实体ID) == 0x000000, "Member 'GA_Base_C_根据实体ID获取对象::实体ID' has a wrong offset!");
static_assert(offsetof(GA_Base_C_根据实体ID获取对象, 对象) == 0x000008, "Member 'GA_Base_C_根据实体ID获取对象::对象' has a wrong offset!");
static_assert(offsetof(GA_Base_C_根据实体ID获取对象, 是否找到对象) == 0x000010, "Member 'GA_Base_C_根据实体ID获取对象::是否找到对象' has a wrong offset!");
static_assert(offsetof(GA_Base_C_根据实体ID获取对象, CallFunc_GetDynamicEntity_ReturnValue) == 0x000018, "Member 'GA_Base_C_根据实体ID获取对象::CallFunc_GetDynamicEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Base_C_根据实体ID获取对象, K2Node_DynamicCast_AsTs_Base_Character) == 0x000020, "Member 'GA_Base_C_根据实体ID获取对象::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Base_C_根据实体ID获取对象, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_Base_C_根据实体ID获取对象::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Base.GA_Base_C.获取黑板指定Key值关联对象
// 0x0038 (0x0038 - 0x0000)
struct GA_Base_C_获取黑板指定Key值关联对象 final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
