#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Bulante_FlerpCondition

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Bulante_FlerpCondition.GA_Bulante_FlerpCondition_C.ExecuteUbergraph_GA_Bulante_FlerpCondition
// 0x0068 (0x0068 - 0x0000)
struct GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0008(0x0020)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc_GetEntityId_self_CastInput;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition) == 0x000008, "Wrong alignment on GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition");
static_assert(sizeof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition) == 0x000068, "Wrong size on GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition");
static_assert(offsetof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition, EntryPoint) == 0x000000, "Member 'GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000008, "Member 'GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition, K2Node_Event_bWasCancelled) == 0x000028, "Member 'GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition, CallFunc__________) == 0x000030, "Member 'GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000038, "Member 'GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000048, "Member 'GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition, CallFunc_GetEntityId_self_CastInput) == 0x000050, "Member 'GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition::CallFunc_GetEntityId_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition, CallFunc_GetEntityId_ReturnValue) == 0x000060, "Member 'GA_Bulante_FlerpCondition_C_ExecuteUbergraph_GA_Bulante_FlerpCondition::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");

// Function GA_Bulante_FlerpCondition.GA_Bulante_FlerpCondition_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Bulante_FlerpCondition_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Bulante_FlerpCondition_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Bulante_FlerpCondition_C_K2_OnEndAbility");
static_assert(sizeof(GA_Bulante_FlerpCondition_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Bulante_FlerpCondition_C_K2_OnEndAbility");
static_assert(offsetof(GA_Bulante_FlerpCondition_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Bulante_FlerpCondition_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

