#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Destroy_Bianshen_Vision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Destroy_Bianshen_Vision.GA_Destroy_Bianshen_Vision_C
// 0x0040 (0x0598 - 0x0558)
class GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Destroy_Bianshen_Vision_C;       // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         召唤者ID;                                          // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     召唤者;                                            // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseVision_C*                       幻象BP;                                            // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                变身结束_粒子特效;                                 // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                变身结束_材质特效;                                 // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          主动结束;                                          // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         材质Handle;                                        // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          已结束;                                            // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Destroy_Bianshen_Vision(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E811964291A();
	void OnBlendOut_5D118C384AE61F1C80292E811964291A();
	void OnInterrupted_5D118C384AE61F1C80292E811964291A();
	void OnCancelled_5D118C384AE61F1C80292E811964291A();
	void OnTick_5D118C384AE61F1C80292E811964291A();
	void EventReceived_18B59F5945020DB23C42FD8800AF4B63(const struct FGameplayEventData& Payload);
	void OnCompleted_5D118C384AE61F1C80292E8138815A44();
	void OnBlendOut_5D118C384AE61F1C80292E8138815A44();
	void OnInterrupted_5D118C384AE61F1C80292E8138815A44();
	void OnCancelled_5D118C384AE61F1C80292E8138815A44();
	void OnTick_5D118C384AE61F1C80292E8138815A44();
	void Added_21071CB943CD992BF8EFD6A322DF4172(const struct FGameplayTag& Tag);
	void Added_21071CB943CD992BF8EFD6A3BE89C32B(const struct FGameplayTag& Tag);
	void EventReceived_18B59F5945020DB23C42FD886E3C9608(const struct FGameplayEventData& Payload);
	void 显示玩家模型();
	void 变身结束_碰撞关系处理();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass GA_Destroy_Bianshen_Vision.GA_Destroy_Bianshen_Vision_C", true, "GA_Destroy_Bianshen_Vision_C">();
	}
	static class GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C>();
	}
};
static_assert(alignof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C) == 0x000008, "Wrong alignment on GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C");
static_assert(sizeof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C) == 0x000598, "Wrong size on GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C");
static_assert(offsetof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C, UberGraphFrame_GA_Destroy_Bianshen_Vision_C) == 0x000558, "Member 'GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C::UberGraphFrame_GA_Destroy_Bianshen_Vision_C' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C, 召唤者ID) == 0x000560, "Member 'GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C::召唤者ID' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C, 召唤者) == 0x000568, "Member 'GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C::召唤者' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C, 幻象BP) == 0x000570, "Member 'GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C::幻象BP' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C, 变身结束_粒子特效) == 0x000578, "Member 'GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C::变身结束_粒子特效' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C, 变身结束_材质特效) == 0x000580, "Member 'GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C::变身结束_材质特效' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C, 主动结束) == 0x000588, "Member 'GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C::主动结束' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C, 材质Handle) == 0x00058C, "Member 'GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C::材质Handle' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C, 已结束) == 0x000590, "Member 'GA_Destroy_Bianshen_Vision::UGA_Destroy_Bianshen_Vision_C::已结束' has a wrong offset!");

}

