#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Destroy_Zhaohuan_Vision

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SVisionData_structs.hpp"


namespace SDK::Params
{

// Function GA_Destroy_Zhaohuan_Vision.GA_Destroy_Zhaohuan_Vision_C.ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision
// 0x0410 (0x0410 - 0x0000)
struct GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc__________;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA______________;                     // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E8(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________1;                              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc____________;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc_____ID_______;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____ID___________;                        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0178(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0248(0x0028)(ZeroConstructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID_1;                            // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummonerEntityId_ReturnValue;          // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________7;                              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc__________SpeedRatio;                      // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable;                                // 0x02E8(0x00B8)()
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_D_FindLookAtRotation_ReturnValue;         // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc________ReturnValue;                       // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision) == 0x000008, "Wrong alignment on GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision");
static_assert(sizeof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision) == 0x000410, "Wrong size on GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, EntryPoint) == 0x000000, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000058, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc__________) == 0x000088, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_GetDisplayName_ReturnValue) == 0x000090, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_GetObjectClass_ReturnValue) == 0x0000A0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000A8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_____GA______________) == 0x0000D8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_Conv_NameToString_ReturnValue) == 0x000110, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________1) == 0x000120, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc____________) == 0x000128, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_IsValid_ReturnValue_1) == 0x000131, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_DynamicCast_AsTs_Base_Character) == 0x000138, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000148, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_____ID___ID) == 0x000160, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_____ID_______) == 0x000168, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_____ID_______' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_____ID___________) == 0x000170, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_____ID___________' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_CustomEvent_Payload) == 0x000178, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000230, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________2) == 0x000238, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc______________) == 0x000240, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_IsValid_ReturnValue_2) == 0x000241, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, ___bool_IsClosed_Variable) == 0x000242, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_CreateDelegate_OutputDelegate_5) == 0x000248, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, ___bool_Has_Been_Initd_Variable) == 0x000270, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000278, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x000280, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_DynamicCast_bSuccess_1) == 0x000288, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________3) == 0x000290, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, K2Node_Event_bWasCancelled) == 0x000298, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________4) == 0x0002A0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_____ID___ID_1) == 0x0002A8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_____ID___ID_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_GetSummonerEntityId_ReturnValue) == 0x0002AC, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_GetSummonerEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________5) == 0x0002B0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_______________1) == 0x0002B8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________6) == 0x0002C0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________7) == 0x0002C8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc__________SpeedRatio) == 0x0002D0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_IsValid_ReturnValue_3) == 0x0002D4, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0002D8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_IsValid_ReturnValue_4) == 0x0002E0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, ___struct_Variable) == 0x0002E8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________8) == 0x0003A0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________9) == 0x0003A8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc___________10) == 0x0003B0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_D_K2_GetActorLocation_ReturnValue_1) == 0x0003B8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_D_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_D_FindLookAtRotation_ReturnValue) == 0x0003D0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_D_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0003DC, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_BreakRotator_Roll) == 0x0003E8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_BreakRotator_Pitch) == 0x0003EC, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_BreakRotator_Yaw) == 0x0003F0, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_BreakRotator_Roll_1) == 0x0003F4, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_BreakRotator_Pitch_1) == 0x0003F8, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_BreakRotator_Yaw_1) == 0x0003FC, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc_MakeRotator_ReturnValue) == 0x000400, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision, CallFunc________ReturnValue) == 0x00040C, "Member 'GA_Destroy_Zhaohuan_Vision_C_ExecuteUbergraph_GA_Destroy_Zhaohuan_Vision::CallFunc________ReturnValue' has a wrong offset!");

// Function GA_Destroy_Zhaohuan_Vision.GA_Destroy_Zhaohuan_Vision_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Destroy_Zhaohuan_Vision_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Destroy_Zhaohuan_Vision_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Destroy_Zhaohuan_Vision_C_K2_OnEndAbility");
static_assert(sizeof(GA_Destroy_Zhaohuan_Vision_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Destroy_Zhaohuan_Vision_C_K2_OnEndAbility");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Destroy_Zhaohuan_Vision_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Destroy_Zhaohuan_Vision.GA_Destroy_Zhaohuan_Vision_C.EventReceived_18B59F5945020DB23C42FD882782F9D4
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Destroy_Zhaohuan_Vision_C_EventReceived_18B59F5945020DB23C42FD882782F9D4 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Destroy_Zhaohuan_Vision_C_EventReceived_18B59F5945020DB23C42FD882782F9D4) == 0x000008, "Wrong alignment on GA_Destroy_Zhaohuan_Vision_C_EventReceived_18B59F5945020DB23C42FD882782F9D4");
static_assert(sizeof(GA_Destroy_Zhaohuan_Vision_C_EventReceived_18B59F5945020DB23C42FD882782F9D4) == 0x0000B8, "Wrong size on GA_Destroy_Zhaohuan_Vision_C_EventReceived_18B59F5945020DB23C42FD882782F9D4");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_EventReceived_18B59F5945020DB23C42FD882782F9D4, Payload) == 0x000000, "Member 'GA_Destroy_Zhaohuan_Vision_C_EventReceived_18B59F5945020DB23C42FD882782F9D4::Payload' has a wrong offset!");

// Function GA_Destroy_Zhaohuan_Vision.GA_Destroy_Zhaohuan_Vision_C.初始化参数
// 0x0030 (0x0030 - 0x0000)
struct GA_Destroy_Zhaohuan_Vision_C_初始化参数 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID_1;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID_2;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID_3;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Destroy_Zhaohuan_Vision_C_初始化参数) == 0x000008, "Wrong alignment on GA_Destroy_Zhaohuan_Vision_C_初始化参数");
static_assert(sizeof(GA_Destroy_Zhaohuan_Vision_C_初始化参数) == 0x000030, "Wrong size on GA_Destroy_Zhaohuan_Vision_C_初始化参数");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_初始化参数, CallFunc__________) == 0x000000, "Member 'GA_Destroy_Zhaohuan_Vision_C_初始化参数::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_初始化参数, CallFunc___________1) == 0x000008, "Member 'GA_Destroy_Zhaohuan_Vision_C_初始化参数::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_初始化参数, CallFunc_____ID___ID) == 0x000010, "Member 'GA_Destroy_Zhaohuan_Vision_C_初始化参数::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_初始化参数, CallFunc_____ID___ID_1) == 0x000014, "Member 'GA_Destroy_Zhaohuan_Vision_C_初始化参数::CallFunc_____ID___ID_1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_初始化参数, CallFunc___________2) == 0x000018, "Member 'GA_Destroy_Zhaohuan_Vision_C_初始化参数::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_初始化参数, CallFunc___________3) == 0x000020, "Member 'GA_Destroy_Zhaohuan_Vision_C_初始化参数::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_初始化参数, CallFunc_____ID___ID_2) == 0x000028, "Member 'GA_Destroy_Zhaohuan_Vision_C_初始化参数::CallFunc_____ID___ID_2' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_初始化参数, CallFunc_____ID___ID_3) == 0x00002C, "Member 'GA_Destroy_Zhaohuan_Vision_C_初始化参数::CallFunc_____ID___ID_3' has a wrong offset!");

// Function GA_Destroy_Zhaohuan_Vision.GA_Destroy_Zhaohuan_Vision_C.获取幻象数据
// 0x0170 (0x0170 - 0x0000)
struct GA_Destroy_Zhaohuan_Vision_C_获取幻象数据 final
{
public:
	class ATsBaseCharacter_C*                     entity;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否找到;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSVisionData                           输出行;                                            // 0x0010(0x0098)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_GetIntValueByEntityWithCharacter_ReturnValue; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSVisionData                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x00D0(0x0098)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据) == 0x000008, "Wrong alignment on GA_Destroy_Zhaohuan_Vision_C_获取幻象数据");
static_assert(sizeof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据) == 0x000170, "Wrong size on GA_Destroy_Zhaohuan_Vision_C_获取幻象数据");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据, entity) == 0x000000, "Member 'GA_Destroy_Zhaohuan_Vision_C_获取幻象数据::entity' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据, 是否找到) == 0x000008, "Member 'GA_Destroy_Zhaohuan_Vision_C_获取幻象数据::是否找到' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据, 输出行) == 0x000010, "Member 'GA_Destroy_Zhaohuan_Vision_C_获取幻象数据::输出行' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据, CallFunc_GetIntValueByEntityWithCharacter_ReturnValue) == 0x0000A8, "Member 'GA_Destroy_Zhaohuan_Vision_C_获取幻象数据::CallFunc_GetIntValueByEntityWithCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据, CallFunc_Conv_IntToString_ReturnValue) == 0x0000B0, "Member 'GA_Destroy_Zhaohuan_Vision_C_获取幻象数据::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据, CallFunc_Conv_StringToName_ReturnValue) == 0x0000C0, "Member 'GA_Destroy_Zhaohuan_Vision_C_获取幻象数据::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000D0, "Member 'GA_Destroy_Zhaohuan_Vision_C_获取幻象数据::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_获取幻象数据, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'GA_Destroy_Zhaohuan_Vision_C_获取幻象数据::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function GA_Destroy_Zhaohuan_Vision.GA_Destroy_Zhaohuan_Vision_C.结束召唤状态
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Destroy_Zhaohuan_Vision_C_结束召唤状态 final
{
public:
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_____GA______________;                     // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_D_GetScaledCapsuleHalfHeight_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_MakeVectorDouble_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue;          // 0x0060(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_CreateBulletFromGA_ReturnValue;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态) == 0x000010, "Wrong alignment on GA_Destroy_Zhaohuan_Vision_C_结束召唤状态");
static_assert(sizeof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态) == 0x0000B0, "Wrong size on GA_Destroy_Zhaohuan_Vision_C_结束召唤状态");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc__________) == 0x000000, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc___________1) == 0x000008, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc_____ID___ID) == 0x000010, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc___________2) == 0x000018, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc_____GA______________) == 0x000020, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc___________3) == 0x000030, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc_D_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000038, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc_D_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc_MakeVectorDouble_ReturnValue) == 0x000040, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc_MakeVectorDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc_MakeTransformDouble_ReturnValue) == 0x000060, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc_MakeTransformDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_结束召唤状态, CallFunc_CreateBulletFromGA_ReturnValue) == 0x0000A0, "Member 'GA_Destroy_Zhaohuan_Vision_C_结束召唤状态::CallFunc_CreateBulletFromGA_ReturnValue' has a wrong offset!");

// Function GA_Destroy_Zhaohuan_Vision.GA_Destroy_Zhaohuan_Vision_C.清理伴生物
// 0x0038 (0x0038 - 0x0000)
struct GA_Destroy_Zhaohuan_Vision_C_清理伴生物 final
{
public:
	bool                                          ___bool_Variable;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCustomEntityId_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEntityEnable_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc_____ID_______;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____ID___________;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddMaterialControllerDataGroup_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Destroy_Zhaohuan_Vision_C_清理伴生物) == 0x000008, "Wrong alignment on GA_Destroy_Zhaohuan_Vision_C_清理伴生物");
static_assert(sizeof(GA_Destroy_Zhaohuan_Vision_C_清理伴生物) == 0x000038, "Wrong size on GA_Destroy_Zhaohuan_Vision_C_清理伴生物");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_清理伴生物, ___bool_Variable) == 0x000000, "Member 'GA_Destroy_Zhaohuan_Vision_C_清理伴生物::___bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_清理伴生物, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'GA_Destroy_Zhaohuan_Vision_C_清理伴生物::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Destroy_Zhaohuan_Vision_C_清理伴生物, ___int_Variable) == 0x000004, "Member 'GA_Destroy_Zhaohuan_Vision_C_清理伴生物::___int_Variable' has a wrong offset!");
