#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_QTE_Zhezhi

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_QTE_Zhezhi.GA_QTE_Zhezhi_C
// 0x0028 (0x0580 - 0x0558)
class UGA_QTE_Zhezhi_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_QTE_Zhezhi_C;                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_QTE_Camera_C*                       QTECamera;                                         // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Entity_Id;                                         // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   技能_ID;                                           // 0x056C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Qte_Type;                                          // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_QTE_Zhezhi(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E81936B7564();
	void OnBlendOut_5D118C384AE61F1C80292E81936B7564();
	void OnInterrupted_5D118C384AE61F1C80292E81936B7564();
	void OnCancelled_5D118C384AE61F1C80292E81936B7564();
	void OnTick_5D118C384AE61F1C80292E81936B7564();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_QTE_Zhezhi_C">();
	}
	static class UGA_QTE_Zhezhi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_QTE_Zhezhi_C>();
	}
};
static_assert(alignof(UGA_QTE_Zhezhi_C) == 0x000008, "Wrong alignment on UGA_QTE_Zhezhi_C");
static_assert(sizeof(UGA_QTE_Zhezhi_C) == 0x000580, "Wrong size on UGA_QTE_Zhezhi_C");
static_assert(offsetof(UGA_QTE_Zhezhi_C, UberGraphFrame_GA_QTE_Zhezhi_C) == 0x000558, "Member 'UGA_QTE_Zhezhi_C::UberGraphFrame_GA_QTE_Zhezhi_C' has a wrong offset!");
static_assert(offsetof(UGA_QTE_Zhezhi_C, QTECamera) == 0x000560, "Member 'UGA_QTE_Zhezhi_C::QTECamera' has a wrong offset!");
static_assert(offsetof(UGA_QTE_Zhezhi_C, Entity_Id) == 0x000568, "Member 'UGA_QTE_Zhezhi_C::Entity_Id' has a wrong offset!");
static_assert(offsetof(UGA_QTE_Zhezhi_C, 技能_ID) == 0x00056C, "Member 'UGA_QTE_Zhezhi_C::技能_ID' has a wrong offset!");
static_assert(offsetof(UGA_QTE_Zhezhi_C, Qte_Type) == 0x000578, "Member 'UGA_QTE_Zhezhi_C::Qte_Type' has a wrong offset!");

}

