#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Qunnie_Role

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Qunnie_Role.GA_Qunnie_Role_C
// 0x0018 (0x0570 - 0x0558)
class UGA_Qunnie_Role_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Qunnie_Role_C;                   // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_BaseVision_C*                       幻象;                                              // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     召唤角色;                                          // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Qunnie_Role(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E813CFD910C();
	void OnBlendOut_5D118C384AE61F1C80292E813CFD910C();
	void OnInterrupted_5D118C384AE61F1C80292E813CFD910C();
	void OnCancelled_5D118C384AE61F1C80292E813CFD910C();
	void OnTick_5D118C384AE61F1C80292E813CFD910C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Qunnie_Role_C">();
	}
	static class UGA_Qunnie_Role_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Qunnie_Role_C>();
	}
};
static_assert(alignof(UGA_Qunnie_Role_C) == 0x000008, "Wrong alignment on UGA_Qunnie_Role_C");
static_assert(sizeof(UGA_Qunnie_Role_C) == 0x000570, "Wrong size on UGA_Qunnie_Role_C");
static_assert(offsetof(UGA_Qunnie_Role_C, UberGraphFrame_GA_Qunnie_Role_C) == 0x000558, "Member 'UGA_Qunnie_Role_C::UberGraphFrame_GA_Qunnie_Role_C' has a wrong offset!");
static_assert(offsetof(UGA_Qunnie_Role_C, 幻象) == 0x000560, "Member 'UGA_Qunnie_Role_C::幻象' has a wrong offset!");
static_assert(offsetof(UGA_Qunnie_Role_C, 召唤角色) == 0x000568, "Member 'UGA_Qunnie_Role_C::召唤角色' has a wrong offset!");

}

