#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Role_Move_F_Net

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Role_Move_F_Net.GA_Role_Move_F_Net_C.ExecuteUbergraph_GA_Role_Move_F_Net
// 0x02B8 (0x02B8 - 0x0000)
struct GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0088(0x0028)(ZeroConstructor)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C8(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________1;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ___struct_Variable;                                // 0x012C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x0138(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA______________;                     // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_5;          // 0x0168(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________2;                              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x01B8(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag)> K2Node_CreateDelegate_OutputDelegate_6;          // 0x01D0(0x0028)(ZeroConstructor)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x01F8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0218(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsKeyDown_ReturnValue;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ___struct_Variable_1;                              // 0x027C(0x000C)(NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio;                      // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc________;                                  // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net) == 0x000008, "Wrong alignment on GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net");
static_assert(sizeof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net) == 0x0002B8, "Wrong size on GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, EntryPoint) == 0x000000, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc__________) == 0x000008, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0000B0, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_DynamicCast_AsTs_Base_Character) == 0x0000B8, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C8, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000F0, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc___________1) == 0x0000F8, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000100, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_GetDisplayName_ReturnValue) == 0x000108, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_GetObjectClass_ReturnValue) == 0x000120, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000128, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, ___struct_Variable) == 0x00012C, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_CustomEvent_Tag) == 0x000138, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_____GA______________) == 0x000148, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_Conv_NameToString_ReturnValue) == 0x000158, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_CreateDelegate_OutputDelegate_5) == 0x000168, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc___________2) == 0x000190, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_IsValid_ReturnValue_1) == 0x000198, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x0001A0, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_IsValid_ReturnValue_2) == 0x0001A8, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc___________3) == 0x0001B0, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_CustomEvent_Tag_1) == 0x0001B8, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc______________) == 0x0001C4, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc___________4) == 0x0001C8, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001D0, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0001F8, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000218, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000238, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000248, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000250, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000260, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, K2Node_Event_bWasCancelled) == 0x000261, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc___________5) == 0x000268, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc___________6) == 0x000270, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_______________1) == 0x000278, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_IsKeyDown_ReturnValue) == 0x000279, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_IsKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, ___struct_Variable_1) == 0x00027C, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc___________7) == 0x000288, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_______________2) == 0x000290, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc__________SpeedRatio) == 0x000294, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000298, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc_IsValid_ReturnValue_3) == 0x0002A0, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc___________8) == 0x0002A8, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net, CallFunc________) == 0x0002B0, "Member 'GA_Role_Move_F_Net_C_ExecuteUbergraph_GA_Role_Move_F_Net::CallFunc________' has a wrong offset!");

// Function GA_Role_Move_F_Net.GA_Role_Move_F_Net_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Role_Move_F_Net_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Role_Move_F_Net_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Role_Move_F_Net_C_K2_OnEndAbility");
static_assert(sizeof(GA_Role_Move_F_Net_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Role_Move_F_Net_C_K2_OnEndAbility");
static_assert(offsetof(GA_Role_Move_F_Net_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Role_Move_F_Net_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Role_Move_F_Net.GA_Role_Move_F_Net_C.Added_21071CB943CD992BF8EFD6A3BEA09874
// 0x000C (0x000C - 0x0000)
struct GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3BEA09874 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3BEA09874) == 0x000004, "Wrong alignment on GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3BEA09874");
static_assert(sizeof(GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3BEA09874) == 0x00000C, "Wrong size on GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3BEA09874");
static_assert(offsetof(GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3BEA09874, Tag) == 0x000000, "Member 'GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3BEA09874::Tag' has a wrong offset!");

// Function GA_Role_Move_F_Net.GA_Role_Move_F_Net_C.Added_21071CB943CD992BF8EFD6A3C134420E
// 0x000C (0x000C - 0x0000)
struct GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3C134420E final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3C134420E) == 0x000004, "Wrong alignment on GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3C134420E");
static_assert(sizeof(GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3C134420E) == 0x00000C, "Wrong size on GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3C134420E");
static_assert(offsetof(GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3C134420E, Tag) == 0x000000, "Member 'GA_Role_Move_F_Net_C_Added_21071CB943CD992BF8EFD6A3C134420E::Tag' has a wrong offset!");

// Function GA_Role_Move_F_Net.GA_Role_Move_F_Net_C.K2_CanActivateAbility
// 0x00C8 (0x00C8 - 0x0000)
struct GA_Role_Move_F_Net_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_K2_CanActivateAbility_RelevantTags;       // 0x0078(0x0020)()
	bool                                          CallFunc_K2_CanActivateAbility_ReturnValue;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagCount_ReturnValue;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Role_Move_F_Net_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Role_Move_F_Net_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Role_Move_F_Net_C_K2_CanActivateAbility) == 0x0000C8, "Wrong size on GA_Role_Move_F_Net_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Role_Move_F_Net_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Role_Move_F_Net_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_Role_Move_F_Net_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Role_Move_F_Net_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_Role_Move_F_Net_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
