#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Role_Bianshen_Level_Youyidie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SVisionData_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Role_Bianshen_Level_Youyidie.GA_Role_Bianshen_Level_Youyidie_C.ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie
// 0x0550 (0x0550 - 0x0000)
struct GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A8(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00D0(0x0028)(ZeroConstructor)
	TDelegate<void(int32 实体ID, class AActor* Entity)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00F8(0x0028)(ZeroConstructor)
	int32                                         CallFunc_GetIntValueByEntityWithCharacter_ReturnValue; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc__________;                                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue_1;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0148(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________1;                              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0178(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA______________;                     // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x01D0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CallFunc_D_GetTransform_ReturnValue;               // 0x0210(0x0040)(IsPlainOldData, NoDestructor)
	struct FGameplayTag                           ___struct_Variable;                                // 0x0250(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc___________2;                              // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0260(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________3;                              // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x02C0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________1;                   // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ___struct_Variable_1;                              // 0x0314(0x000C)(NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc___________5;                              // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________6;                              // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x035C(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc___________8;                              // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayTag& Tag)>     K2Node_CreateDelegate_OutputDelegate_12;           // 0x0380(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x03B8(0x0040)(HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0400(0x0010)(ReferenceParm)
	bool                                          CallFunc_______________1;                          // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0418(0x0018)()
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc___________11;                             // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43A[0x2];                                      // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio;                      // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________12;                             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0458(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________13;                             // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc___________14;                             // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________15;                             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________16;                             // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_______________3;                          // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48A[0x2];                                      // 0x048A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_1;                    // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc________Entity_CastInput;                  // 0x04A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc________Entity_CastInput_1;                // 0x04B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc________Entity_CastInput_2;                // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TDelegate<void(struct FGameplayTag& Tag)>     K2Node_CreateDelegate_OutputDelegate_13;           // 0x04D0(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________17;                             // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EventManager_C*                     CallFunc________________;                          // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent___ID;                           // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Entity;                         // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_GetServerIdByEntityId_ReturnValue;        // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________18;                             // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_____ID___ID;                              // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_________Id________;                       // 0x0530(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_SummonRequest_ReturnValue;                // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie) == 0x000010, "Wrong alignment on GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie");
static_assert(sizeof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie) == 0x000550, "Wrong size on GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, EntryPoint) == 0x000000, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000D0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000F8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_GetIntValueByEntityWithCharacter_ReturnValue) == 0x000120, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_GetIntValueByEntityWithCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_Conv_IntToBool_ReturnValue) == 0x000124, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_ContainsTag_ReturnValue) == 0x000125, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc__________) == 0x000128, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_ContainsTag_ReturnValue_1) == 0x000130, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_ContainsTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_Conv_NameToString_ReturnValue) == 0x000138, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_7) == 0x000148, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________1) == 0x000170, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_8) == 0x000178, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_IsValid_ReturnValue_1) == 0x0001A0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0001A8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_IsValid_ReturnValue_2) == 0x0001B0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_____GA______________) == 0x0001B8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_Event_bWasCancelled) == 0x0001C8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001D0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0001F8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_D_GetTransform_ReturnValue) == 0x000210, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_D_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, ___struct_Variable) == 0x000250, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________2) == 0x00025C, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_10) == 0x000260, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________3) == 0x000288, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_GetDisplayName_ReturnValue) == 0x000290, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_GetObjectClass_ReturnValue) == 0x0002A0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0002A8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0002AC, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_WaitDelay_ReturnValue) == 0x0002B0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_IsValid_ReturnValue_3) == 0x0002B8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_11) == 0x0002C0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_____GA_______________1) == 0x0002E8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0002F8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000300, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_DynamicCast_AsTs_Base_Character) == 0x000308, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_DynamicCast_bSuccess) == 0x000310, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_IsValid_ReturnValue_4) == 0x000311, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, ___struct_Variable_1) == 0x000314, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________4) == 0x000320, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc______________) == 0x000328, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________5) == 0x000329, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________6) == 0x000330, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000338, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_GetDisplayName_ReturnValue_1) == 0x000340, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_GetObjectClass_ReturnValue_1) == 0x000350, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000358, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CustomEvent_Tag) == 0x00035C, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________7) == 0x000368, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________8) == 0x000370, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000378, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_12) == 0x000380, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x0003A8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_DynamicCast_bSuccess_1) == 0x0003B0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_MakeStruct_FormatArgumentData) == 0x0003B8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________9) == 0x0003F8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_MakeArray_Array) == 0x000400, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_______________1) == 0x000410, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_Format_ReturnValue) == 0x000418, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________10) == 0x000430, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_______________2) == 0x000438, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________11) == 0x000439, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc__________SpeedRatio) == 0x00043C, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000440, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_IsValid_ReturnValue_5) == 0x000448, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________12) == 0x000450, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CustomEvent_Tag_1) == 0x000458, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________13) == 0x000468, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_IsValid_ReturnValue_6) == 0x000470, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________14) == 0x000471, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________15) == 0x000478, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________15' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________16) == 0x000480, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________16' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_IsValid_ReturnValue_7) == 0x000488, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_______________3) == 0x000489, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc__________SpeedRatio_1) == 0x00048C, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000490, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_IsValid_ReturnValue_8) == 0x000498, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc________Entity_CastInput) == 0x0004A0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc________Entity_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc________Entity_CastInput_1) == 0x0004B0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc________Entity_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc________Entity_CastInput_2) == 0x0004C0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc________Entity_CastInput_2' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CreateDelegate_OutputDelegate_13) == 0x0004D0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________17) == 0x0004F8, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________17' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc________________) == 0x000500, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc________________' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CustomEvent___ID) == 0x000508, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CustomEvent___ID' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, K2Node_CustomEvent_Entity) == 0x000510, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::K2Node_CustomEvent_Entity' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_GetServerIdByEntityId_ReturnValue) == 0x000518, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_GetServerIdByEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc___________18) == 0x000520, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc___________18' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x000528, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_____ID___ID) == 0x00052C, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_________Id________) == 0x000530, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_________Id________' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_Conv_StringToInt_ReturnValue) == 0x000540, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie, CallFunc_SummonRequest_ReturnValue) == 0x000548, "Member 'GA_Role_Bianshen_Level_Youyidie_C_ExecuteUbergraph_GA_Role_Bianshen_Level_Youyidie::CallFunc_SummonRequest_ReturnValue' has a wrong offset!");

// Function GA_Role_Bianshen_Level_Youyidie.GA_Role_Bianshen_Level_Youyidie_C.当新增加实体
// 0x0010 (0x0010 - 0x0000)
struct GA_Role_Bianshen_Level_Youyidie_C_当新增加实体 final
{
public:
	int32                                         实体ID;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Entity;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Role_Bianshen_Level_Youyidie_C_当新增加实体) == 0x000008, "Wrong alignment on GA_Role_Bianshen_Level_Youyidie_C_当新增加实体");
static_assert(sizeof(GA_Role_Bianshen_Level_Youyidie_C_当新增加实体) == 0x000010, "Wrong size on GA_Role_Bianshen_Level_Youyidie_C_当新增加实体");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_当新增加实体, 实体ID) == 0x000000, "Member 'GA_Role_Bianshen_Level_Youyidie_C_当新增加实体::实体ID' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_当新增加实体, Entity) == 0x000008, "Member 'GA_Role_Bianshen_Level_Youyidie_C_当新增加实体::Entity' has a wrong offset!");

// Function GA_Role_Bianshen_Level_Youyidie.GA_Role_Bianshen_Level_Youyidie_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Role_Bianshen_Level_Youyidie_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Role_Bianshen_Level_Youyidie_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Role_Bianshen_Level_Youyidie_C_K2_OnEndAbility");
static_assert(sizeof(GA_Role_Bianshen_Level_Youyidie_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Role_Bianshen_Level_Youyidie_C_K2_OnEndAbility");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Role_Bianshen_Level_Youyidie_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Role_Bianshen_Level_Youyidie.GA_Role_Bianshen_Level_Youyidie_C.Removed_34F9BAE944891AC1C495D9AB9F1436CD
// 0x000C (0x000C - 0x0000)
struct GA_Role_Bianshen_Level_Youyidie_C_Removed_34F9BAE944891AC1C495D9AB9F1436CD final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Role_Bianshen_Level_Youyidie_C_Removed_34F9BAE944891AC1C495D9AB9F1436CD) == 0x000004, "Wrong alignment on GA_Role_Bianshen_Level_Youyidie_C_Removed_34F9BAE944891AC1C495D9AB9F1436CD");
static_assert(sizeof(GA_Role_Bianshen_Level_Youyidie_C_Removed_34F9BAE944891AC1C495D9AB9F1436CD) == 0x00000C, "Wrong size on GA_Role_Bianshen_Level_Youyidie_C_Removed_34F9BAE944891AC1C495D9AB9F1436CD");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_Removed_34F9BAE944891AC1C495D9AB9F1436CD, Tag) == 0x000000, "Member 'GA_Role_Bianshen_Level_Youyidie_C_Removed_34F9BAE944891AC1C495D9AB9F1436CD::Tag' has a wrong offset!");

// Function GA_Role_Bianshen_Level_Youyidie.GA_Role_Bianshen_Level_Youyidie_C.Added_21071CB943CD992BF8EFD6A3C3F21C2A
// 0x000C (0x000C - 0x0000)
struct GA_Role_Bianshen_Level_Youyidie_C_Added_21071CB943CD992BF8EFD6A3C3F21C2A final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Role_Bianshen_Level_Youyidie_C_Added_21071CB943CD992BF8EFD6A3C3F21C2A) == 0x000004, "Wrong alignment on GA_Role_Bianshen_Level_Youyidie_C_Added_21071CB943CD992BF8EFD6A3C3F21C2A");
static_assert(sizeof(GA_Role_Bianshen_Level_Youyidie_C_Added_21071CB943CD992BF8EFD6A3C3F21C2A) == 0x00000C, "Wrong size on GA_Role_Bianshen_Level_Youyidie_C_Added_21071CB943CD992BF8EFD6A3C3F21C2A");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_Added_21071CB943CD992BF8EFD6A3C3F21C2A, Tag) == 0x000000, "Member 'GA_Role_Bianshen_Level_Youyidie_C_Added_21071CB943CD992BF8EFD6A3C3F21C2A::Tag' has a wrong offset!");

// Function GA_Role_Bianshen_Level_Youyidie.GA_Role_Bianshen_Level_Youyidie_C.获取幻象数据
// 0x01F8 (0x01F8 - 0x0000)
struct GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据 final
{
public:
	int32                                         幻象ID_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSVisionData                           幻象数据_0;                                        // 0x0008(0x0098)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FSVisionData                           找到的幻象数据;                                    // 0x00A0(0x0098)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSVisionData                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0158(0x0098)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据) == 0x000008, "Wrong alignment on GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据");
static_assert(sizeof(GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据) == 0x0001F8, "Wrong size on GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据, 幻象ID_0) == 0x000000, "Member 'GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据::幻象ID_0' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据, 幻象数据_0) == 0x000008, "Member 'GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据::幻象数据_0' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据, 找到的幻象数据) == 0x0000A0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据::找到的幻象数据' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据, CallFunc_Conv_IntToString_ReturnValue) == 0x000138, "Member 'GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据, CallFunc_Conv_StringToName_ReturnValue) == 0x000148, "Member 'GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据, CallFunc_GetDataTableRowFromName_OutRow) == 0x000158, "Member 'GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001F0, "Member 'GA_Role_Bianshen_Level_Youyidie_C_获取幻象数据::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function GA_Role_Bianshen_Level_Youyidie.GA_Role_Bianshen_Level_Youyidie_C.计算施法技能ID
// 0x0038 (0x0038 - 0x0000)
struct GA_Role_Bianshen_Level_Youyidie_C_计算施法技能ID final
{
public:
	int32                                         技能序号;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   计算结果;                                          // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
