#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_VisionCoordination

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_VisionCoordination.GA_VisionCoordination_C
// 0x0020 (0x0578 - 0x0558)
class UGA_VisionCoordination_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_VisionCoordination_C;            // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UObject*                                变身结束_材质特效;                                 // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_VisionLocalVariables_C*             幻象坐标;                                          // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         召唤者实体ID;                                      // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_VisionCoordination(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E81C0F7E796();
	void OnBlendOut_5D118C384AE61F1C80292E81C0F7E796();
	void OnInterrupted_5D118C384AE61F1C80292E81C0F7E796();
	void OnCancelled_5D118C384AE61F1C80292E81C0F7E796();
	void OnTick_5D118C384AE61F1C80292E81C0F7E796();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_VisionCoordination_C">();
	}
	static class UGA_VisionCoordination_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_VisionCoordination_C>();
	}
};
static_assert(alignof(UGA_VisionCoordination_C) == 0x000008, "Wrong alignment on UGA_VisionCoordination_C");
static_assert(sizeof(UGA_VisionCoordination_C) == 0x000578, "Wrong size on UGA_VisionCoordination_C");
static_assert(offsetof(UGA_VisionCoordination_C, UberGraphFrame_GA_VisionCoordination_C) == 0x000558, "Member 'UGA_VisionCoordination_C::UberGraphFrame_GA_VisionCoordination_C' has a wrong offset!");
static_assert(offsetof(UGA_VisionCoordination_C, 变身结束_材质特效) == 0x000560, "Member 'UGA_VisionCoordination_C::变身结束_材质特效' has a wrong offset!");
static_assert(offsetof(UGA_VisionCoordination_C, 幻象坐标) == 0x000568, "Member 'UGA_VisionCoordination_C::幻象坐标' has a wrong offset!");
static_assert(offsetof(UGA_VisionCoordination_C, 召唤者实体ID) == 0x000570, "Member 'UGA_VisionCoordination_C::召唤者实体ID' has a wrong offset!");

}

