#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Vision_ShowTime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SVisionData_structs.hpp"


namespace SDK::Params
{

// Function GA_Vision_ShowTime.GA_Vision_ShowTime_C.ExecuteUbergraph_GA_Vision_ShowTime
// 0x0570 (0x0570 - 0x0000)
struct GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable;                                // 0x0008(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 材质ID)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0028)(ZeroConstructor)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTag_ReturnValue_1;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0100(0x00B8)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc__________;                                // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01C0(0x0028)(ZeroConstructor)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CallFunc_D_GetTransform_ReturnValue;               // 0x0200(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_________ReturnValue;                      // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA______________;                     // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseVision_C*                       K2Node_DynamicCast_AsBP_Base_Vision;               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_D_GetScaledCapsuleHalfHeight_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_MakeVectorDouble_ReturnValue;             // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue;          // 0x0290(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_____ID___ID;                              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateBulletFromGA_ReturnValue;           // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformDouble                       CallFunc_D_GetTransform_ReturnValue_1;             // 0x0320(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddMaterialControllerDataGroup_ReturnValue; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_________ReturnValue_1;                    // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EventManager_C*                     CallFunc________________;                          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent___ID;                           // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddMaterialControllerDataGroup_ReturnValue_1; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, bool>                             CallFunc_GetFormationAllEntityId_ReturnValue;      // 0x03B0(0x0050)()
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x0400(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc_____ID_______;                            // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____ID___________;                        // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43B[0x5];                                      // 0x043B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_D_Vector_Distance_ReturnValue;            // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue;           // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEntityEnable_ReturnValue;              // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x046D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46E[0x2];                                      // 0x046E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x047B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x047D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x047E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x047F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_482[0x6];                                      // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSVisionData                           CallFunc____________;                              // 0x0488(0x0098)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc_____________1;                            // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0530(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54A[0x6];                                      // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Vision_MB1Fuludelisi_C*             K2Node_DynamicCast_AsBP_Vision_MB1Fuludelisi;      // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A[0x6];                                      // 0x055A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Vision_MB1Fuludelisi_C*             K2Node_DynamicCast_AsBP_Vision_MB1Fuludelisi_1;    // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime) == 0x000010, "Wrong alignment on GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime");
static_assert(sizeof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime) == 0x000570, "Wrong size on GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, EntryPoint) == 0x000000, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___struct_Variable) == 0x000008, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_ContainsTag_ReturnValue) == 0x0000F0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000F1, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___int_Array_Index_Variable) == 0x0000F4, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_IsValid_ReturnValue_1) == 0x0000F8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_ContainsTag_ReturnValue_1) == 0x0000F9, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_ContainsTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___bool_IsClosed_Variable) == 0x0000FA, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_CustomEvent_Payload) == 0x000100, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_Event_bWasCancelled) == 0x0001B8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc__________) == 0x0001B9, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001C0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___int_Loop_Counter_Variable) == 0x0001E8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Add_IntInt_ReturnValue) == 0x0001EC, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________1) == 0x0001F0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_GetTransform_ReturnValue) == 0x000200, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_________ReturnValue) == 0x000240, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_________ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____GA______________) == 0x000248, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________2) == 0x000258, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_AsBP_Base_Vision) == 0x000260, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_AsBP_Base_Vision' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_bSuccess) == 0x000268, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000270, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_MakeVectorDouble_ReturnValue) == 0x000278, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_MakeVectorDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_MakeTransformDouble_ReturnValue) == 0x000290, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_MakeTransformDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____ID___ID) == 0x0002D0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_CreateBulletFromGA_ReturnValue) == 0x0002D4, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_CreateBulletFromGA_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_IntToString_ReturnValue) == 0x0002D8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0002E8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________3) == 0x0002F8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________4) == 0x000300, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________5) == 0x000308, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________6) == 0x000310, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_GetTransform_ReturnValue_1) == 0x000320, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_AddMaterialControllerDataGroup_ReturnValue) == 0x000360, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_AddMaterialControllerDataGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_________ReturnValue_1) == 0x000364, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_________ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc________________) == 0x000368, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc________________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_CustomEvent___ID) == 0x000370, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_CustomEvent___ID' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000374, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________7) == 0x000378, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________8) == 0x000380, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000388, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________9) == 0x000398, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_AddMaterialControllerDataGroup_ReturnValue_1) == 0x0003A0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_AddMaterialControllerDataGroup_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________10) == 0x0003A8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_GetFormationAllEntityId_ReturnValue) == 0x0003B0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_GetFormationAllEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Map_Keys_Keys) == 0x000400, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Array_Get_Item) == 0x000410, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000418, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____ID_______) == 0x000430, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____ID_______' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____ID___________) == 0x000438, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____ID___________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Map_Find_Value) == 0x000439, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Map_Find_ReturnValue) == 0x00043A, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_K2_GetActorLocation_ReturnValue_1) == 0x000440, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_Vector_Distance_ReturnValue) == 0x000458, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_DoubleToFloat_ReturnValue) == 0x000460, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_DoubleToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_GetEntityEnable_ReturnValue) == 0x000464, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_GetEntityEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Array_Length_ReturnValue) == 0x000468, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Less_IntInt_ReturnValue) == 0x00046C, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Less_FloatFloat_ReturnValue) == 0x00046D, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________11) == 0x000470, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_IsValid_ReturnValue_2) == 0x000478, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000479, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00047A, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x00047B, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x00047C, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x00047D, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x00047E, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_BooleanOR_ReturnValue) == 0x00047F, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_BooleanOR_ReturnValue_1) == 0x000480, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_BooleanOR_ReturnValue_2) == 0x000481, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc____________) == 0x000488, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_BooleanOR_ReturnValue_3) == 0x000520, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____________1) == 0x000528, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____________1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000530, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000540, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_IsValid_ReturnValue_3) == 0x000548, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___bool_Has_Been_Initd_Variable) == 0x000549, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_AsBP_Vision_MB1Fuludelisi) == 0x000550, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_AsBP_Vision_MB1Fuludelisi' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_bSuccess_1) == 0x000558, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_8) == 0x000559, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_AsBP_Vision_MB1Fuludelisi_1) == 0x000560, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_AsBP_Vision_MB1Fuludelisi_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_bSuccess_2) == 0x000568, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function GA_Vision_ShowTime.GA_Vision_ShowTime_C.材质结束
// 0x0004 (0x0004 - 0x0000)
struct GA_Vision_ShowTime_C_材质结束 final
{
public:
	int32                                         材质ID;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Vision_ShowTime_C_材质结束) == 0x000004, "Wrong alignment on GA_Vision_ShowTime_C_材质结束");
static_assert(sizeof(GA_Vision_ShowTime_C_材质结束) == 0x000004, "Wrong size on GA_Vision_ShowTime_C_材质结束");
static_assert(offsetof(GA_Vision_ShowTime_C_材质结束, 材质ID) == 0x000000, "Member 'GA_Vision_ShowTime_C_材质结束::材质ID' has a wrong offset!");

// Function GA_Vision_ShowTime.GA_Vision_ShowTime_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Vision_ShowTime_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Vision_ShowTime_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Vision_ShowTime_C_K2_OnEndAbility");
static_assert(sizeof(GA_Vision_ShowTime_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Vision_ShowTime_C_K2_OnEndAbility");
static_assert(offsetof(GA_Vision_ShowTime_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Vision_ShowTime_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Vision_ShowTime.GA_Vision_ShowTime_C.EventReceived_18B59F5945020DB23C42FD88A68D9368
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368) == 0x000008, "Wrong alignment on GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368");
static_assert(sizeof(GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368) == 0x0000B8, "Wrong size on GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368");
static_assert(offsetof(GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368, Payload) == 0x000000, "Member 'GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368::Payload' has a wrong offset!");

}

