#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Vision_ShowTime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SVisionData_structs.hpp"


namespace SDK::Params
{

// Function GA_Vision_ShowTime.GA_Vision_ShowTime_C.ExecuteUbergraph_GA_Vision_ShowTime
// 0x0550 (0x0550 - 0x0000)
struct GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable;                                // 0x0008(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 材质ID)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0028)(ZeroConstructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0100(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B8(0x0028)(ZeroConstructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc__________;                                // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_D_GetTransform_ReturnValue;               // 0x01F0(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_________ReturnValue;                      // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA______________;                     // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseVision_C*                       K2Node_DynamicCast_AsBP_Base_Vision;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_D_GetScaledCapsuleHalfHeight_ReturnValue; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_MakeVectorDouble_ReturnValue;             // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_MakeTransformDouble_ReturnValue;          // 0x0280(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_____ID___ID;                              // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateBulletFromGA_ReturnValue;           // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransformDouble                       CallFunc_D_GetTransform_ReturnValue_1;             // 0x0310(0x0040)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddMaterialControllerDataGroup_ReturnValue; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_________ReturnValue_1;                    // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EventManager_C*                     CallFunc________________;                          // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent___ID;                           // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0365(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTag_ReturnValue_1;                // 0x0366(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_367[0x1];                                      // 0x0367(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddMaterialControllerDataGroup_ReturnValue_1; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, bool>                             CallFunc_GetFormationAllEntityId_ReturnValue;      // 0x03A0(0x0050)()
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x03F0(0x0010)(ReferenceParm)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc_____ID_______;                            // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____ID___________;                        // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_D_Vector_Distance_ReturnValue;            // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue;           // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEntityEnable_ReturnValue;              // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0455(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0456(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0457(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0462(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0463(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0465(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x0466(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0467(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSVisionData                           CallFunc____________;                              // 0x0480(0x0098)(ContainsInstancedReference, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc_____________1;                            // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Vision_ML1GuLong_C*                 K2Node_DynamicCast_AsBP_Vision_ML1Gu_Long;         // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53A[0x6];                                      // 0x053A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Vision_ML1GuLong_C*                 K2Node_DynamicCast_AsBP_Vision_ML1Gu_Long_1;       // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime) == 0x000010, "Wrong alignment on GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime");
static_assert(sizeof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime) == 0x000550, "Wrong size on GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, EntryPoint) == 0x000000, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___struct_Variable) == 0x000008, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___bool_IsClosed_Variable) == 0x0000F0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_ContainsTag_ReturnValue) == 0x0000F1, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___int_Loop_Counter_Variable) == 0x0000F4, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___int_Array_Index_Variable) == 0x0000FC, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_CustomEvent_Payload) == 0x000100, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_Event_bWasCancelled) == 0x0001E0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc__________) == 0x0001E1, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________1) == 0x0001E8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_GetTransform_ReturnValue) == 0x0001F0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_________ReturnValue) == 0x000230, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_________ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____GA______________) == 0x000238, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________2) == 0x000248, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_AsBP_Base_Vision) == 0x000250, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_AsBP_Base_Vision' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_bSuccess) == 0x000258, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000260, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_MakeVectorDouble_ReturnValue) == 0x000268, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_MakeVectorDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_MakeTransformDouble_ReturnValue) == 0x000280, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_MakeTransformDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____ID___ID) == 0x0002C0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_CreateBulletFromGA_ReturnValue) == 0x0002C4, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_CreateBulletFromGA_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_IntToString_ReturnValue) == 0x0002C8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0002D8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________3) == 0x0002E8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________4) == 0x0002F0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, ___bool_Has_Been_Initd_Variable) == 0x0002F8, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________5) == 0x000300, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________6) == 0x000308, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_GetTransform_ReturnValue_1) == 0x000310, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_AddMaterialControllerDataGroup_ReturnValue) == 0x000350, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_AddMaterialControllerDataGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_________ReturnValue_1) == 0x000354, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_________ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc________________) == 0x000358, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc________________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_CustomEvent___ID) == 0x000360, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_CustomEvent___ID' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000364, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_IsValid_ReturnValue_1) == 0x000365, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_ContainsTag_ReturnValue_1) == 0x000366, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_ContainsTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________7) == 0x000368, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000370, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________8) == 0x000380, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________9) == 0x000388, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_AddMaterialControllerDataGroup_ReturnValue_1) == 0x000390, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_AddMaterialControllerDataGroup_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________10) == 0x000398, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_GetFormationAllEntityId_ReturnValue) == 0x0003A0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_GetFormationAllEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Map_Keys_Keys) == 0x0003F0, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000400, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Array_Get_Item) == 0x000418, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Array_Length_ReturnValue) == 0x00041C, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____ID_______) == 0x000420, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____ID_______' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____ID___________) == 0x000428, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____ID___________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Less_IntInt_ReturnValue) == 0x000429, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_K2_GetActorLocation_ReturnValue_1) == 0x000430, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_D_Vector_Distance_ReturnValue) == 0x000448, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_D_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_DoubleToFloat_ReturnValue) == 0x000450, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_DoubleToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_GetEntityEnable_ReturnValue) == 0x000454, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_GetEntityEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Map_Find_Value) == 0x000455, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Map_Find_ReturnValue) == 0x000456, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Less_FloatFloat_ReturnValue) == 0x000457, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc___________11) == 0x000458, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_IsValid_ReturnValue_2) == 0x000460, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000461, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000462, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000463, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000464, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x000465, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x000466, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_BooleanOR_ReturnValue) == 0x000467, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_BooleanOR_ReturnValue_1) == 0x000468, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_BooleanOR_ReturnValue_2) == 0x000469, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000470, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc____________) == 0x000480, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_____________1) == 0x000518, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_____________1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000520, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_IsValid_ReturnValue_3) == 0x000528, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_AsBP_Vision_ML1Gu_Long) == 0x000530, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_AsBP_Vision_ML1Gu_Long' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_bSuccess_1) == 0x000538, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x000539, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_AsBP_Vision_ML1Gu_Long_1) == 0x000540, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_AsBP_Vision_ML1Gu_Long_1' has a wrong offset!");
static_assert(offsetof(GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime, K2Node_DynamicCast_bSuccess_2) == 0x000548, "Member 'GA_Vision_ShowTime_C_ExecuteUbergraph_GA_Vision_ShowTime::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function GA_Vision_ShowTime.GA_Vision_ShowTime_C.材质结束
// 0x0004 (0x0004 - 0x0000)
struct GA_Vision_ShowTime_C_材质结束 final
{
public:
	int32                                         材质ID;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Vision_ShowTime_C_材质结束) == 0x000004, "Wrong alignment on GA_Vision_ShowTime_C_材质结束");
static_assert(sizeof(GA_Vision_ShowTime_C_材质结束) == 0x000004, "Wrong size on GA_Vision_ShowTime_C_材质结束");
static_assert(offsetof(GA_Vision_ShowTime_C_材质结束, 材质ID) == 0x000000, "Member 'GA_Vision_ShowTime_C_材质结束::材质ID' has a wrong offset!");

// Function GA_Vision_ShowTime.GA_Vision_ShowTime_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Vision_ShowTime_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Vision_ShowTime_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Vision_ShowTime_C_K2_OnEndAbility");
static_assert(sizeof(GA_Vision_ShowTime_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Vision_ShowTime_C_K2_OnEndAbility");
static_assert(offsetof(GA_Vision_ShowTime_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Vision_ShowTime_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Vision_ShowTime.GA_Vision_ShowTime_C.EventReceived_18B59F5945020DB23C42FD88A68D9368
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368) == 0x000008, "Wrong alignment on GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368");
static_assert(sizeof(GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368) == 0x0000B8, "Wrong size on GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368");
static_assert(offsetof(GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368, Payload) == 0x000000, "Member 'GA_Vision_ShowTime_C_EventReceived_18B59F5945020DB23C42FD88A68D9368::Payload' has a wrong offset!");

}

