#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Zhezhi_Skill03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Zhezhi_Skill03.GA_Zhezhi_Skill03_C
// 0x0020 (0x0578 - 0x0558)
class UGA_Zhezhi_Skill03_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Zhezhi_Skill03_C;                // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATsBaseCharacter_C*                     飞鹤;                                              // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Zhezhi_C*                           As_BP_Zhezhi;                                      // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEffectModelGroup_C*                    飞行特效;                                          // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Zhezhi_Skill03(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E81F1E6F55F();
	void OnBlendOut_5D118C384AE61F1C80292E81F1E6F55F();
	void OnInterrupted_5D118C384AE61F1C80292E81F1E6F55F();
	void OnCancelled_5D118C384AE61F1C80292E81F1E6F55F();
	void OnTick_5D118C384AE61F1C80292E81F1E6F55F();
	void EventReceived_18B59F5945020DB23C42FD88711A9140(const struct FGameplayEventData& Payload);
	void 筛选飞鹤实体(class ATsBaseCharacter_C** 对象, bool* 是否找到对象, int32* 伴生物序列号);
	void 设置子弹对象();
	void 镜头处理();
	void 飞行特效处理();
	void 飞鹤触发次数处理(int32 Selection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Zhezhi_Skill03_C">();
	}
	static class UGA_Zhezhi_Skill03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Zhezhi_Skill03_C>();
	}
};
static_assert(alignof(UGA_Zhezhi_Skill03_C) == 0x000008, "Wrong alignment on UGA_Zhezhi_Skill03_C");
static_assert(sizeof(UGA_Zhezhi_Skill03_C) == 0x000578, "Wrong size on UGA_Zhezhi_Skill03_C");
static_assert(offsetof(UGA_Zhezhi_Skill03_C, UberGraphFrame_GA_Zhezhi_Skill03_C) == 0x000558, "Member 'UGA_Zhezhi_Skill03_C::UberGraphFrame_GA_Zhezhi_Skill03_C' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill03_C, 飞鹤) == 0x000560, "Member 'UGA_Zhezhi_Skill03_C::飞鹤' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill03_C, As_BP_Zhezhi) == 0x000568, "Member 'UGA_Zhezhi_Skill03_C::As_BP_Zhezhi' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill03_C, 飞行特效) == 0x000570, "Member 'UGA_Zhezhi_Skill03_C::飞行特效' has a wrong offset!");

}

