#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Zhezhi_CleanHe

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Zhezhi_CleanHe.GA_Zhezhi_CleanHe_C.ExecuteUbergraph_GA_Zhezhi_CleanHe
// 0x0030 (0x0030 - 0x0000)
struct GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID_1;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID_2;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe) == 0x000008, "Wrong alignment on GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe");
static_assert(sizeof(GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe) == 0x000030, "Wrong size on GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe");
static_assert(offsetof(GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe, EntryPoint) == 0x000000, "Member 'GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe, CallFunc__________) == 0x000008, "Member 'GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe, CallFunc___________1) == 0x000010, "Member 'GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe, CallFunc_____ID___ID) == 0x000018, "Member 'GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe, CallFunc_____ID___ID_1) == 0x00001C, "Member 'GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe::CallFunc_____ID___ID_1' has a wrong offset!");
static_assert(offsetof(GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe, CallFunc___________2) == 0x000020, "Member 'GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe, CallFunc_____ID___ID_2) == 0x000028, "Member 'GA_Zhezhi_CleanHe_C_ExecuteUbergraph_GA_Zhezhi_CleanHe::CallFunc_____ID___ID_2' has a wrong offset!");

}

