#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Zhezhi_Skill01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Zhezhi_Skill01.GA_Zhezhi_Skill01_C
// 0x0038 (0x0590 - 0x0558)
class UGA_Zhezhi_Skill01_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Zhezhi_Skill01_C;                // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATsBaseCharacter_C*                     飞鹤1;                                             // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     飞鹤2;                                             // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Zhezhi_Skill01Config_C*             飞鹤出生信息;                                      // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TriggerCount;                                      // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   重击飞鹤使用配置;                                  // 0x057C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          折枝在空中;                                        // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          自己打断;                                          // 0x0589(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Zhezhi_Skill01(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E819B209F50();
	void OnBlendOut_5D118C384AE61F1C80292E819B209F50();
	void OnInterrupted_5D118C384AE61F1C80292E819B209F50();
	void OnCancelled_5D118C384AE61F1C80292E819B209F50();
	void OnTick_5D118C384AE61F1C80292E819B209F50();
	void EventReceived_18B59F5945020DB23C42FD88DCB75A45(const struct FGameplayEventData& Payload);
	void OnCompleted_5D118C384AE61F1C80292E817998F983();
	void OnBlendOut_5D118C384AE61F1C80292E817998F983();
	void OnInterrupted_5D118C384AE61F1C80292E817998F983();
	void OnCancelled_5D118C384AE61F1C80292E817998F983();
	void OnTick_5D118C384AE61F1C80292E817998F983();
	void EventReceived_18B59F5945020DB23C42FD887A29D0DA(const struct FGameplayEventData& Payload);
	void 激活并获取飞鹤实体(int32 飞鹤序列, class ATsBaseCharacter_C** 飞鹤实体, bool* 是否找到实体);
	void 设置飞鹤位置(class ATsBaseCharacter_C* 飞鹤实体, const struct FVectorDouble& Offset, float AddRot, bool AddPosition);
	void 根据配置激活并设置飞鹤(const class FName& Key, class ATsBaseCharacter_C** Target, bool* FindTarget);
	void 飞鹤是否在空中(int32 Pos, bool* InAir);
	void 设置飞鹤位置New(class ATsBaseCharacter_C* 飞鹤实体, const struct FVectorDouble& TargetLocation, float AddRot, float 地面探测高度);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Zhezhi_Skill01_C">();
	}
	static class UGA_Zhezhi_Skill01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Zhezhi_Skill01_C>();
	}
};
static_assert(alignof(UGA_Zhezhi_Skill01_C) == 0x000008, "Wrong alignment on UGA_Zhezhi_Skill01_C");
static_assert(sizeof(UGA_Zhezhi_Skill01_C) == 0x000590, "Wrong size on UGA_Zhezhi_Skill01_C");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, UberGraphFrame_GA_Zhezhi_Skill01_C) == 0x000558, "Member 'UGA_Zhezhi_Skill01_C::UberGraphFrame_GA_Zhezhi_Skill01_C' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, 飞鹤1) == 0x000560, "Member 'UGA_Zhezhi_Skill01_C::飞鹤1' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, 飞鹤2) == 0x000568, "Member 'UGA_Zhezhi_Skill01_C::飞鹤2' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, 飞鹤出生信息) == 0x000570, "Member 'UGA_Zhezhi_Skill01_C::飞鹤出生信息' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, TriggerCount) == 0x000578, "Member 'UGA_Zhezhi_Skill01_C::TriggerCount' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, 重击飞鹤使用配置) == 0x00057C, "Member 'UGA_Zhezhi_Skill01_C::重击飞鹤使用配置' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, 折枝在空中) == 0x000588, "Member 'UGA_Zhezhi_Skill01_C::折枝在空中' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, 自己打断) == 0x000589, "Member 'UGA_Zhezhi_Skill01_C::自己打断' has a wrong offset!");

}

