#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Zhezhi_Skill01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Zhezhi_Skill01.GA_Zhezhi_Skill01_C
// 0x0038 (0x0590 - 0x0558)
class UGA_Zhezhi_Skill01_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Zhezhi_Skill01_C;                // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATsBaseCharacter_C*                     _d1;                                               // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     _d2;                                               // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Zhezhi_Skill01Config_C*             _d___o;                                            // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TriggerCount;                                      // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ___d__Mn;                                          // 0x057C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___zMinus;                                         // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          __S_;                                              // 0x0589(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Zhezhi_Skill01(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E819B209F50();
	void OnBlendOut_5D118C384AE61F1C80292E819B209F50();
	void OnInterrupted_5D118C384AE61F1C80292E819B209F50();
	void OnCancelled_5D118C384AE61F1C80292E819B209F50();
	void OnTick_5D118C384AE61F1C80292E819B209F50();
	void EventReceived_18B59F5945020DB23C42FD88DCB75A45(const struct FGameplayEventData& Payload);
	void OnCompleted_5D118C384AE61F1C80292E817998F983();
	void OnBlendOut_5D118C384AE61F1C80292E817998F983();
	void OnInterrupted_5D118C384AE61F1C80292E817998F983();
	void OnCancelled_5D118C384AE61F1C80292E817998F983();
	void OnTick_5D118C384AE61F1C80292E817998F983();
	void EventReceived_18B59F5945020DB23C42FD887A29D0DA(const struct FGameplayEventData& Payload);
	void __v___d_S(int32 _d__, class ATsBaseCharacter_C** _d_S, bool* __0_S);
	void _n_dMn(class ATsBaseCharacter_C* _d_S, const struct FVector& Offset, float AddRot, bool AddPosition);
	void NinenMn__v_n_d(const class FName& Key, class ATsBaseCharacter_C** Target, bool* FindTarget);
	void __zMinus(int32 Pos, bool* InAir);
	void _n_dMnNew(class ATsBaseCharacter_C* _d_S, const struct FVector& TargetLocation, float AddRot, float Zerob_K__);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Zhezhi_Skill01_C">();
	}
	static class UGA_Zhezhi_Skill01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Zhezhi_Skill01_C>();
	}
};
static_assert(alignof(UGA_Zhezhi_Skill01_C) == 0x000008, "Wrong alignment on UGA_Zhezhi_Skill01_C");
static_assert(sizeof(UGA_Zhezhi_Skill01_C) == 0x000590, "Wrong size on UGA_Zhezhi_Skill01_C");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, UberGraphFrame_GA_Zhezhi_Skill01_C) == 0x000558, "Member 'UGA_Zhezhi_Skill01_C::UberGraphFrame_GA_Zhezhi_Skill01_C' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, _d1) == 0x000560, "Member 'UGA_Zhezhi_Skill01_C::_d1' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, _d2) == 0x000568, "Member 'UGA_Zhezhi_Skill01_C::_d2' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, _d___o) == 0x000570, "Member 'UGA_Zhezhi_Skill01_C::_d___o' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, TriggerCount) == 0x000578, "Member 'UGA_Zhezhi_Skill01_C::TriggerCount' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, ___d__Mn) == 0x00057C, "Member 'UGA_Zhezhi_Skill01_C::___d__Mn' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, ___zMinus) == 0x000588, "Member 'UGA_Zhezhi_Skill01_C::___zMinus' has a wrong offset!");
static_assert(offsetof(UGA_Zhezhi_Skill01_C, __S_) == 0x000589, "Member 'UGA_Zhezhi_Skill01_C::__S_' has a wrong offset!");

}

