#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputBlueprintFunctionLibrary

#include "Basic.hpp"

#include "sInputCommand_structs.hpp"
#include "ECommandType_structs.hpp"


namespace SDK::Params
{

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.PreProcessInput
// 0x0010 (0x0010 - 0x0000)
struct InputBlueprintFunctionLibrary_C_PreProcessInput final
{
public:
	float                                         deltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          gamePaused;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_PreProcessInput) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_PreProcessInput");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_PreProcessInput) == 0x000010, "Wrong size on InputBlueprintFunctionLibrary_C_PreProcessInput");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_PreProcessInput, deltaTime) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_PreProcessInput::deltaTime' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_PreProcessInput, gamePaused) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_PreProcessInput::gamePaused' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_PreProcessInput, __WorldContext) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_PreProcessInput::__WorldContext' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.PostProcessInput
// 0x0010 (0x0010 - 0x0000)
struct InputBlueprintFunctionLibrary_C_PostProcessInput final
{
public:
	float                                         deltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          gamePaused;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_PostProcessInput) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_PostProcessInput");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_PostProcessInput) == 0x000010, "Wrong size on InputBlueprintFunctionLibrary_C_PostProcessInput");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_PostProcessInput, deltaTime) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_PostProcessInput::deltaTime' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_PostProcessInput, gamePaused) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_PostProcessInput::gamePaused' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_PostProcessInput, __WorldContext) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_PostProcessInput::__WorldContext' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.IsKeyDown
// 0x0018 (0x0018 - 0x0000)
struct InputBlueprintFunctionLibrary_C_IsKeyDown final
{
public:
	int32                                         action;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_IsKeyDown) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_IsKeyDown");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_IsKeyDown) == 0x000018, "Wrong size on InputBlueprintFunctionLibrary_C_IsKeyDown");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_IsKeyDown, action) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_IsKeyDown::action' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_IsKeyDown, __WorldContext) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_IsKeyDown::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_IsKeyDown, ReturnValue) == 0x000010, "Member 'InputBlueprintFunctionLibrary_C_IsKeyDown::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.SetTimeDilation
// 0x0010 (0x0010 - 0x0000)
struct InputBlueprintFunctionLibrary_C_SetTimeDilation final
{
public:
	float                                         timeDilation;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_SetTimeDilation) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_SetTimeDilation");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_SetTimeDilation) == 0x000010, "Wrong size on InputBlueprintFunctionLibrary_C_SetTimeDilation");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_SetTimeDilation, timeDilation) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_SetTimeDilation::timeDilation' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_SetTimeDilation, __WorldContext) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_SetTimeDilation::__WorldContext' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.GetActionInputDistributeTag
// 0x0028 (0x0028 - 0x0000)
struct InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag final
{
public:
	class FString                                 actionName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag) == 0x000028, "Wrong size on InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag, actionName) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag::actionName' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag, __WorldContext) == 0x000010, "Member 'InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag, ReturnValue) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_GetActionInputDistributeTag::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.GetAxisInputDistributeTag
// 0x0028 (0x0028 - 0x0000)
struct InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag final
{
public:
	class FString                                 axisName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag) == 0x000028, "Wrong size on InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag, axisName) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag::axisName' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag, __WorldContext) == 0x000010, "Member 'InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag, ReturnValue) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_GetAxisInputDistributeTag::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.GetAllInputDistributeTag
// 0x0018 (0x0018 - 0x0000)
struct InputBlueprintFunctionLibrary_C_GetAllInputDistributeTag final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_GetAllInputDistributeTag) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_GetAllInputDistributeTag");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_GetAllInputDistributeTag) == 0x000018, "Wrong size on InputBlueprintFunctionLibrary_C_GetAllInputDistributeTag");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetAllInputDistributeTag, __WorldContext) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_GetAllInputDistributeTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetAllInputDistributeTag, ReturnValue) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_GetAllInputDistributeTag::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.HasMoveAxisInput
// 0x0010 (0x0010 - 0x0000)
struct InputBlueprintFunctionLibrary_C_HasMoveAxisInput final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_HasMoveAxisInput) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_HasMoveAxisInput");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_HasMoveAxisInput) == 0x000010, "Wrong size on InputBlueprintFunctionLibrary_C_HasMoveAxisInput");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_HasMoveAxisInput, __WorldContext) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_HasMoveAxisInput::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_HasMoveAxisInput, ReturnValue) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_HasMoveAxisInput::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.CanResponseInput
// 0x0018 (0x0018 - 0x0000)
struct InputBlueprintFunctionLibrary_C_CanResponseInput final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_CanResponseInput) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_CanResponseInput");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_CanResponseInput) == 0x000018, "Wrong size on InputBlueprintFunctionLibrary_C_CanResponseInput");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CanResponseInput, entityId) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_CanResponseInput::entityId' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CanResponseInput, __WorldContext) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_CanResponseInput::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CanResponseInput, ReturnValue) == 0x000010, "Member 'InputBlueprintFunctionLibrary_C_CanResponseInput::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.CharacterAttackOnPress
// 0x0040 (0x0040 - 0x0000)
struct InputBlueprintFunctionLibrary_C_CharacterAttackOnPress final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         parentCommand;                                     // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UBP_InputComponent_C*                   bpInputComp;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0028(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_CharacterAttackOnPress) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_CharacterAttackOnPress");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_CharacterAttackOnPress) == 0x000040, "Wrong size on InputBlueprintFunctionLibrary_C_CharacterAttackOnPress");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnPress, time) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnPress::time' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnPress, parentCommand) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnPress::parentCommand' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnPress, bpInputComp) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnPress::bpInputComp' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnPress, __WorldContext) == 0x000020, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnPress::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnPress, ReturnValue) == 0x000028, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnPress::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.CharacterAttackOnRelease
// 0x0040 (0x0040 - 0x0000)
struct InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         parentCommand;                                     // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UBP_InputComponent_C*                   bpInputComp;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0028(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease) == 0x000040, "Wrong size on InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease, time) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease::time' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease, parentCommand) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease::parentCommand' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease, bpInputComp) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease::bpInputComp' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease, __WorldContext) == 0x000020, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease, ReturnValue) == 0x000028, "Member 'InputBlueprintFunctionLibrary_C_CharacterAttackOnRelease::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.CharacterVisionSkill1OnPress
// 0x0038 (0x0038 - 0x0000)
struct InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         parentCommand;                                     // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0020(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress) == 0x000038, "Wrong size on InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress, time) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress::time' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress, parentCommand) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress::parentCommand' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress, __WorldContext) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress, ReturnValue) == 0x000020, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnPress::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.CharacterVisionSkill1OnRelease
// 0x0038 (0x0038 - 0x0000)
struct InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         parentCommand;                                     // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0020(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease) == 0x000038, "Wrong size on InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease, time) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease::time' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease, parentCommand) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease::parentCommand' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease, __WorldContext) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease, ReturnValue) == 0x000020, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill1OnRelease::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.CharacterVisionSkill2OnPress
// 0x0038 (0x0038 - 0x0000)
struct InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         parentCommand;                                     // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0020(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress) == 0x000038, "Wrong size on InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress, time) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress::time' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress, parentCommand) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress::parentCommand' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress, __WorldContext) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress, ReturnValue) == 0x000020, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnPress::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.CharacterVisionSkill2OnRelease
// 0x0038 (0x0038 - 0x0000)
struct InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         parentCommand;                                     // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0020(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease) == 0x000038, "Wrong size on InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease, time) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease::time' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease, parentCommand) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease::parentCommand' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease, __WorldContext) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease, ReturnValue) == 0x000020, "Member 'InputBlueprintFunctionLibrary_C_CharacterVisionSkill2OnRelease::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.GetKeyDownTime
// 0x0018 (0x0018 - 0x0000)
struct InputBlueprintFunctionLibrary_C_GetKeyDownTime final
{
public:
	int32                                         action;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_GetKeyDownTime) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_GetKeyDownTime");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_GetKeyDownTime) == 0x000018, "Wrong size on InputBlueprintFunctionLibrary_C_GetKeyDownTime");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetKeyDownTime, action) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_GetKeyDownTime::action' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetKeyDownTime, __WorldContext) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_GetKeyDownTime::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetKeyDownTime, ReturnValue) == 0x000010, "Member 'InputBlueprintFunctionLibrary_C_GetKeyDownTime::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.CreateSkillCommand
// 0x0028 (0x0028 - 0x0000)
struct InputBlueprintFunctionLibrary_C_CreateSkillCommand final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         skillId;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0010(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_CreateSkillCommand) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_CreateSkillCommand");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_CreateSkillCommand) == 0x000028, "Wrong size on InputBlueprintFunctionLibrary_C_CreateSkillCommand");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CreateSkillCommand, entityId) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_CreateSkillCommand::entityId' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CreateSkillCommand, skillId) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_CreateSkillCommand::skillId' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CreateSkillCommand, __WorldContext) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_CreateSkillCommand::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CreateSkillCommand, ReturnValue) == 0x000010, "Member 'InputBlueprintFunctionLibrary_C_CreateSkillCommand::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.FishingBoatVisionSkill1OnPress
// 0x0038 (0x0038 - 0x0000)
struct InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         parentCommand;                                     // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0020(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress) == 0x000038, "Wrong size on InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress, time) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress::time' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress, parentCommand) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress::parentCommand' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress, __WorldContext) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress, ReturnValue) == 0x000020, "Member 'InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnPress::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.FishingBoatVisionSkill1OnRelease
// 0x0038 (0x0038 - 0x0000)
struct InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease final
{
public:
	float                                         time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         parentCommand;                                     // 0x0004(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0020(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease) == 0x000038, "Wrong size on InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease, time) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease::time' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease, parentCommand) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease::parentCommand' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease, __WorldContext) == 0x000018, "Member 'InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease, ReturnValue) == 0x000020, "Member 'InputBlueprintFunctionLibrary_C_FishingBoatVisionSkill1OnRelease::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.CreateFishingBoatSprintCommand
// 0x0028 (0x0028 - 0x0000)
struct InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand final
{
public:
	int32                                         skillId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0010(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand) == 0x000028, "Wrong size on InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand, skillId) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand::skillId' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand, __WorldContext) == 0x000008, "Member 'InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand::__WorldContext' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand, ReturnValue) == 0x000010, "Member 'InputBlueprintFunctionLibrary_C_CreateFishingBoatSprintCommand::ReturnValue' has a wrong offset!");

// Function InputBlueprintFunctionLibrary.InputBlueprintFunctionLibrary_C.GetCommandInterval
// 0x0018 (0x0018 - 0x0000)
struct InputBlueprintFunctionLibrary_C_GetCommandInterval final
{
public:
	ECommandType                                  commandType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         defaultInterval;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBlueprintFunctionLibrary_C_GetCommandInterval) == 0x000008, "Wrong alignment on InputBlueprintFunctionLibrary_C_GetCommandInterval");
static_assert(sizeof(InputBlueprintFunctionLibrary_C_GetCommandInterval) == 0x000018, "Wrong size on InputBlueprintFunctionLibrary_C_GetCommandInterval");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetCommandInterval, commandType) == 0x000000, "Member 'InputBlueprintFunctionLibrary_C_GetCommandInterval::commandType' has a wrong offset!");
static_assert(offsetof(InputBlueprintFunctionLibrary_C_GetCommandInterval, defaultInterval) == 0x000004, "Member 'InputBlueprintFunctionLibrary_C_GetCommandInterval::defaultInterval' has a wrong offset!");
