#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KFC_AICommon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SPointsRow_structs.hpp"
#include "SNpcPathPoint_structs.hpp"
#include "SCamp_structs.hpp"
#include "ECamp_structs.hpp"
#include "ERelation_structs.hpp"


namespace SDK::Params
{

// Function KFC_AICommon.KFC_AICommon_C.获取自身距离目标角度
// 0x00A8 (0x00A8 - 0x0000)
struct KFC_AICommon_C_获取自身距离目标角度 final
{
public:
	class AActor*                                 目标角色;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 原点角色;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         返回角度;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_Subtract_VectorVector_ReturnValue;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue;    // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KFC_AICommon_C_获取自身距离目标角度) == 0x000008, "Wrong alignment on KFC_AICommon_C_获取自身距离目标角度");
static_assert(sizeof(KFC_AICommon_C_获取自身距离目标角度) == 0x0000A8, "Wrong size on KFC_AICommon_C_获取自身距离目标角度");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, 目标角色) == 0x000000, "Member 'KFC_AICommon_C_获取自身距离目标角度::目标角色' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, 原点角色) == 0x000008, "Member 'KFC_AICommon_C_获取自身距离目标角度::原点角色' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, __WorldContext) == 0x000010, "Member 'KFC_AICommon_C_获取自身距离目标角度::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, 返回角度) == 0x000018, "Member 'KFC_AICommon_C_获取自身距离目标角度::返回角度' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'KFC_AICommon_C_获取自身距离目标角度::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, CallFunc_D_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'KFC_AICommon_C_获取自身距离目标角度::CallFunc_D_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, CallFunc_GetActorForwardVector_ReturnValue) == 0x000050, "Member 'KFC_AICommon_C_获取自身距离目标角度::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, CallFunc_D_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'KFC_AICommon_C_获取自身距离目标角度::CallFunc_D_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, CallFunc_Normal_ReturnValue) == 0x000078, "Member 'KFC_AICommon_C_获取自身距离目标角度::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, CallFunc_Conv_VectorDoubleToVector_ReturnValue) == 0x000084, "Member 'KFC_AICommon_C_获取自身距离目标角度::CallFunc_Conv_VectorDoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, CallFunc_Normal_ReturnValue_1) == 0x000090, "Member 'KFC_AICommon_C_获取自身距离目标角度::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, CallFunc_Dot_VectorVector_ReturnValue) == 0x00009C, "Member 'KFC_AICommon_C_获取自身距离目标角度::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离目标角度, CallFunc_DegAcos_ReturnValue) == 0x0000A0, "Member 'KFC_AICommon_C_获取自身距离目标角度::CallFunc_DegAcos_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.目标距离计算
// 0x01C8 (0x01C8 - 0x0000)
struct KFC_AICommon_C_目标距离计算 final
{
public:
	class AActor*                                 AI对象;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 目标对象;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         到目标的距离;                                      // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          返回是否超过目标;                                  // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          是否超过目标;                                      // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          上一帧位置;                                        // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         距离私有变量;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          目标位置向量;                                      // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X_1;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y_1;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z_1;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_MakeVectorDouble_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_MakeVectorDouble_ReturnValue_1;           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_2;      // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_3;      // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X_2;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y_2;                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z_2;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_X_3;                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Y_3;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVectorDouble_Z_3;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_MakeVectorDouble_ReturnValue_2;           // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_MakeVectorDouble_ReturnValue_3;           // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_Subtract_VectorVector_ReturnValue;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_Subtract_VectorVector_ReturnValue_1;    // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_D_Dot_VectorVector_ReturnValue;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_D_DegAcos_ReturnValue;                    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_D_Greater_FloatFloat_ReturnValue;         // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KFC_AICommon_C_目标距离计算) == 0x000008, "Wrong alignment on KFC_AICommon_C_目标距离计算");
static_assert(sizeof(KFC_AICommon_C_目标距离计算) == 0x0001C8, "Wrong size on KFC_AICommon_C_目标距离计算");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, AI对象) == 0x000000, "Member 'KFC_AICommon_C_目标距离计算::AI对象' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, 目标对象) == 0x000008, "Member 'KFC_AICommon_C_目标距离计算::目标对象' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, __WorldContext) == 0x000010, "Member 'KFC_AICommon_C_目标距离计算::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, 到目标的距离) == 0x000018, "Member 'KFC_AICommon_C_目标距离计算::到目标的距离' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, 返回是否超过目标) == 0x00001C, "Member 'KFC_AICommon_C_目标距离计算::返回是否超过目标' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, 是否超过目标) == 0x00001D, "Member 'KFC_AICommon_C_目标距离计算::是否超过目标' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, 上一帧位置) == 0x000020, "Member 'KFC_AICommon_C_目标距离计算::上一帧位置' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, 距离私有变量) == 0x000038, "Member 'KFC_AICommon_C_目标距离计算::距离私有变量' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, 目标位置向量) == 0x000040, "Member 'KFC_AICommon_C_目标距离计算::目标位置向量' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_D_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_D_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_X) == 0x000088, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_X' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_Y) == 0x000090, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_Y' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_Z) == 0x000098, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_Z' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_X_1) == 0x0000A0, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_X_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_Y_1) == 0x0000A8, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_Y_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_Z_1) == 0x0000B0, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_Z_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_MakeVectorDouble_ReturnValue) == 0x0000B8, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_MakeVectorDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_MakeVectorDouble_ReturnValue_1) == 0x0000D0, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_MakeVectorDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_D_K2_GetActorLocation_ReturnValue_2) == 0x0000E8, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_D_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_D_K2_GetActorLocation_ReturnValue_3) == 0x000100, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_D_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_X_2) == 0x000118, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_X_2' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_Y_2) == 0x000120, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_Y_2' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_Z_2) == 0x000128, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_Z_2' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_X_3) == 0x000130, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_X_3' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_Y_3) == 0x000138, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_Y_3' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_BreakVectorDouble_Z_3) == 0x000140, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_BreakVectorDouble_Z_3' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_MakeVectorDouble_ReturnValue_2) == 0x000148, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_MakeVectorDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_MakeVectorDouble_ReturnValue_3) == 0x000160, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_MakeVectorDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_GetDistanceTo_ReturnValue) == 0x000178, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_D_Subtract_VectorVector_ReturnValue) == 0x000180, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_D_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_D_Subtract_VectorVector_ReturnValue_1) == 0x000198, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_D_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_D_Dot_VectorVector_ReturnValue) == 0x0001B0, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_D_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_D_DegAcos_ReturnValue) == 0x0001B8, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_D_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_目标距离计算, CallFunc_D_Greater_FloatFloat_ReturnValue) == 0x0001C0, "Member 'KFC_AICommon_C_目标距离计算::CallFunc_D_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.更新动画属性（性能消耗大仅限进行测试开发）
// 0x0090 (0x0090 - 0x0000)
struct KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_ final
{
public:
	class ACharacter*                             As_Base_Character;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                速度向量;                                          // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                加速度;                                            // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                移动输入向量;                                      // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否正在移动;                                      // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          是否有移动输入;                                    // 0x0035(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         速度;                                              // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         瞄准旋转速率;                                      // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 移动模式;                                          // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     TsBaseChar;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAimYawRate_ReturnValue;                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSpeed_ReturnValue;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAcceleration_ReturnValue;              // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMoveInput_ReturnValue;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMoving_ReturnValue;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_) == 0x000008, "Wrong alignment on KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_");
static_assert(sizeof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_) == 0x000090, "Wrong size on KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, As_Base_Character) == 0x000000, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::As_Base_Character' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, __WorldContext) == 0x000008, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, 速度向量) == 0x000010, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::速度向量' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, 加速度) == 0x00001C, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::加速度' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, 移动输入向量) == 0x000028, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::移动输入向量' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, 是否正在移动) == 0x000034, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::是否正在移动' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, 是否有移动输入) == 0x000035, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::是否有移动输入' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, 速度) == 0x000038, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::速度' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, 瞄准旋转速率) == 0x00003C, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::瞄准旋转速率' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, 移动模式) == 0x000040, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::移动模式' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, TsBaseChar) == 0x000048, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::TsBaseChar' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, K2Node_DynamicCast_AsTs_Base_Character) == 0x000050, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, CallFunc_GetAimYawRate_ReturnValue) == 0x00005C, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::CallFunc_GetAimYawRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, CallFunc_GetSpeed_ReturnValue) == 0x000060, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::CallFunc_GetSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, CallFunc_GetAcceleration_ReturnValue) == 0x000064, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::CallFunc_GetAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, CallFunc_HasMoveInput_ReturnValue) == 0x000070, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::CallFunc_HasMoveInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, CallFunc_IsMoving_ReturnValue) == 0x000071, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::CallFunc_IsMoving_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x000074, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_, CallFunc_GetVelocity_ReturnValue) == 0x000080, "Member 'KFC_AICommon_C_更新动画属性_性能消耗大仅限进行测试开发_::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.播放特写镜头动画
// 0x0078 (0x0078 - 0x0000)
struct KFC_AICommon_C_播放特写镜头动画 final
{
public:
	class FName                                   剧情ID;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             剧情资源表;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         演员Actor数组;                                     // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           演员身份数组;                                      // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SequenceData_C*                     NewLocalVar_0;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KFC_AICommon_C_播放特写镜头动画) == 0x000008, "Wrong alignment on KFC_AICommon_C_播放特写镜头动画");
static_assert(sizeof(KFC_AICommon_C_播放特写镜头动画) == 0x000078, "Wrong size on KFC_AICommon_C_播放特写镜头动画");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, 剧情ID) == 0x000000, "Member 'KFC_AICommon_C_播放特写镜头动画::剧情ID' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, 剧情资源表) == 0x000010, "Member 'KFC_AICommon_C_播放特写镜头动画::剧情资源表' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, 演员Actor数组) == 0x000018, "Member 'KFC_AICommon_C_播放特写镜头动画::演员Actor数组' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, 演员身份数组) == 0x000028, "Member 'KFC_AICommon_C_播放特写镜头动画::演员身份数组' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, __WorldContext) == 0x000038, "Member 'KFC_AICommon_C_播放特写镜头动画::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, NewLocalVar_0) == 0x000040, "Member 'KFC_AICommon_C_播放特写镜头动画::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'KFC_AICommon_C_播放特写镜头动画::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, ___int_Array_Index_Variable) == 0x00004C, "Member 'KFC_AICommon_C_播放特写镜头动画::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, ___int_Loop_Counter_Variable) == 0x000050, "Member 'KFC_AICommon_C_播放特写镜头动画::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, CallFunc_Array_Get_Item) == 0x000058, "Member 'KFC_AICommon_C_播放特写镜头动画::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'KFC_AICommon_C_播放特写镜头动画::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'KFC_AICommon_C_播放特写镜头动画::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'KFC_AICommon_C_播放特写镜头动画::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_播放特写镜头动画, CallFunc_Array_AddUnique_ReturnValue) == 0x000074, "Member 'KFC_AICommon_C_播放特写镜头动画::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.游荡强制转向结束
// 0x0018 (0x0018 - 0x0000)
struct KFC_AICommon_C_游荡强制转向结束 final
{
public:
	class ATsBaseCharacter_C*                     BaseCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          结束自动朝向;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KFC_AICommon_C_游荡强制转向结束) == 0x000008, "Wrong alignment on KFC_AICommon_C_游荡强制转向结束");
static_assert(sizeof(KFC_AICommon_C_游荡强制转向结束) == 0x000018, "Wrong size on KFC_AICommon_C_游荡强制转向结束");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向结束, BaseCharacter) == 0x000000, "Member 'KFC_AICommon_C_游荡强制转向结束::BaseCharacter' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向结束, __WorldContext) == 0x000008, "Member 'KFC_AICommon_C_游荡强制转向结束::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向结束, 结束自动朝向) == 0x000010, "Member 'KFC_AICommon_C_游荡强制转向结束::结束自动朝向' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.导航强制转向开始
// 0x0078 (0x0078 - 0x0000)
struct KFC_AICommon_C_导航强制转向开始 final
{
public:
	class ATsBaseCharacter_C*                     自身base对象;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         旋转速度;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                导航坐标;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          导航强制转向中;                                    // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ProjectPointOnToPlane_ReturnValue;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_VectorDoubleToVector_ReturnValue;    // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectPointOnToPlane_ReturnValue_1;      // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KFC_AICommon_C_导航强制转向开始) == 0x000008, "Wrong alignment on KFC_AICommon_C_导航强制转向开始");
static_assert(sizeof(KFC_AICommon_C_导航强制转向开始) == 0x000078, "Wrong size on KFC_AICommon_C_导航强制转向开始");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, 自身base对象) == 0x000000, "Member 'KFC_AICommon_C_导航强制转向开始::自身base对象' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, 旋转速度) == 0x000008, "Member 'KFC_AICommon_C_导航强制转向开始::旋转速度' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, 导航坐标) == 0x00000C, "Member 'KFC_AICommon_C_导航强制转向开始::导航坐标' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, __WorldContext) == 0x000018, "Member 'KFC_AICommon_C_导航强制转向开始::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, 导航强制转向中) == 0x000020, "Member 'KFC_AICommon_C_导航强制转向开始::导航强制转向中' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, CallFunc_ProjectPointOnToPlane_ReturnValue) == 0x000024, "Member 'KFC_AICommon_C_导航强制转向开始::CallFunc_ProjectPointOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'KFC_AICommon_C_导航强制转向开始::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, CallFunc_Conv_VectorDoubleToVector_ReturnValue) == 0x000048, "Member 'KFC_AICommon_C_导航强制转向开始::CallFunc_Conv_VectorDoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, CallFunc_ProjectPointOnToPlane_ReturnValue_1) == 0x000054, "Member 'KFC_AICommon_C_导航强制转向开始::CallFunc_ProjectPointOnToPlane_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'KFC_AICommon_C_导航强制转向开始::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_导航强制转向开始, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00006C, "Member 'KFC_AICommon_C_导航强制转向开始::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.停止移动
// 0x0010 (0x0010 - 0x0000)
struct KFC_AICommon_C_停止移动 final
{
public:
	class ATsBaseCharacter_C*                     Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KFC_AICommon_C_停止移动) == 0x000008, "Wrong alignment on KFC_AICommon_C_停止移动");
static_assert(sizeof(KFC_AICommon_C_停止移动) == 0x000010, "Wrong size on KFC_AICommon_C_停止移动");
static_assert(offsetof(KFC_AICommon_C_停止移动, Character) == 0x000000, "Member 'KFC_AICommon_C_停止移动::Character' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_停止移动, __WorldContext) == 0x000008, "Member 'KFC_AICommon_C_停止移动::__WorldContext' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.游荡强制转向开始
// 0x0080 (0x0080 - 0x0000)
struct KFC_AICommon_C_游荡强制转向开始 final
{
public:
	class ATsBaseCharacter_C*                     自身Character;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         旋转速度;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     仇恨对象;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          自动朝向开始;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_ProjectPointOnToPlane_ReturnValue;      // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_D_FindLookAtRotation_ReturnValue;         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KFC_AICommon_C_游荡强制转向开始) == 0x000008, "Wrong alignment on KFC_AICommon_C_游荡强制转向开始");
static_assert(sizeof(KFC_AICommon_C_游荡强制转向开始) == 0x000080, "Wrong size on KFC_AICommon_C_游荡强制转向开始");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向开始, 自身Character) == 0x000000, "Member 'KFC_AICommon_C_游荡强制转向开始::自身Character' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向开始, 旋转速度) == 0x000008, "Member 'KFC_AICommon_C_游荡强制转向开始::旋转速度' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向开始, 仇恨对象) == 0x000010, "Member 'KFC_AICommon_C_游荡强制转向开始::仇恨对象' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向开始, __WorldContext) == 0x000018, "Member 'KFC_AICommon_C_游荡强制转向开始::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向开始, 自动朝向开始) == 0x000020, "Member 'KFC_AICommon_C_游荡强制转向开始::自动朝向开始' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向开始, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'KFC_AICommon_C_游荡强制转向开始::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向开始, CallFunc_D_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'KFC_AICommon_C_游荡强制转向开始::CallFunc_D_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向开始, CallFunc_D_ProjectPointOnToPlane_ReturnValue) == 0x000058, "Member 'KFC_AICommon_C_游荡强制转向开始::CallFunc_D_ProjectPointOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_游荡强制转向开始, CallFunc_D_FindLookAtRotation_ReturnValue) == 0x000070, "Member 'KFC_AICommon_C_游荡强制转向开始::CallFunc_D_FindLookAtRotation_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.设置黑板Int
// 0x0040 (0x0040 - 0x0000)
struct KFC_AICommon_C_设置黑板Int final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         值;                                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc_GetEntityId_self_CastInput;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KFC_AICommon_C_设置黑板Int) == 0x000008, "Wrong alignment on KFC_AICommon_C_设置黑板Int");
static_assert(sizeof(KFC_AICommon_C_设置黑板Int) == 0x000040, "Wrong size on KFC_AICommon_C_设置黑板Int");
static_assert(offsetof(KFC_AICommon_C_设置黑板Int, 角色) == 0x000000, "Member 'KFC_AICommon_C_设置黑板Int::角色' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_设置黑板Int, Key) == 0x000008, "Member 'KFC_AICommon_C_设置黑板Int::Key' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_设置黑板Int, 值) == 0x000018, "Member 'KFC_AICommon_C_设置黑板Int::值' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_设置黑板Int, __WorldContext) == 0x000020, "Member 'KFC_AICommon_C_设置黑板Int::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_设置黑板Int, CallFunc_GetEntityId_self_CastInput) == 0x000028, "Member 'KFC_AICommon_C_设置黑板Int::CallFunc_GetEntityId_self_CastInput' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_设置黑板Int, CallFunc_GetEntityId_ReturnValue) == 0x000038, "Member 'KFC_AICommon_C_设置黑板Int::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.获取黑板 Int
// 0x0040 (0x0040 - 0x0000)
struct KFC_AICommon_C_获取黑板_Int final
{
public:
	class ATsBaseCharacter_C*                     角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         值;                                                // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CreatureInterface_C> CallFunc_GetEntityId_self_CastInput;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetEntityId_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIntValueByEntity_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KFC_AICommon_C_获取黑板_Int) == 0x000008, "Wrong alignment on KFC_AICommon_C_获取黑板_Int");
static_assert(sizeof(KFC_AICommon_C_获取黑板_Int) == 0x000040, "Wrong size on KFC_AICommon_C_获取黑板_Int");
static_assert(offsetof(KFC_AICommon_C_获取黑板_Int, 角色) == 0x000000, "Member 'KFC_AICommon_C_获取黑板_Int::角色' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取黑板_Int, Key) == 0x000008, "Member 'KFC_AICommon_C_获取黑板_Int::Key' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取黑板_Int, __WorldContext) == 0x000018, "Member 'KFC_AICommon_C_获取黑板_Int::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取黑板_Int, 值) == 0x000020, "Member 'KFC_AICommon_C_获取黑板_Int::值' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取黑板_Int, CallFunc_GetEntityId_self_CastInput) == 0x000028, "Member 'KFC_AICommon_C_获取黑板_Int::CallFunc_GetEntityId_self_CastInput' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取黑板_Int, CallFunc_GetEntityId_ReturnValue) == 0x000038, "Member 'KFC_AICommon_C_获取黑板_Int::CallFunc_GetEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取黑板_Int, CallFunc_GetIntValueByEntity_ReturnValue) == 0x00003C, "Member 'KFC_AICommon_C_获取黑板_Int::CallFunc_GetIntValueByEntity_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.获取自身距离坐标角度
// 0x00B8 (0x00B8 - 0x0000)
struct KFC_AICommon_C_获取自身距离坐标角度 final
{
public:
	struct FVectorDouble                          目标坐标;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 原点角色;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         返回角度;                                          // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_GetActorForwardVector_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_Subtract_VectorVector_ReturnValue;      // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_Normal_ReturnValue;                     // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_Normal_ReturnValue_1;                   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_D_Dot_VectorVector_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_DoubleToFloat_ReturnValue;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KFC_AICommon_C_获取自身距离坐标角度) == 0x000008, "Wrong alignment on KFC_AICommon_C_获取自身距离坐标角度");
static_assert(sizeof(KFC_AICommon_C_获取自身距离坐标角度) == 0x0000B8, "Wrong size on KFC_AICommon_C_获取自身距离坐标角度");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, 目标坐标) == 0x000000, "Member 'KFC_AICommon_C_获取自身距离坐标角度::目标坐标' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, 原点角色) == 0x000018, "Member 'KFC_AICommon_C_获取自身距离坐标角度::原点角色' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, __WorldContext) == 0x000020, "Member 'KFC_AICommon_C_获取自身距离坐标角度::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, 返回角度) == 0x000028, "Member 'KFC_AICommon_C_获取自身距离坐标角度::返回角度' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, CallFunc_D_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'KFC_AICommon_C_获取自身距离坐标角度::CallFunc_D_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, CallFunc_D_GetActorForwardVector_ReturnValue) == 0x000048, "Member 'KFC_AICommon_C_获取自身距离坐标角度::CallFunc_D_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, CallFunc_D_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'KFC_AICommon_C_获取自身距离坐标角度::CallFunc_D_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, CallFunc_D_Normal_ReturnValue) == 0x000078, "Member 'KFC_AICommon_C_获取自身距离坐标角度::CallFunc_D_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, CallFunc_D_Normal_ReturnValue_1) == 0x000090, "Member 'KFC_AICommon_C_获取自身距离坐标角度::CallFunc_D_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, CallFunc_D_Dot_VectorVector_ReturnValue) == 0x0000A8, "Member 'KFC_AICommon_C_获取自身距离坐标角度::CallFunc_D_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, CallFunc_Conv_DoubleToFloat_ReturnValue) == 0x0000B0, "Member 'KFC_AICommon_C_获取自身距离坐标角度::CallFunc_Conv_DoubleToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_获取自身距离坐标角度, CallFunc_DegAcos_ReturnValue) == 0x0000B4, "Member 'KFC_AICommon_C_获取自身距离坐标角度::CallFunc_DegAcos_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.使用技能关卡封装
// 0x0038 (0x0038 - 0x0000)
struct KFC_AICommon_C_使用技能关卡封装 final
{
public:
	bool                                          外部方向输入清0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     自身Character;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   技能随机结果;                                      // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 技能目标;                                          // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSkill_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KFC_AICommon_C_使用技能关卡封装) == 0x000008, "Wrong alignment on KFC_AICommon_C_使用技能关卡封装");
static_assert(sizeof(KFC_AICommon_C_使用技能关卡封装) == 0x000038, "Wrong size on KFC_AICommon_C_使用技能关卡封装");
static_assert(offsetof(KFC_AICommon_C_使用技能关卡封装, 外部方向输入清0) == 0x000000, "Member 'KFC_AICommon_C_使用技能关卡封装::外部方向输入清0' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_使用技能关卡封装, 自身Character) == 0x000008, "Member 'KFC_AICommon_C_使用技能关卡封装::自身Character' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_使用技能关卡封装, 技能随机结果) == 0x000010, "Member 'KFC_AICommon_C_使用技能关卡封装::技能随机结果' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_使用技能关卡封装, 技能目标) == 0x000020, "Member 'KFC_AICommon_C_使用技能关卡封装::技能目标' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_使用技能关卡封装, __WorldContext) == 0x000028, "Member 'KFC_AICommon_C_使用技能关卡封装::__WorldContext' has a wrong offset!");
static_assert(offsetof(KFC_AICommon_C_使用技能关卡封装, CallFunc_BeginSkill_ReturnValue) == 0x000030, "Member 'KFC_AICommon_C_使用技能关卡封装::CallFunc_BeginSkill_ReturnValue' has a wrong offset!");

// Function KFC_AICommon.KFC_AICommon_C.获取自身距离目标角度2D
// 0x00C0 (0x00C0 - 0x0000)
struct KFC_AICommon_C_获取自身距离目标角度2D final
{
public:
	class AActor*                                 目标角色;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 原点角色;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         返回角度;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          CallFunc_D_K2_GetActorLocation_ReturnValue_1;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
