#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroInput

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KuroInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class KuroInput.BasePlayerController
// 0x0060 (0x06C0 - 0x0660)
class ABasePlayerController : public APlayerController
{
public:
	uint8                                         Pad_660[0x60];                                     // 0x0660(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SetKuroForceFeedbackConfig(EGlobalKuroForceFeedbackType FeedbackConfig, int32 GlobalFeedbackCoef);
	static void SetUseSonyGamepadState(bool value);

	void AddActionBinding(const class FName& ActionName, const EInputEvent KeyEvent, class UObject* Object, const class FName& FuncName);
	void AddAxisBinding(const class FName& AxisName, class UObject* Object, const class FName& FuncName);
	void AddKeyBinding(const struct FInputChord& Chord, const EInputEvent KeyEvent, class UObject* Object, const class FName& FuncName);
	void AddTouchBinding(const EInputEvent KeyEvent, class UObject* Object, const class FName& FuncName);
	void ClearActionBindings();
	void ClearAxisBindings();
	void ClearKeyBindings();
	void ClearTouchBindings();
	void FlushPressedKeys();
	void OnReceivedPlayer();
	void PlayKuroForceFeedback(class UKuroForceFeedbackEffect* ForceFeedbackEffect, class FName Tag, bool bLooping, bool bIgnoreTimeDilation, bool bPlayWhilePaused);
	void ReceiveOnDeviceChanged();
	void ReceivePostProcessInput(const float DeltaTime, const bool bGamePaused);
	void ReceivePreProcessInput(const float DeltaTime, const bool bGamePaused);
	void ReceiveSetupInputComponent();
	void StopKuroForceFeedback(class UKuroForceFeedbackEffect* ForceFeedbackEffect, class FName Tag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BasePlayerController">();
	}
	static class ABasePlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABasePlayerController>();
	}
};
static_assert(alignof(ABasePlayerController) == 0x000008, "Wrong alignment on ABasePlayerController");
static_assert(sizeof(ABasePlayerController) == 0x0006C0, "Wrong size on ABasePlayerController");

// Class KuroInput.KuroForceFeedbackEffect
// 0x0020 (0x0078 - 0x0058)
class UKuroForceFeedbackEffect final : public UForceFeedbackEffect
{
public:
	float                                         ColdDowm;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroForceFeedbackType                        Type;                                              // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  KuroGuid;                                          // 0x0064(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroForceFeedbackEffect">();
	}
	static class UKuroForceFeedbackEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroForceFeedbackEffect>();
	}
};
static_assert(alignof(UKuroForceFeedbackEffect) == 0x000008, "Wrong alignment on UKuroForceFeedbackEffect");
static_assert(sizeof(UKuroForceFeedbackEffect) == 0x000078, "Wrong size on UKuroForceFeedbackEffect");
static_assert(offsetof(UKuroForceFeedbackEffect, ColdDowm) == 0x000058, "Member 'UKuroForceFeedbackEffect::ColdDowm' has a wrong offset!");
static_assert(offsetof(UKuroForceFeedbackEffect, Type) == 0x00005C, "Member 'UKuroForceFeedbackEffect::Type' has a wrong offset!");
static_assert(offsetof(UKuroForceFeedbackEffect, Priority) == 0x000060, "Member 'UKuroForceFeedbackEffect::Priority' has a wrong offset!");
static_assert(offsetof(UKuroForceFeedbackEffect, KuroGuid) == 0x000064, "Member 'UKuroForceFeedbackEffect::KuroGuid' has a wrong offset!");

// Class KuroInput.KuroInputFunctionLibrary
// 0x0000 (0x0030 - 0x0030)
class UKuroInputFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ApplyInputMode(class APlayerController* InPlayerController);
	static void ClearInputModeReply();
	static bool HasInputModeReply(const struct FInputModeReply& InputModeReply);
	static void ReplyInputMode(class APlayerController* InPlayerController, const struct FInputModeReply& InputModeReply);
	static void ResetInputMode(class APlayerController* InPlayerController);
	static struct FInputModeReply SetGameAndUIInputMode(class APlayerController* InPlayerController, const class FString& Reason, bool bLockMouseToViewport, bool bHideCursorDuringCapture);
	static struct FInputModeReply SetGameOnlyInputMode(class APlayerController* InPlayerController, const class FString& Reason);
	static struct FInputModeReply SetUIOnlyInputMode(class APlayerController* InPlayerController, const class FString& Reason, bool bLockMouseToViewport);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroInputFunctionLibrary">();
	}
	static class UKuroInputFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroInputFunctionLibrary>();
	}
};
static_assert(alignof(UKuroInputFunctionLibrary) == 0x000008, "Wrong alignment on UKuroInputFunctionLibrary");
static_assert(sizeof(UKuroInputFunctionLibrary) == 0x000030, "Wrong size on UKuroInputFunctionLibrary");

// Class KuroInput.KuroInputSetting
// 0x0010 (0x0040 - 0x0030)
class UKuroInputSetting final : public UObject
{
public:
	EGlobalKuroForceFeedbackType                  FeedbackConfig;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GlobalFeedbackSize;                                // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseSonyFeedback;                                 // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputMode                                    DefaultInputMode;                                  // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefaultLockMouseToViewport;                      // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefaultHideCursorDuringCapture;                  // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPrintDebugLog;                                   // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroInputSetting">();
	}
	static class UKuroInputSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroInputSetting>();
	}
};
static_assert(alignof(UKuroInputSetting) == 0x000008, "Wrong alignment on UKuroInputSetting");
static_assert(sizeof(UKuroInputSetting) == 0x000040, "Wrong size on UKuroInputSetting");
static_assert(offsetof(UKuroInputSetting, FeedbackConfig) == 0x000030, "Member 'UKuroInputSetting::FeedbackConfig' has a wrong offset!");
static_assert(offsetof(UKuroInputSetting, GlobalFeedbackSize) == 0x000034, "Member 'UKuroInputSetting::GlobalFeedbackSize' has a wrong offset!");
static_assert(offsetof(UKuroInputSetting, IsUseSonyFeedback) == 0x000038, "Member 'UKuroInputSetting::IsUseSonyFeedback' has a wrong offset!");
static_assert(offsetof(UKuroInputSetting, DefaultInputMode) == 0x000039, "Member 'UKuroInputSetting::DefaultInputMode' has a wrong offset!");
static_assert(offsetof(UKuroInputSetting, IsDefaultLockMouseToViewport) == 0x00003A, "Member 'UKuroInputSetting::IsDefaultLockMouseToViewport' has a wrong offset!");
static_assert(offsetof(UKuroInputSetting, IsDefaultHideCursorDuringCapture) == 0x00003B, "Member 'UKuroInputSetting::IsDefaultHideCursorDuringCapture' has a wrong offset!");
static_assert(offsetof(UKuroInputSetting, IsPrintDebugLog) == 0x00003C, "Member 'UKuroInputSetting::IsPrintDebugLog' has a wrong offset!");

}

