#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroCloudGame

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct KuroCloudGame.VirtualKeyBoardStruct
// 0x0010 (0x0010 - 0x0000)
struct FVirtualKeyBoardStruct final
{
public:
	class FString                                 Context;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVirtualKeyBoardStruct) == 0x000008, "Wrong alignment on FVirtualKeyBoardStruct");
static_assert(sizeof(FVirtualKeyBoardStruct) == 0x000010, "Wrong size on FVirtualKeyBoardStruct");
static_assert(offsetof(FVirtualKeyBoardStruct, Context) == 0x000000, "Member 'FVirtualKeyBoardStruct::Context' has a wrong offset!");

// ScriptStruct KuroCloudGame.ClipBoardCopyStruct
// 0x0010 (0x0010 - 0x0000)
struct FClipBoardCopyStruct final
{
public:
	class FString                                 CopyText;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClipBoardCopyStruct) == 0x000008, "Wrong alignment on FClipBoardCopyStruct");
static_assert(sizeof(FClipBoardCopyStruct) == 0x000010, "Wrong size on FClipBoardCopyStruct");
static_assert(offsetof(FClipBoardCopyStruct, CopyText) == 0x000000, "Member 'FClipBoardCopyStruct::CopyText' has a wrong offset!");

}

