#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroRenderingRuntimeBPPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "KuroCurve_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Enum KuroRenderingRuntimeBPPlugin.EKuroClusteredStuffBlendMode
// NumValues: 0x0004
enum class EKuroClusteredStuffBlendMode : uint8
{
	EAdd                                     = 0,
	EOverlay                                 = 1,
	EMax                                     = 2,
	EKuroClusteredStuffBlendMode_MAX         = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroDynamicCloudType
// NumValues: 0x003E
enum class EKuroDynamicCloudType : uint8
{
	Cloud_TianCheng                          = 0,
	Cloud_YiLuoYuanXiang                     = 1,
	Cloud_WuGuangZhiSen                      = 2,
	Cloud_ZhongQuTaiDi                       = 3,
	Cloud_Area05                             = 4,
	Cloud_ChengXiaoShan                      = 5,
	Cloud_HeiHaiAnUP                         = 6,
	Cloud_HeiHaiAnUpper                      = 7,
	Cloud_Area08                             = 8,
	Cloud_Area09                             = 9,
	Cloud_Area10                             = 10,
	Cloud_Area11                             = 11,
	Cloud_WuYinQu01                          = 12,
	Cloud_DengLuJieMian                      = 13,
	Cloud_WuYinQu02                          = 14,
	Cloud_WuYinQu03                          = 15,
	Cloud_WuYinQu04                          = 16,
	Cloud_WuYinQu05                          = 17,
	Cloud_WuYinQuInit                        = 18,
	Cloud_XuanWoYun                          = 19,
	Cloud_MingChaoTianQi                     = 20,
	Cloud_YinTianYiXiang                     = 21,
	Cloud_HuangHunYiXiang                    = 22,
	Cloud_YeWanYiXiang                       = 23,
	Cloud_ChengXiaoShanYiXiang               = 24,
	Cloud_Special01                          = 25,
	Cloud_Special02                          = 26,
	Cloud_FuBen01                            = 27,
	Cloud_FuBen02                            = 28,
	Cloud_HeiHaiAnNight                      = 29,
	Cloud_RogueMoon01                        = 30,
	Cloud_RogueMoon02                        = 31,
	Cloud_RogueMoon03                        = 32,
	Cloud_RogueMoon04                        = 33,
	Cloud_LiNaXiTa                           = 34,
	Cloud_PaErMiLuoMuDi                      = 35,
	Cloud_HuShengBanDao                      = 36,
	Cloud_DiShaLaiHaiJiYongYeJieMiQian       = 37,
	Cloud_DiShaLaiHaiJiYongYeJieMiHou        = 38,
	Cloud_JinKuShangCheng                    = 39,
	Cloud_RogueMoon05                        = 40,
	Cloud_HeiHaiAnTianQiYin                  = 41,
	Cloud_KuangHuanJie                       = 42,
	Cloud_HuShengBanDaoJieMiHou              = 43,
	Cloud_YunHaiQu                           = 44,
	Cloud_LiNaXiTaYin                        = 45,
	Cloud_LuoMuDaoYeWan                      = 46,
	Cloud_JinKuShangJieMiHou                 = 47,
	Cloud_FeiLuoLuoChuChang                  = 48,
	Cloud_ChaiHongTianQi                     = 49,
	Cloud_DianDaoTaBaiTian                   = 50,
	Cloud_DianDaoTaYeWan                     = 51,
	Cloud_DianDaoTaLiuXin                    = 52,
	Cloud_QiQiu                              = 53,
	Cloud_QiQiuYinTian                       = 54,
	Cloud_CanPoJingJiChang                   = 55,
	Cloud_JianCiShan                         = 56,
	Cloud_GuanCeTa                           = 57,
	Cloud_ChuJianQiQiu                       = 58,
	Cloud_QiQiuYeWan                         = 59,
	Cloud_Max                                = 60,
	Cloud_MAX                                = 61,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroRainType
// NumValues: 0x0011
enum class EKuroRainType : uint8
{
	EKuroRainType1                           = 0,
	EKuroRainType2                           = 1,
	EKuroRainType3                           = 2,
	EKuroRainType4                           = 3,
	EKuroRainType5                           = 4,
	EKuroRainType6                           = 5,
	EKuroRainType7                           = 6,
	EKuroRainType8                           = 7,
	EKuroRainType9                           = 8,
	EKuroRainType10                          = 9,
	EKuroRainType11                          = 10,
	EKuroRainType12                          = 11,
	EKuroRainType13                          = 12,
	EKuroRainType14                          = 13,
	EKuroRainType15                          = 14,
	EKuroRainType16                          = 15,
	EKuroRainType_MAX                        = 16,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroThunderType
// NumValues: 0x0012
enum class EKuroThunderType : uint8
{
	EKuroThunderType1                        = 0,
	EKuroThunderType2                        = 1,
	EKuroThunderType3                        = 2,
	EKuroThunderType4                        = 3,
	EKuroThunderType5                        = 4,
	EKuroThunderType6                        = 5,
	EKuroThunderType7                        = 6,
	EKuroThunderType8                        = 7,
	EKuroThunderType9                        = 8,
	EKuroThunderType10                       = 9,
	EKuroThunderType11                       = 10,
	EKuroThunderType12                       = 11,
	EKuroThunderType13                       = 12,
	EKuroThunderType14                       = 13,
	EKuroThunderType15                       = 14,
	EKuroThunderType16                       = 15,
	EKuroThunderType_Max                     = 16,
	EKuroThunderType_MAX                     = 17,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroPPLensflareType
// NumValues: 0x0012
enum class EKuroPPLensflareType : uint8
{
	EKuroPPLensflareType1                    = 0,
	EKuroPPLensflareType2                    = 1,
	EKuroPPLensflareType3                    = 2,
	EKuroPPLensflareType4                    = 3,
	EKuroPPLensflareType5                    = 4,
	EKuroPPLensflareType6                    = 5,
	EKuroPPLensflareType7                    = 6,
	EKuroPPLensflareType8                    = 7,
	EKuroPPLensflareType9                    = 8,
	EKuroPPLensflareType10                   = 9,
	EKuroPPLensflareType11                   = 10,
	EKuroPPLensflareType12                   = 11,
	EKuroPPLensflareType13                   = 12,
	EKuroPPLensflareType14                   = 13,
	EKuroPPLensflareType15                   = 14,
	EKuroPPLensflareType16                   = 15,
	EKuroPPLensflareType_Max                 = 16,
	EKuroPPLensflareType_MAX                 = 17,
};

// Enum KuroRenderingRuntimeBPPlugin.EBillboardMode
// NumValues: 0x0005
enum class EBillboardMode : uint8
{
	Free                                     = 0,
	UpWard                                   = 1,
	Right                                    = 2,
	Max                                      = 3,
	EBillboardMode_MAX                       = 4,
};

// Enum KuroRenderingRuntimeBPPlugin.ECaptureMode
// NumValues: 0x0003
enum class ECaptureMode : uint8
{
	Default                                  = 0,
	VertexColor                              = 1,
	ECaptureMode_MAX                         = 2,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroDebugDrawComponentType
// NumValues: 0x0004
enum class EKuroDebugDrawComponentType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	Cone                                     = 2,
	EKuroDebugDrawComponentType_MAX          = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.ECurveSourceType
// NumValues: 0x0003
enum class ECurveSourceType : uint8
{
	Function                                 = 0,
	CurveFloat                               = 1,
	ECurveSourceType_MAX                     = 2,
};

// Enum KuroRenderingRuntimeBPPlugin.EFloatLightMovement
// NumValues: 0x0004
enum class EFloatLightMovement : uint8
{
	ENoMovement                              = 0,
	ESwing                                   = 1,
	EJump                                    = 2,
	EFloatLightMovement_MAX                  = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroUI3DState
// NumValues: 0x0004
enum class EKuroUI3DState : uint8
{
	NotLoaded                                = 0,
	Loading                                  = 1,
	Loaded                                   = 2,
	EKuroUI3DState_MAX                       = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharacterControllerApplyType
// NumValues: 0x0004
enum class EKuroCharacterControllerApplyType : uint8
{
	ModifyProperty                           = 0,
	ReplaceMaterial                          = 1,
	ECharacterControllerApplyType_Max        = 2,
	EKuroCharacterControllerApplyType_MAX    = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharMeshPart
// NumValues: 0x0013
enum class EKuroCharMeshPart : uint8
{
	Bangs                                    = 0,
	Hair                                     = 1,
	Head                                     = 2,
	Face                                     = 3,
	Eye                                      = 4,
	Body                                     = 5,
	Up                                       = 6,
	Down                                     = 7,
	Leg                                      = 8,
	Cloth                                    = 9,
	Skirt                                    = 10,
	Star                                     = 11,
	Core                                     = 12,
	Hand                                     = 13,
	Wings                                    = 14,
	Prop                                     = 15,
	Weapon                                   = 16,
	ECharacterMeshPart_Max                   = 17,
	EKuroCharMeshPart_MAX                    = 18,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharSlotSpecifiedType
// NumValues: 0x0006
enum class EKuroCharSlotSpecifiedType : uint8
{
	All                                      = 0,
	BodyAndOutline                           = 1,
	Body                                     = 2,
	Outline                                  = 3,
	ECharacterSlotSpecifiedType_Max          = 4,
	EKuroCharSlotSpecifiedType_MAX           = 5,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharSlotType
// NumValues: 0x0007
enum class EKuroCharSlotType : uint8
{
	Body                                     = 0,
	Outline                                  = 1,
	EyeMask                                  = 2,
	HairEyeTransparent                       = 3,
	FaceShadow                               = 4,
	ECharacterSlotType_Max                   = 5,
	EKuroCharSlotType_MAX                    = 6,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharBodySpecifiedType
// NumValues: 0x000A
enum class EKuroCharBodySpecifiedType : uint8
{
	All                                      = 0,
	Body                                     = 1,
	Weapon                                   = 2,
	Hulu                                     = 3,
	WeaponAndHulu                            = 4,
	Other                                    = 5,
	ExtraBody                                = 6,
	External                                 = 7,
	ECharacterBodySpecifiedType_Max          = 8,
	EKuroCharBodySpecifiedType_MAX           = 9,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharBodyType
// NumValues: 0x0007
enum class EKuroCharBodyType : uint8
{
	Body                                     = 0,
	Weapon                                   = 1,
	Hulu                                     = 2,
	Other                                    = 3,
	ExtraBody                                = 4,
	EKuroCharBodyType_Max                    = 5,
	EKuroCharBodyType_MAX                    = 6,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroInterpolateRangeType
// NumValues: 0x0004
enum class EKuroInterpolateRangeType : uint8
{
	Start                                    = 0,
	Loop                                     = 1,
	End                                      = 2,
	EKuroInterpolateRangeType_MAX            = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.ECharacterControllerUVSwitch
// NumValues: 0x0007
enum class KuroRenderingRuntimeBPPlugin::ECharacterControllerUVSwitch : uint8
{
	UV1                                      = 0,
	UV2                                      = 1,
	UV3                                      = 2,
	UV4                                      = 3,
	ScreenUV                                 = 4,
	ECharacterControllerUVSwitch_Max         = 5,
	ECharacterControllerUVSwitch_MAX         = 6,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroCharacterControllerChannelSwitch
// NumValues: 0x0007
enum class EKuroCharacterControllerChannelSwitch : uint8
{
	RGB                                      = 0,
	R                                        = 1,
	G                                        = 2,
	B                                        = 3,
	A                                        = 4,
	EKuroCharacterControllerChannelSwitch_Max = 5,
	EKuroCharacterControllerChannelSwitch_MAX = 6,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroSceneInteractionState
// NumValues: 0x0017
enum class EKuroSceneInteractionState : uint8
{
	State1                                   = 0,
	State2                                   = 1,
	State3                                   = 2,
	State4                                   = 3,
	State5                                   = 4,
	State6                                   = 5,
	State7                                   = 6,
	State8                                   = 7,
	State9                                   = 8,
	State10                                  = 9,
	State11                                  = 10,
	State12                                  = 11,
	State13                                  = 12,
	State14                                  = 13,
	State15                                  = 14,
	State16                                  = 15,
	State17                                  = 16,
	State18                                  = 17,
	State19                                  = 18,
	State20                                  = 19,
	ConcealedState                           = 20,
	Error                                    = 21,
	EKuroSceneInteractionState_MAX           = 22,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroInterpolateRangeType_SI
// NumValues: 0x0004
enum class EKuroInterpolateRangeType_SI : uint8
{
	Start                                    = 0,
	Loop                                     = 1,
	End                                      = 2,
	EKuroInterpolateRangeType_MAX            = 3,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroPerformanceMode
// NumValues: 0x0003
enum class EKuroPerformanceMode : uint8
{
	EPM_OutPerformanceMode                   = 0,
	EPM_InPerformanceMode                    = 1,
	EPM_MAX                                  = 2,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroSmartLightActorDetectType
// NumValues: 0x0003
enum class EKuroSmartLightActorDetectType : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	EKuroSmartLightActorDetectType_MAX       = 2,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroUiSceneLoadingState
// NumValues: 0x0005
enum class EKuroUiSceneLoadingState : uint8
{
	NotLoaded                                = 0,
	Loading                                  = 1,
	LoadedNotVisible                         = 2,
	LoadedAndVisible                         = 3,
	EKuroUiSceneLoadingState_MAX             = 4,
};

// Enum KuroRenderingRuntimeBPPlugin.EKuroWorldRainCustomRandomDriver
// NumValues: 0x0005
enum class EKuroWorldRainCustomRandomDriver : uint8
{
	CustomRandomDriver_None                  = 0,
	CustomRandomDriver_NormalizedAge         = 1,
	CustomRandomDriver_Velocity              = 2,
	CustomRandomDriver_VelocityMultiTimeScale = 3,
	CustomRandomDriver_MAX                   = 4,
};

// Enum KuroRenderingRuntimeBPPlugin.KuroFeatureLevel
// NumValues: 0x0003
enum class EKuroFeatureLevel : uint8
{
	ES3_1                                    = 0,
	SM5                                      = 1,
	KuroFeatureLevel_MAX                     = 2,
};

// Enum KuroRenderingRuntimeBPPlugin.BP_EWorldType
// NumValues: 0x0009
enum class EBP_EWorldType : uint8
{
	None                                     = 0,
	Game                                     = 1,
	Editor                                   = 2,
	PIE                                      = 3,
	EditorPreview                            = 4,
	GamePreview                              = 5,
	GameRPC                                  = 6,
	Inactive                                 = 7,
	BP_MAX                                   = 8,
};

// ScriptStruct KuroRenderingRuntimeBPPlugin.KuroRainMaterialColorParameter
// 0x0230 (0x0230 - 0x0000)
struct FKuroRainMaterialColorParameter final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKuroCurveLinearColor                  Value;                                             // 0x0010(0x0220)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKuroRainMaterialColorParameter) == 0x000008, "Wrong alignment on FKuroRainMaterialColorParameter");
static_assert(sizeof(FKuroRainMaterialColorParameter) == 0x000230, "Wrong size on FKuroRainMaterialColorParameter");
static_assert(offsetof(FKuroRainMaterialColorParameter, ParameterName) == 0x000000, "Member 'FKuroRainMaterialColorParameter::ParameterName' has a wrong offset!");
static_assert(offsetof(FKuroRainMaterialColorParameter, Value) == 0x000010, "Member 'FKuroRainMaterialColorParameter::Value' has a wrong offset!");

// ScriptStruct KuroRenderingRuntimeBPPlugin.GIMiscSetting
// 0x0250 (0x0250 - 0x0000)
struct FGIMiscSetting final
{
public:
	uint8                                         bOverride_ThunderType : 1;                         // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ThunderGenerateChanceScale : 1;          // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ThunderAttackChance : 1;                 // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ThunderColor : 1;                        // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ThunderLightBrightness : 1;              // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ThunderLightColor : 1;                   // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ThunderCloudBrightness : 1;              // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EKuroThunderType                              ThunderType;                                       // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThunderGenerateChanceScale;                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThunderAttackChance;                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ThunderColor;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThunderLightBrightness;                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ThunderLightColor;                                 // 0x0024(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThunderCloudBrightness;                            // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_RainType : 1;                            // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RainDensity : 1;                         // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RainLerpTime : 1;                        // 0x0038(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RainLerpData : 1;                        // 0x0038(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RainFogDensity : 1;                      // 0x0038(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RainDensityChangeSpeed : 1;              // 0x0038(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bRainAffactPointLight : 1;               // 0x0038(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EKuroRainType                                 RainType;                                          // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RainDensity;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainLerpTime;                                      // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               RainLerpData;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainFogDensity;                                    // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainDensityChangeSpeed;                            // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRainAffectPointLight;                             // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverride_RainWindSize : 1;                        // 0x006C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RainGravity : 1;                         // 0x006C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RainDrag : 1;                            // 0x006C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_RainTimeDilation : 1;                    // 0x006C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RainWindSizeOverride;                              // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RainGravityOverride;                               // 0x0074(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainDragOverride;                                  // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainTimeDilationOverride;                          // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_RoughnessDensity : 1;                    // 0x0088(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MixRoughness : 1;                        // 0x0088(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MixRoughness_Mobile : 1;                 // 0x0088(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_EffectGravity : 1;                       // 0x0088(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightFunctionIntensity : 1;              // 0x0088(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightFunctionMapUVScaleBias : 1;         // 0x0088(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightFunctionSpeed : 1;                  // 0x0088(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightFunctionTexture : 1;                // 0x0088(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LightFunctionPerShadowTexture : 1;       // 0x0089(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_KuroDynamicCloudType : 1;                // 0x0089(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SequenceCloudTimeControl : 1;            // 0x0089(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SequenceCloudTimeOffset : 1;             // 0x0089(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OverrideCloudRotation : 1;               // 0x0089(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SequenceGlobalTimeControl : 1;           // 0x0089(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MaterialDynamicReflectionTexture : 1;    // 0x0089(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogVisibilityCulling : 1;                // 0x0089(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RoughnessDensity;                                  // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MixRoughness;                                      // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MixRoughness_Mobile;                               // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectGravity;                                     // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightFunctionIntensity;                            // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               LightFunctionMapUVScaleBias;                       // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightFunctionSpeed;                                // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             LightFunctionTexture;                              // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             LightFunctionPerShadowTexture;                     // 0x00C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroDynamicCloudType                         KuroDynamicCloudType;                              // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SequenceCloudTimeControl;                          // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SequenceCloudTimeOffset;                           // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideCloudRotation;                            // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SequenceGlobalTimeControl;                         // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureCube*                           MaterialDynamicReflectionTexture;                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableGlobalGIQualityLow : 1;                     // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FogVisibilityCulling;                              // 0x00EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_PauseEffects : 1;                        // 0x00F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPauseEffects;                                     // 0x00F4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_BurstDissolveTexture : 1;                // 0x00F5(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             BurstDissolveTexture;                              // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_BurstDissolveThreshold : 1;              // 0x0100(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BurstDissolveThreshold;                            // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_BurstDissolveSmooth : 1;                 // 0x0108(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BurstDissolveSmooth;                               // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_BurstClipThreshold : 1;                  // 0x0110(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BurstClipThreshold;                                // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_ForbidWeatherWhenTakeOver : 1;           // 0x0118(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          ForbidWeatherWhenTakeOver;                         // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_GlobalFootstepMaterial : 1;              // 0x011A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      GlobalFootstepMaterial;                            // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveUsePolarPattern : 1;                 // 0x0128(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          WaveUsePolarPattern;                               // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WavePatternTexture : 1;                  // 0x012A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             WavePatternTexture;                                // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WavePatternScaleBias : 1;                // 0x0138(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               WavePatternScaleBias;                              // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveCenter : 1;                          // 0x0150(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WaveCenter;                                        // 0x0154(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveFront : 1;                           // 0x0160(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              WaveFront;                                         // 0x0164(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveRadius : 1;                          // 0x016C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveRadius;                                        // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveRadiusSmooth : 1;                    // 0x0174(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveRadiusSmooth;                                  // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveHeight : 1;                          // 0x017C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveHeight;                                        // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveHeightSmooth : 1;                    // 0x0184(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveHeightSmooth;                                  // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveNormalSize : 1;                      // 0x018C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveNormalSize;                                    // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveRoughness : 1;                       // 0x0194(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveRoughness;                                     // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveDissolveTexture : 1;                 // 0x019C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             WaveDissolveTexture;                               // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveDissolveScaleBias : 1;               // 0x01A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               WaveDissolveScaleBias;                             // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveDissolveProgress : 1;                // 0x01C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveDissolveProgress;                              // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveDissolveSmooth : 1;                  // 0x01C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveDissolveSmooth;                                // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveColorTexture : 1;                    // 0x01D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             WaveColorTexture;                                  // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveColorScaleBias : 1;                  // 0x01E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1E1[0xF];                                      // 0x01E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               WaveColorScaleBias;                                // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveColorTextureTint : 1;                // 0x0200(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WaveColorTextureTint;                              // 0x0204(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveWiggleAmplitude : 1;                 // 0x0214(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveWiggleAmplitude;                               // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveColorTint : 1;                       // 0x021C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WaveColorTint;                                     // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveColorAdd : 1;                        // 0x0230(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WaveColorAdd;                                      // 0x0234(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_WaveOverallDensity : 1;                  // 0x0244(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaveOverallDensity;                                // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGIMiscSetting) == 0x000010, "Wrong alignment on FGIMiscSetting");
static_assert(sizeof(FGIMiscSetting) == 0x000250, "Wrong size on FGIMiscSetting");
static_assert(offsetof(FGIMiscSetting, ThunderType) == 0x000004, "Member 'FGIMiscSetting::ThunderType' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, ThunderGenerateChanceScale) == 0x000008, "Member 'FGIMiscSetting::ThunderGenerateChanceScale' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, ThunderAttackChance) == 0x00000C, "Member 'FGIMiscSetting::ThunderAttackChance' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, ThunderColor) == 0x000010, "Member 'FGIMiscSetting::ThunderColor' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, ThunderLightBrightness) == 0x000020, "Member 'FGIMiscSetting::ThunderLightBrightness' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, ThunderLightColor) == 0x000024, "Member 'FGIMiscSetting::ThunderLightColor' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, ThunderCloudBrightness) == 0x000034, "Member 'FGIMiscSetting::ThunderCloudBrightness' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainType) == 0x00003C, "Member 'FGIMiscSetting::RainType' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainDensity) == 0x000040, "Member 'FGIMiscSetting::RainDensity' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainLerpTime) == 0x000044, "Member 'FGIMiscSetting::RainLerpTime' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainLerpData) == 0x000050, "Member 'FGIMiscSetting::RainLerpData' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainFogDensity) == 0x000060, "Member 'FGIMiscSetting::RainFogDensity' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainDensityChangeSpeed) == 0x000064, "Member 'FGIMiscSetting::RainDensityChangeSpeed' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, bRainAffectPointLight) == 0x000068, "Member 'FGIMiscSetting::bRainAffectPointLight' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainWindSizeOverride) == 0x000070, "Member 'FGIMiscSetting::RainWindSizeOverride' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainGravityOverride) == 0x000074, "Member 'FGIMiscSetting::RainGravityOverride' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainDragOverride) == 0x000080, "Member 'FGIMiscSetting::RainDragOverride' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RainTimeDilationOverride) == 0x000084, "Member 'FGIMiscSetting::RainTimeDilationOverride' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, RoughnessDensity) == 0x00008C, "Member 'FGIMiscSetting::RoughnessDensity' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, MixRoughness) == 0x000090, "Member 'FGIMiscSetting::MixRoughness' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, MixRoughness_Mobile) == 0x000094, "Member 'FGIMiscSetting::MixRoughness_Mobile' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, EffectGravity) == 0x000098, "Member 'FGIMiscSetting::EffectGravity' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, LightFunctionIntensity) == 0x00009C, "Member 'FGIMiscSetting::LightFunctionIntensity' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, LightFunctionMapUVScaleBias) == 0x0000A0, "Member 'FGIMiscSetting::LightFunctionMapUVScaleBias' has a wrong offset!");
static_assert(offsetof(FGIMiscSetting, LightFunctionSpeed) == 0x0000B0, "Member 'FGIMiscSetting::LightFunctionSpeed' has a wrong offset!");
