#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroRenderingRuntimeBPPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroCurve_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "Renderer_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function KuroRenderingRuntimeBPPlugin.KuroLevelSequenceSubsystem.GetAllLevelSequences
// 0x0010 (0x0010 - 0x0000)
struct KuroLevelSequenceSubsystem_GetAllLevelSequences final
{
public:
	TArray<class AKuroLevelSequenceActor*>        InAllLevelSequences;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroLevelSequenceSubsystem_GetAllLevelSequences) == 0x000008, "Wrong alignment on KuroLevelSequenceSubsystem_GetAllLevelSequences");
static_assert(sizeof(KuroLevelSequenceSubsystem_GetAllLevelSequences) == 0x000010, "Wrong size on KuroLevelSequenceSubsystem_GetAllLevelSequences");
static_assert(offsetof(KuroLevelSequenceSubsystem_GetAllLevelSequences, InAllLevelSequences) == 0x000000, "Member 'KuroLevelSequenceSubsystem_GetAllLevelSequences::InAllLevelSequences' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroLevelSequenceSubsystem.GetLevelSequence
// 0x0018 (0x0018 - 0x0000)
struct KuroLevelSequenceSubsystem_GetLevelSequence final
{
public:
	class FName                                   Key;                                               // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AKuroLevelSequenceActor*                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroLevelSequenceSubsystem_GetLevelSequence) == 0x000008, "Wrong alignment on KuroLevelSequenceSubsystem_GetLevelSequence");
static_assert(sizeof(KuroLevelSequenceSubsystem_GetLevelSequence) == 0x000018, "Wrong size on KuroLevelSequenceSubsystem_GetLevelSequence");
static_assert(offsetof(KuroLevelSequenceSubsystem_GetLevelSequence, Key) == 0x000000, "Member 'KuroLevelSequenceSubsystem_GetLevelSequence::Key' has a wrong offset!");
static_assert(offsetof(KuroLevelSequenceSubsystem_GetLevelSequence, ReturnValue) == 0x000010, "Member 'KuroLevelSequenceSubsystem_GetLevelSequence::ReturnValue' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroLightActorBase.SetLightIntensityScale
// 0x0004 (0x0004 - 0x0000)
struct KuroLightActorBase_SetLightIntensityScale final
{
public:
	float                                         ScaleFactor;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroLightActorBase_SetLightIntensityScale) == 0x000004, "Wrong alignment on KuroLightActorBase_SetLightIntensityScale");
static_assert(sizeof(KuroLightActorBase_SetLightIntensityScale) == 0x000004, "Wrong size on KuroLightActorBase_SetLightIntensityScale");
static_assert(offsetof(KuroLightActorBase_SetLightIntensityScale, ScaleFactor) == 0x000000, "Member 'KuroLightActorBase_SetLightIntensityScale::ScaleFactor' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroLightActorBase.Update
// 0x0004 (0x0004 - 0x0000)
struct KuroLightActorBase_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroLightActorBase_Update) == 0x000004, "Wrong alignment on KuroLightActorBase_Update");
static_assert(sizeof(KuroLightActorBase_Update) == 0x000004, "Wrong size on KuroLightActorBase_Update");
static_assert(offsetof(KuroLightActorBase_Update, DeltaSeconds) == 0x000000, "Member 'KuroLightActorBase_Update::DeltaSeconds' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddOrGetMaterialControllerComponentFromActor
// 0x0010 (0x0010 - 0x0000)
struct KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroMaterialControllerComponent*       ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActor) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActor");
static_assert(sizeof(KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActor) == 0x000010, "Wrong size on KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActor");
static_assert(offsetof(KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActor, Actor) == 0x000000, "Member 'KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActor::Actor' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActor, ReturnValue) == 0x000008, "Member 'KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActor::ReturnValue' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddOrGetMaterialControllerComponentFromActorWithoutInit
// 0x0010 (0x0010 - 0x0000)
struct KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActorWithoutInit final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKuroMaterialControllerComponent*       ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActorWithoutInit) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActorWithoutInit");
static_assert(sizeof(KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActorWithoutInit) == 0x000010, "Wrong size on KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActorWithoutInit");
static_assert(offsetof(KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActorWithoutInit, Actor) == 0x000000, "Member 'KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActorWithoutInit::Actor' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActorWithoutInit, ReturnValue) == 0x000008, "Member 'KuroMaterialControllerComponent_AddOrGetMaterialControllerComponentFromActorWithoutInit::ReturnValue' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddColorUpdateParamPermanent
// 0x0020 (0x0020 - 0x0000)
struct KuroMaterialControllerComponent_AddColorUpdateParamPermanent final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x000C(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharSlotSpecifiedType                    SlotType;                                          // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharMeshPart                             MeshPart;                                          // 0x001E(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroMaterialControllerComponent_AddColorUpdateParamPermanent) == 0x000004, "Wrong alignment on KuroMaterialControllerComponent_AddColorUpdateParamPermanent");
static_assert(sizeof(KuroMaterialControllerComponent_AddColorUpdateParamPermanent) == 0x000020, "Wrong size on KuroMaterialControllerComponent_AddColorUpdateParamPermanent");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanent, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanent::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanent, Value) == 0x00000C, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanent::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanent, BodyType) == 0x00001C, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanent::BodyType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanent, SlotType) == 0x00001D, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanent::SlotType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanent, MeshPart) == 0x00001E, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanent::MeshPart' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddColorUpdateParamPermanentByIndex
// 0x002C (0x002C - 0x0000)
struct KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x000C(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BodyName;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex) == 0x000004, "Wrong alignment on KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex");
static_assert(sizeof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex) == 0x00002C, "Wrong size on KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex, Value) == 0x00000C, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex, BodyName) == 0x00001C, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex::BodyName' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex, MaterialIndex) == 0x000028, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentByIndex::MaterialIndex' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddColorUpdateParamPermanentCommon
// 0x0020 (0x0020 - 0x0000)
struct KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x000C(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharSlotSpecifiedType                    SlotType;                                          // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon) == 0x000004, "Wrong alignment on KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon");
static_assert(sizeof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon) == 0x000020, "Wrong size on KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon, Value) == 0x00000C, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon, BodyType) == 0x00001C, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon::BodyType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon, SlotType) == 0x00001D, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentCommon::SlotType' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddColorUpdateParamPermanentCustom
// 0x0040 (0x0040 - 0x0000)
struct KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x000C(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BodyName;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharSlotSpecifiedType                    SlotType;                                          // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomPartName;                                    // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom");
static_assert(sizeof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom) == 0x000040, "Wrong size on KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom, Value) == 0x00000C, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom, BodyName) == 0x00001C, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom::BodyName' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom, SlotType) == 0x000028, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom::SlotType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom, CustomPartName) == 0x000030, "Member 'KuroMaterialControllerComponent_AddColorUpdateParamPermanentCustom::CustomPartName' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddEffect
// 0x0020 (0x0020 - 0x0000)
struct KuroMaterialControllerComponent_AddEffect final
{
public:
	class UKuroMaterialControllerDataAsset*       DataAsset;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 AnimObject;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroMaterialControllerComponent_AddEffect) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddEffect");
static_assert(sizeof(KuroMaterialControllerComponent_AddEffect) == 0x000020, "Wrong size on KuroMaterialControllerComponent_AddEffect");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect, DataAsset) == 0x000000, "Member 'KuroMaterialControllerComponent_AddEffect::DataAsset' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect, bLoop) == 0x000008, "Member 'KuroMaterialControllerComponent_AddEffect::bLoop' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect, bPause) == 0x000009, "Member 'KuroMaterialControllerComponent_AddEffect::bPause' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect, AnimObject) == 0x000010, "Member 'KuroMaterialControllerComponent_AddEffect::AnimObject' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect, ReturnValue) == 0x000018, "Member 'KuroMaterialControllerComponent_AddEffect::ReturnValue' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddEffect_Ex
// 0x0020 (0x0020 - 0x0000)
struct KuroMaterialControllerComponent_AddEffect_Ex final
{
public:
	class UKuroMaterialControllerDataAsset*       DataAsset;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 AnimObject;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHiddenOnRemove;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddEffect_Ex) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddEffect_Ex");
static_assert(sizeof(KuroMaterialControllerComponent_AddEffect_Ex) == 0x000020, "Wrong size on KuroMaterialControllerComponent_AddEffect_Ex");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect_Ex, DataAsset) == 0x000000, "Member 'KuroMaterialControllerComponent_AddEffect_Ex::DataAsset' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect_Ex, bLoop) == 0x000008, "Member 'KuroMaterialControllerComponent_AddEffect_Ex::bLoop' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect_Ex, bPause) == 0x000009, "Member 'KuroMaterialControllerComponent_AddEffect_Ex::bPause' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect_Ex, AnimObject) == 0x000010, "Member 'KuroMaterialControllerComponent_AddEffect_Ex::AnimObject' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect_Ex, bHiddenOnRemove) == 0x000018, "Member 'KuroMaterialControllerComponent_AddEffect_Ex::bHiddenOnRemove' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffect_Ex, ReturnValue) == 0x00001C, "Member 'KuroMaterialControllerComponent_AddEffect_Ex::ReturnValue' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddEffectRaw
// 0x0020 (0x0020 - 0x0000)
struct KuroMaterialControllerComponent_AddEffectRaw final
{
public:
	class UKuroMaterialContainerDataCache*        DataCache;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 AnimObject;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHiddenOnRemove;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddEffectRaw) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddEffectRaw");
static_assert(sizeof(KuroMaterialControllerComponent_AddEffectRaw) == 0x000020, "Wrong size on KuroMaterialControllerComponent_AddEffectRaw");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffectRaw, DataCache) == 0x000000, "Member 'KuroMaterialControllerComponent_AddEffectRaw::DataCache' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffectRaw, bLoop) == 0x000008, "Member 'KuroMaterialControllerComponent_AddEffectRaw::bLoop' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffectRaw, bPause) == 0x000009, "Member 'KuroMaterialControllerComponent_AddEffectRaw::bPause' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffectRaw, AnimObject) == 0x000010, "Member 'KuroMaterialControllerComponent_AddEffectRaw::AnimObject' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffectRaw, bHiddenOnRemove) == 0x000018, "Member 'KuroMaterialControllerComponent_AddEffectRaw::bHiddenOnRemove' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddEffectRaw, ReturnValue) == 0x00001C, "Member 'KuroMaterialControllerComponent_AddEffectRaw::ReturnValue' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddExternalAlphaTestRefCount
// 0x0001 (0x0001 - 0x0000)
struct KuroMaterialControllerComponent_AddExternalAlphaTestRefCount final
{
public:
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddExternalAlphaTestRefCount) == 0x000001, "Wrong alignment on KuroMaterialControllerComponent_AddExternalAlphaTestRefCount");
static_assert(sizeof(KuroMaterialControllerComponent_AddExternalAlphaTestRefCount) == 0x000001, "Wrong size on KuroMaterialControllerComponent_AddExternalAlphaTestRefCount");
static_assert(offsetof(KuroMaterialControllerComponent_AddExternalAlphaTestRefCount, BodyType) == 0x000000, "Member 'KuroMaterialControllerComponent_AddExternalAlphaTestRefCount::BodyType' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddExternalBattleMaskRefCount
// 0x0001 (0x0001 - 0x0000)
struct KuroMaterialControllerComponent_AddExternalBattleMaskRefCount final
{
public:
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddExternalBattleMaskRefCount) == 0x000001, "Wrong alignment on KuroMaterialControllerComponent_AddExternalBattleMaskRefCount");
static_assert(sizeof(KuroMaterialControllerComponent_AddExternalBattleMaskRefCount) == 0x000001, "Wrong size on KuroMaterialControllerComponent_AddExternalBattleMaskRefCount");
static_assert(offsetof(KuroMaterialControllerComponent_AddExternalBattleMaskRefCount, BodyType) == 0x000000, "Member 'KuroMaterialControllerComponent_AddExternalBattleMaskRefCount::BodyType' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddExternalBattleRefCount
// 0x0001 (0x0001 - 0x0000)
struct KuroMaterialControllerComponent_AddExternalBattleRefCount final
{
public:
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddExternalBattleRefCount) == 0x000001, "Wrong alignment on KuroMaterialControllerComponent_AddExternalBattleRefCount");
static_assert(sizeof(KuroMaterialControllerComponent_AddExternalBattleRefCount) == 0x000001, "Wrong size on KuroMaterialControllerComponent_AddExternalBattleRefCount");
static_assert(offsetof(KuroMaterialControllerComponent_AddExternalBattleRefCount, BodyType) == 0x000000, "Member 'KuroMaterialControllerComponent_AddExternalBattleRefCount::BodyType' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddExternalOutlineStencilTestRefCount
// 0x0001 (0x0001 - 0x0000)
struct KuroMaterialControllerComponent_AddExternalOutlineStencilTestRefCount final
{
public:
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddExternalOutlineStencilTestRefCount) == 0x000001, "Wrong alignment on KuroMaterialControllerComponent_AddExternalOutlineStencilTestRefCount");
static_assert(sizeof(KuroMaterialControllerComponent_AddExternalOutlineStencilTestRefCount) == 0x000001, "Wrong size on KuroMaterialControllerComponent_AddExternalOutlineStencilTestRefCount");
static_assert(offsetof(KuroMaterialControllerComponent_AddExternalOutlineStencilTestRefCount, BodyType) == 0x000000, "Member 'KuroMaterialControllerComponent_AddExternalOutlineStencilTestRefCount::BodyType' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddFloatUpdateParamPermanent
// 0x0014 (0x0014 - 0x0000)
struct KuroMaterialControllerComponent_AddFloatUpdateParamPermanent final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharSlotSpecifiedType                    SlotType;                                          // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharMeshPart                             MeshPart;                                          // 0x0012(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanent) == 0x000004, "Wrong alignment on KuroMaterialControllerComponent_AddFloatUpdateParamPermanent");
static_assert(sizeof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanent) == 0x000014, "Wrong size on KuroMaterialControllerComponent_AddFloatUpdateParamPermanent");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanent, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanent::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanent, Value) == 0x00000C, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanent::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanent, BodyType) == 0x000010, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanent::BodyType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanent, SlotType) == 0x000011, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanent::SlotType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanent, MeshPart) == 0x000012, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanent::MeshPart' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddFloatUpdateParamPermanentByIndex
// 0x0020 (0x0020 - 0x0000)
struct KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BodyName;                                          // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex) == 0x000004, "Wrong alignment on KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex");
static_assert(sizeof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex) == 0x000020, "Wrong size on KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex, Value) == 0x00000C, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex, BodyName) == 0x000010, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex::BodyName' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex, MaterialIndex) == 0x00001C, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentByIndex::MaterialIndex' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddFloatUpdateParamPermanentCommon
// 0x0014 (0x0014 - 0x0000)
struct KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharSlotSpecifiedType                    SlotType;                                          // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon) == 0x000004, "Wrong alignment on KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon");
static_assert(sizeof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon) == 0x000014, "Wrong size on KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon, Value) == 0x00000C, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon, BodyType) == 0x000010, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon::BodyType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon, SlotType) == 0x000011, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCommon::SlotType' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddFloatUpdateParamPermanentCustom
// 0x0030 (0x0030 - 0x0000)
struct KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BodyName;                                          // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharSlotSpecifiedType                    SlotType;                                          // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomPartName;                                    // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom");
static_assert(sizeof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom) == 0x000030, "Wrong size on KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom, Value) == 0x00000C, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom, BodyName) == 0x000010, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom::BodyName' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom, SlotType) == 0x00001C, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom::SlotType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom, CustomPartName) == 0x000020, "Member 'KuroMaterialControllerComponent_AddFloatUpdateParamPermanentCustom::CustomPartName' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddSkeletalMeshComponent
// 0x0018 (0x0018 - 0x0000)
struct KuroMaterialControllerComponent_AddSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BodyName;                                          // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseEmptyMaterial;                                 // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroMaterialControllerComponent_AddSkeletalMeshComponent) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddSkeletalMeshComponent");
static_assert(sizeof(KuroMaterialControllerComponent_AddSkeletalMeshComponent) == 0x000018, "Wrong size on KuroMaterialControllerComponent_AddSkeletalMeshComponent");
static_assert(offsetof(KuroMaterialControllerComponent_AddSkeletalMeshComponent, SkeletalMeshComponent) == 0x000000, "Member 'KuroMaterialControllerComponent_AddSkeletalMeshComponent::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddSkeletalMeshComponent, BodyName) == 0x000008, "Member 'KuroMaterialControllerComponent_AddSkeletalMeshComponent::BodyName' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddSkeletalMeshComponent, bUseEmptyMaterial) == 0x000014, "Member 'KuroMaterialControllerComponent_AddSkeletalMeshComponent::bUseEmptyMaterial' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddTextureUpdateParamPermanent
// 0x0020 (0x0020 - 0x0000)
struct KuroMaterialControllerComponent_AddTextureUpdateParamPermanent final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharSlotSpecifiedType                    SlotType;                                          // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharMeshPart                             MeshPart;                                          // 0x001A(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanent) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddTextureUpdateParamPermanent");
static_assert(sizeof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanent) == 0x000020, "Wrong size on KuroMaterialControllerComponent_AddTextureUpdateParamPermanent");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanent, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanent::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanent, Value) == 0x000010, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanent::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanent, BodyType) == 0x000018, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanent::BodyType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanent, SlotType) == 0x000019, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanent::SlotType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanent, MeshPart) == 0x00001A, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanent::MeshPart' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddTextureUpdateParamPermanentByIndex
// 0x0028 (0x0028 - 0x0000)
struct KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BodyName;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex");
static_assert(sizeof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex) == 0x000028, "Wrong size on KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex, Value) == 0x000010, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex, BodyName) == 0x000018, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex::BodyName' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex, MaterialIndex) == 0x000024, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentByIndex::MaterialIndex' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddTextureUpdateParamPermanentCommon
// 0x0020 (0x0020 - 0x0000)
struct KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharBodySpecifiedType                    BodyType;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharSlotSpecifiedType                    SlotType;                                          // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon");
static_assert(sizeof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon) == 0x000020, "Wrong size on KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon, Value) == 0x000010, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon, BodyType) == 0x000018, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon::BodyType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon, SlotType) == 0x000019, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCommon::SlotType' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.AddTextureUpdateParamPermanentCustom
// 0x0038 (0x0038 - 0x0000)
struct KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BodyName;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKuroCharSlotSpecifiedType                    SlotType;                                          // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomPartName;                                    // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom) == 0x000008, "Wrong alignment on KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom");
static_assert(sizeof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom) == 0x000038, "Wrong size on KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom, Name_0) == 0x000000, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom::Name_0' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom, Value) == 0x000010, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom::Value' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom, BodyName) == 0x000018, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom::BodyName' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom, SlotType) == 0x000024, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom::SlotType' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom, CustomPartName) == 0x000028, "Member 'KuroMaterialControllerComponent_AddTextureUpdateParamPermanentCustom::CustomPartName' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.GetEffectKey
// 0x0010 (0x0010 - 0x0000)
struct KuroMaterialControllerComponent_GetEffectKey final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMaterialControllerComponent_GetEffectKey) == 0x000004, "Wrong alignment on KuroMaterialControllerComponent_GetEffectKey");
static_assert(sizeof(KuroMaterialControllerComponent_GetEffectKey) == 0x000010, "Wrong size on KuroMaterialControllerComponent_GetEffectKey");
static_assert(offsetof(KuroMaterialControllerComponent_GetEffectKey, KeyName) == 0x000000, "Member 'KuroMaterialControllerComponent_GetEffectKey::KeyName' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_GetEffectKey, ReturnValue) == 0x00000C, "Member 'KuroMaterialControllerComponent_GetEffectKey::ReturnValue' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.ManualTick
// 0x0008 (0x0008 - 0x0000)
struct KuroMaterialControllerComponent_ManualTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludePaused;                                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeNewEffects;                                // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroMaterialControllerComponent_ManualTick) == 0x000004, "Wrong alignment on KuroMaterialControllerComponent_ManualTick");
static_assert(sizeof(KuroMaterialControllerComponent_ManualTick) == 0x000008, "Wrong size on KuroMaterialControllerComponent_ManualTick");
static_assert(offsetof(KuroMaterialControllerComponent_ManualTick, DeltaSeconds) == 0x000000, "Member 'KuroMaterialControllerComponent_ManualTick::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_ManualTick, bIncludePaused) == 0x000004, "Member 'KuroMaterialControllerComponent_ManualTick::bIncludePaused' has a wrong offset!");
static_assert(offsetof(KuroMaterialControllerComponent_ManualTick, bIncludeNewEffects) == 0x000005, "Member 'KuroMaterialControllerComponent_ManualTick::bIncludeNewEffects' has a wrong offset!");

// Function KuroRenderingRuntimeBPPlugin.KuroMaterialControllerComponent.RefreshFilter
// 0x0004 (0x0004 - 0x0000)
struct KuroMaterialControllerComponent_RefreshFilter final
{
public:
	int32                                         HandleId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
