#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroUtility

#include "Basic.hpp"

#include "JsEnv_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroUtility_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function KuroUtility.AsyncLoadState.AsyncLoadClass
// 0x0018 (0x0018 - 0x0000)
struct AsyncLoadState_AsyncLoadClass final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                UserData;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadState_AsyncLoadClass) == 0x000008, "Wrong alignment on AsyncLoadState_AsyncLoadClass");
static_assert(sizeof(AsyncLoadState_AsyncLoadClass) == 0x000018, "Wrong size on AsyncLoadState_AsyncLoadClass");
static_assert(offsetof(AsyncLoadState_AsyncLoadClass, InPath) == 0x000000, "Member 'AsyncLoadState_AsyncLoadClass::InPath' has a wrong offset!");
static_assert(offsetof(AsyncLoadState_AsyncLoadClass, UserData) == 0x000010, "Member 'AsyncLoadState_AsyncLoadClass::UserData' has a wrong offset!");

// Function KuroUtility.AsyncLoadState.AsyncLoadObject
// 0x0018 (0x0018 - 0x0000)
struct AsyncLoadState_AsyncLoadObject final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                UserData;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadState_AsyncLoadObject) == 0x000008, "Wrong alignment on AsyncLoadState_AsyncLoadObject");
static_assert(sizeof(AsyncLoadState_AsyncLoadObject) == 0x000018, "Wrong size on AsyncLoadState_AsyncLoadObject");
static_assert(offsetof(AsyncLoadState_AsyncLoadObject, InPath) == 0x000000, "Member 'AsyncLoadState_AsyncLoadObject::InPath' has a wrong offset!");
static_assert(offsetof(AsyncLoadState_AsyncLoadObject, UserData) == 0x000010, "Member 'AsyncLoadState_AsyncLoadObject::UserData' has a wrong offset!");

// Function KuroUtility.HoldPreloadObject.AddCommonAsset
// 0x0008 (0x0008 - 0x0000)
struct HoldPreloadObject_AddCommonAsset final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoldPreloadObject_AddCommonAsset) == 0x000008, "Wrong alignment on HoldPreloadObject_AddCommonAsset");
static_assert(sizeof(HoldPreloadObject_AddCommonAsset) == 0x000008, "Wrong size on HoldPreloadObject_AddCommonAsset");
static_assert(offsetof(HoldPreloadObject_AddCommonAsset, InObject) == 0x000000, "Member 'HoldPreloadObject_AddCommonAsset::InObject' has a wrong offset!");

// Function KuroUtility.HoldPreloadObject.AddEntityAsset
// 0x0018 (0x0018 - 0x0000)
struct HoldPreloadObject_AddEntityAsset final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InObject;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HoldPreloadObject_AddEntityAsset) == 0x000008, "Wrong alignment on HoldPreloadObject_AddEntityAsset");
static_assert(sizeof(HoldPreloadObject_AddEntityAsset) == 0x000018, "Wrong size on HoldPreloadObject_AddEntityAsset");
static_assert(offsetof(HoldPreloadObject_AddEntityAsset, EntityId) == 0x000000, "Member 'HoldPreloadObject_AddEntityAsset::EntityId' has a wrong offset!");
static_assert(offsetof(HoldPreloadObject_AddEntityAsset, InObject) == 0x000008, "Member 'HoldPreloadObject_AddEntityAsset::InObject' has a wrong offset!");
static_assert(offsetof(HoldPreloadObject_AddEntityAsset, ReturnValue) == 0x000010, "Member 'HoldPreloadObject_AddEntityAsset::ReturnValue' has a wrong offset!");

// Function KuroUtility.HoldPreloadObject.GetCommonAssetArray
// 0x0010 (0x0010 - 0x0000)
struct HoldPreloadObject_GetCommonAssetArray final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoldPreloadObject_GetCommonAssetArray) == 0x000008, "Wrong alignment on HoldPreloadObject_GetCommonAssetArray");
static_assert(sizeof(HoldPreloadObject_GetCommonAssetArray) == 0x000010, "Wrong size on HoldPreloadObject_GetCommonAssetArray");
static_assert(offsetof(HoldPreloadObject_GetCommonAssetArray, ReturnValue) == 0x000000, "Member 'HoldPreloadObject_GetCommonAssetArray::ReturnValue' has a wrong offset!");

// Function KuroUtility.HoldPreloadObject.GetEntityAssetArray
// 0x0020 (0x0020 - 0x0000)
struct HoldPreloadObject_GetEntityAssetArray final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        OutAssets;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HoldPreloadObject_GetEntityAssetArray) == 0x000008, "Wrong alignment on HoldPreloadObject_GetEntityAssetArray");
static_assert(sizeof(HoldPreloadObject_GetEntityAssetArray) == 0x000020, "Wrong size on HoldPreloadObject_GetEntityAssetArray");
static_assert(offsetof(HoldPreloadObject_GetEntityAssetArray, EntityId) == 0x000000, "Member 'HoldPreloadObject_GetEntityAssetArray::EntityId' has a wrong offset!");
static_assert(offsetof(HoldPreloadObject_GetEntityAssetArray, OutAssets) == 0x000008, "Member 'HoldPreloadObject_GetEntityAssetArray::OutAssets' has a wrong offset!");
static_assert(offsetof(HoldPreloadObject_GetEntityAssetArray, ReturnValue) == 0x000018, "Member 'HoldPreloadObject_GetEntityAssetArray::ReturnValue' has a wrong offset!");

// Function KuroUtility.HoldPreloadObject.RemoveEntityAssets
// 0x0008 (0x0008 - 0x0000)
struct HoldPreloadObject_RemoveEntityAssets final
{
public:
	int32                                         EntityId;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HoldPreloadObject_RemoveEntityAssets) == 0x000004, "Wrong alignment on HoldPreloadObject_RemoveEntityAssets");
static_assert(sizeof(HoldPreloadObject_RemoveEntityAssets) == 0x000008, "Wrong size on HoldPreloadObject_RemoveEntityAssets");
static_assert(offsetof(HoldPreloadObject_RemoveEntityAssets, EntityId) == 0x000000, "Member 'HoldPreloadObject_RemoveEntityAssets::EntityId' has a wrong offset!");
static_assert(offsetof(HoldPreloadObject_RemoveEntityAssets, ReturnValue) == 0x000004, "Member 'HoldPreloadObject_RemoveEntityAssets::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorComponent.EditorTickComponent
// 0x0004 (0x0004 - 0x0000)
struct KuroActorComponent_EditorTickComponent final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorComponent_EditorTickComponent) == 0x000004, "Wrong alignment on KuroActorComponent_EditorTickComponent");
static_assert(sizeof(KuroActorComponent_EditorTickComponent) == 0x000004, "Wrong size on KuroActorComponent_EditorTickComponent");
static_assert(offsetof(KuroActorComponent_EditorTickComponent, DeltaTime) == 0x000000, "Member 'KuroActorComponent_EditorTickComponent::DeltaTime' has a wrong offset!");

// Function KuroUtility.KuroActorManager.ClearAcquiredComponents
// 0x0010 (0x0010 - 0x0000)
struct KuroActorManager_ClearAcquiredComponents final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroActorManager_ClearAcquiredComponents) == 0x000008, "Wrong alignment on KuroActorManager_ClearAcquiredComponents");
static_assert(sizeof(KuroActorManager_ClearAcquiredComponents) == 0x000010, "Wrong size on KuroActorManager_ClearAcquiredComponents");
static_assert(offsetof(KuroActorManager_ClearAcquiredComponents, Actor) == 0x000000, "Member 'KuroActorManager_ClearAcquiredComponents::Actor' has a wrong offset!");
static_assert(offsetof(KuroActorManager_ClearAcquiredComponents, ReturnValue) == 0x000008, "Member 'KuroActorManager_ClearAcquiredComponents::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorManager.D_SpawnActor
// 0x0080 (0x0080 - 0x0000)
struct KuroActorManager_D_SpawnActor final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransformDouble                       SpawnTransform;                                    // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ESpawnActorCollisionHandlingMethod            CollisionHandlingOverride;                         // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0058(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Instigator;                                        // 0x0060(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsPoolActor;                                      // 0x0068(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroActorManager_D_SpawnActor) == 0x000010, "Wrong alignment on KuroActorManager_D_SpawnActor");
static_assert(sizeof(KuroActorManager_D_SpawnActor) == 0x000080, "Wrong size on KuroActorManager_D_SpawnActor");
static_assert(offsetof(KuroActorManager_D_SpawnActor, WorldContextObject) == 0x000000, "Member 'KuroActorManager_D_SpawnActor::WorldContextObject' has a wrong offset!");
static_assert(offsetof(KuroActorManager_D_SpawnActor, ActorClass) == 0x000008, "Member 'KuroActorManager_D_SpawnActor::ActorClass' has a wrong offset!");
static_assert(offsetof(KuroActorManager_D_SpawnActor, SpawnTransform) == 0x000010, "Member 'KuroActorManager_D_SpawnActor::SpawnTransform' has a wrong offset!");
static_assert(offsetof(KuroActorManager_D_SpawnActor, CollisionHandlingOverride) == 0x000050, "Member 'KuroActorManager_D_SpawnActor::CollisionHandlingOverride' has a wrong offset!");
static_assert(offsetof(KuroActorManager_D_SpawnActor, Owner) == 0x000058, "Member 'KuroActorManager_D_SpawnActor::Owner' has a wrong offset!");
static_assert(offsetof(KuroActorManager_D_SpawnActor, Instigator) == 0x000060, "Member 'KuroActorManager_D_SpawnActor::Instigator' has a wrong offset!");
static_assert(offsetof(KuroActorManager_D_SpawnActor, bAsPoolActor) == 0x000068, "Member 'KuroActorManager_D_SpawnActor::bAsPoolActor' has a wrong offset!");
static_assert(offsetof(KuroActorManager_D_SpawnActor, ReturnValue) == 0x000070, "Member 'KuroActorManager_D_SpawnActor::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorManager.DestroyActor
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_DestroyActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_DestroyActor) == 0x000008, "Wrong alignment on KuroActorManager_DestroyActor");
static_assert(sizeof(KuroActorManager_DestroyActor) == 0x000008, "Wrong size on KuroActorManager_DestroyActor");
static_assert(offsetof(KuroActorManager_DestroyActor, Actor) == 0x000000, "Member 'KuroActorManager_DestroyActor::Actor' has a wrong offset!");

// Function KuroUtility.KuroActorManager.GetAllAcquiredComponents
// 0x0018 (0x0018 - 0x0000)
struct KuroActorManager_GetAllAcquiredComponents final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_GetAllAcquiredComponents) == 0x000008, "Wrong alignment on KuroActorManager_GetAllAcquiredComponents");
static_assert(sizeof(KuroActorManager_GetAllAcquiredComponents) == 0x000018, "Wrong size on KuroActorManager_GetAllAcquiredComponents");
static_assert(offsetof(KuroActorManager_GetAllAcquiredComponents, Actor) == 0x000000, "Member 'KuroActorManager_GetAllAcquiredComponents::Actor' has a wrong offset!");
static_assert(offsetof(KuroActorManager_GetAllAcquiredComponents, ReturnValue) == 0x000008, "Member 'KuroActorManager_GetAllAcquiredComponents::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorManager.GetDummySequence
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_GetDummySequence final
{
public:
	class ULevelSequence*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_GetDummySequence) == 0x000008, "Wrong alignment on KuroActorManager_GetDummySequence");
static_assert(sizeof(KuroActorManager_GetDummySequence) == 0x000008, "Wrong size on KuroActorManager_GetDummySequence");
static_assert(offsetof(KuroActorManager_GetDummySequence, ReturnValue) == 0x000000, "Member 'KuroActorManager_GetDummySequence::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorManager.GetResourceSizeBytes
// 0x0010 (0x0010 - 0x0000)
struct KuroActorManager_GetResourceSizeBytes final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isExclusive;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_GetResourceSizeBytes) == 0x000008, "Wrong alignment on KuroActorManager_GetResourceSizeBytes");
static_assert(sizeof(KuroActorManager_GetResourceSizeBytes) == 0x000010, "Wrong size on KuroActorManager_GetResourceSizeBytes");
static_assert(offsetof(KuroActorManager_GetResourceSizeBytes, Actor) == 0x000000, "Member 'KuroActorManager_GetResourceSizeBytes::Actor' has a wrong offset!");
static_assert(offsetof(KuroActorManager_GetResourceSizeBytes, isExclusive) == 0x000008, "Member 'KuroActorManager_GetResourceSizeBytes::isExclusive' has a wrong offset!");
static_assert(offsetof(KuroActorManager_GetResourceSizeBytes, ReturnValue) == 0x00000C, "Member 'KuroActorManager_GetResourceSizeBytes::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorManager.IsActorPoolEnable
// 0x0001 (0x0001 - 0x0000)
struct KuroActorManager_IsActorPoolEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_IsActorPoolEnable) == 0x000001, "Wrong alignment on KuroActorManager_IsActorPoolEnable");
static_assert(sizeof(KuroActorManager_IsActorPoolEnable) == 0x000001, "Wrong size on KuroActorManager_IsActorPoolEnable");
static_assert(offsetof(KuroActorManager_IsActorPoolEnable, ReturnValue) == 0x000000, "Member 'KuroActorManager_IsActorPoolEnable::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorManager.IsPooledActor
// 0x0010 (0x0010 - 0x0000)
struct KuroActorManager_IsPooledActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroActorManager_IsPooledActor) == 0x000008, "Wrong alignment on KuroActorManager_IsPooledActor");
static_assert(sizeof(KuroActorManager_IsPooledActor) == 0x000010, "Wrong size on KuroActorManager_IsPooledActor");
static_assert(offsetof(KuroActorManager_IsPooledActor, Actor) == 0x000000, "Member 'KuroActorManager_IsPooledActor::Actor' has a wrong offset!");
static_assert(offsetof(KuroActorManager_IsPooledActor, ReturnValue) == 0x000008, "Member 'KuroActorManager_IsPooledActor::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorManager.RegisterActorSkipProperties
// 0x0018 (0x0018 - 0x0000)
struct KuroActorManager_RegisterActorSkipProperties final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPropertyPair>                  Properties;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_RegisterActorSkipProperties) == 0x000008, "Wrong alignment on KuroActorManager_RegisterActorSkipProperties");
static_assert(sizeof(KuroActorManager_RegisterActorSkipProperties) == 0x000018, "Wrong size on KuroActorManager_RegisterActorSkipProperties");
static_assert(offsetof(KuroActorManager_RegisterActorSkipProperties, Class_0) == 0x000000, "Member 'KuroActorManager_RegisterActorSkipProperties::Class_0' has a wrong offset!");
static_assert(offsetof(KuroActorManager_RegisterActorSkipProperties, Properties) == 0x000008, "Member 'KuroActorManager_RegisterActorSkipProperties::Properties' has a wrong offset!");

// Function KuroUtility.KuroActorManager.ResetActorToDefault
// 0x0010 (0x0010 - 0x0000)
struct KuroActorManager_ResetActorToDefault final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroActorManager_ResetActorToDefault) == 0x000008, "Wrong alignment on KuroActorManager_ResetActorToDefault");
static_assert(sizeof(KuroActorManager_ResetActorToDefault) == 0x000010, "Wrong size on KuroActorManager_ResetActorToDefault");
static_assert(offsetof(KuroActorManager_ResetActorToDefault, Actor) == 0x000000, "Member 'KuroActorManager_ResetActorToDefault::Actor' has a wrong offset!");
static_assert(offsetof(KuroActorManager_ResetActorToDefault, ReturnValue) == 0x000008, "Member 'KuroActorManager_ResetActorToDefault::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorManager.ResetClassPropertyCache
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_ResetClassPropertyCache final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_ResetClassPropertyCache) == 0x000008, "Wrong alignment on KuroActorManager_ResetClassPropertyCache");
static_assert(sizeof(KuroActorManager_ResetClassPropertyCache) == 0x000008, "Wrong size on KuroActorManager_ResetClassPropertyCache");
static_assert(offsetof(KuroActorManager_ResetClassPropertyCache, Class_0) == 0x000000, "Member 'KuroActorManager_ResetClassPropertyCache::Class_0' has a wrong offset!");

// Function KuroUtility.KuroActorManager.ResetDelegates
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_ResetDelegates final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_ResetDelegates) == 0x000008, "Wrong alignment on KuroActorManager_ResetDelegates");
static_assert(sizeof(KuroActorManager_ResetDelegates) == 0x000008, "Wrong size on KuroActorManager_ResetDelegates");
static_assert(offsetof(KuroActorManager_ResetDelegates, Actor) == 0x000000, "Member 'KuroActorManager_ResetDelegates::Actor' has a wrong offset!");

// Function KuroUtility.KuroActorManager.ResetUberGraph
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_ResetUberGraph final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_ResetUberGraph) == 0x000008, "Wrong alignment on KuroActorManager_ResetUberGraph");
static_assert(sizeof(KuroActorManager_ResetUberGraph) == 0x000008, "Wrong size on KuroActorManager_ResetUberGraph");
static_assert(offsetof(KuroActorManager_ResetUberGraph, Obj) == 0x000000, "Member 'KuroActorManager_ResetUberGraph::Obj' has a wrong offset!");

// Function KuroUtility.KuroActorManager.ResetUObjectByCDO
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_ResetUObjectByCDO final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_ResetUObjectByCDO) == 0x000008, "Wrong alignment on KuroActorManager_ResetUObjectByCDO");
static_assert(sizeof(KuroActorManager_ResetUObjectByCDO) == 0x000008, "Wrong size on KuroActorManager_ResetUObjectByCDO");
static_assert(offsetof(KuroActorManager_ResetUObjectByCDO, Obj) == 0x000000, "Member 'KuroActorManager_ResetUObjectByCDO::Obj' has a wrong offset!");

// Function KuroUtility.KuroActorManager.SpawnActor
// 0x0070 (0x0070 - 0x0000)
struct KuroActorManager_SpawnActor final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ESpawnActorCollisionHandlingMethod            CollisionHandlingOverride;                         // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Instigator;                                        // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsPoolActor;                                      // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroActorManager_SpawnActor) == 0x000010, "Wrong alignment on KuroActorManager_SpawnActor");
static_assert(sizeof(KuroActorManager_SpawnActor) == 0x000070, "Wrong size on KuroActorManager_SpawnActor");
static_assert(offsetof(KuroActorManager_SpawnActor, WorldContextObject) == 0x000000, "Member 'KuroActorManager_SpawnActor::WorldContextObject' has a wrong offset!");
static_assert(offsetof(KuroActorManager_SpawnActor, ActorClass) == 0x000008, "Member 'KuroActorManager_SpawnActor::ActorClass' has a wrong offset!");
static_assert(offsetof(KuroActorManager_SpawnActor, SpawnTransform) == 0x000010, "Member 'KuroActorManager_SpawnActor::SpawnTransform' has a wrong offset!");
static_assert(offsetof(KuroActorManager_SpawnActor, CollisionHandlingOverride) == 0x000040, "Member 'KuroActorManager_SpawnActor::CollisionHandlingOverride' has a wrong offset!");
static_assert(offsetof(KuroActorManager_SpawnActor, Owner) == 0x000048, "Member 'KuroActorManager_SpawnActor::Owner' has a wrong offset!");
static_assert(offsetof(KuroActorManager_SpawnActor, Instigator) == 0x000050, "Member 'KuroActorManager_SpawnActor::Instigator' has a wrong offset!");
static_assert(offsetof(KuroActorManager_SpawnActor, bAsPoolActor) == 0x000058, "Member 'KuroActorManager_SpawnActor::bAsPoolActor' has a wrong offset!");
static_assert(offsetof(KuroActorManager_SpawnActor, ReturnValue) == 0x000060, "Member 'KuroActorManager_SpawnActor::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroActorManager.UnregisterComponent
// 0x0008 (0x0008 - 0x0000)
struct KuroActorManager_UnregisterComponent final
{
public:
	class UActorComponent*                        Componet;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroActorManager_UnregisterComponent) == 0x000008, "Wrong alignment on KuroActorManager_UnregisterComponent");
static_assert(sizeof(KuroActorManager_UnregisterComponent) == 0x000008, "Wrong size on KuroActorManager_UnregisterComponent");
static_assert(offsetof(KuroActorManager_UnregisterComponent, Componet) == 0x000000, "Member 'KuroActorManager_UnregisterComponent::Componet' has a wrong offset!");

// Function KuroUtility.KuroApplicationLibrary.AddApplicationLifetimeDelegate
// 0x0030 (0x0030 - 0x0000)
struct KuroApplicationLibrary_AddApplicationLifetimeDelegate final
{
public:
	TDelegate<void(int32 Type)>                   InDelegate;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroApplicationLibrary_AddApplicationLifetimeDelegate) == 0x000004, "Wrong alignment on KuroApplicationLibrary_AddApplicationLifetimeDelegate");
static_assert(sizeof(KuroApplicationLibrary_AddApplicationLifetimeDelegate) == 0x000030, "Wrong size on KuroApplicationLibrary_AddApplicationLifetimeDelegate");
static_assert(offsetof(KuroApplicationLibrary_AddApplicationLifetimeDelegate, InDelegate) == 0x000000, "Member 'KuroApplicationLibrary_AddApplicationLifetimeDelegate::InDelegate' has a wrong offset!");
static_assert(offsetof(KuroApplicationLibrary_AddApplicationLifetimeDelegate, ReturnValue) == 0x000028, "Member 'KuroApplicationLibrary_AddApplicationLifetimeDelegate::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroApplicationLibrary.AddEditorPreEndPIEDelegate
// 0x0030 (0x0030 - 0x0000)
struct KuroApplicationLibrary_AddEditorPreEndPIEDelegate final
{
public:
	TDelegate<void(bool bSimulateInEditor)>       InDelegate;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroApplicationLibrary_AddEditorPreEndPIEDelegate) == 0x000004, "Wrong alignment on KuroApplicationLibrary_AddEditorPreEndPIEDelegate");
static_assert(sizeof(KuroApplicationLibrary_AddEditorPreEndPIEDelegate) == 0x000030, "Wrong size on KuroApplicationLibrary_AddEditorPreEndPIEDelegate");
static_assert(offsetof(KuroApplicationLibrary_AddEditorPreEndPIEDelegate, InDelegate) == 0x000000, "Member 'KuroApplicationLibrary_AddEditorPreEndPIEDelegate::InDelegate' has a wrong offset!");
static_assert(offsetof(KuroApplicationLibrary_AddEditorPreEndPIEDelegate, ReturnValue) == 0x000028, "Member 'KuroApplicationLibrary_AddEditorPreEndPIEDelegate::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroApplicationLibrary.Test
// 0x0008 (0x0008 - 0x0000)
struct KuroApplicationLibrary_Test final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KuroApplicationLibrary_Test) == 0x000004, "Wrong alignment on KuroApplicationLibrary_Test");
static_assert(sizeof(KuroApplicationLibrary_Test) == 0x000008, "Wrong size on KuroApplicationLibrary_Test");
static_assert(offsetof(KuroApplicationLibrary_Test, Type) == 0x000000, "Member 'KuroApplicationLibrary_Test::Type' has a wrong offset!");
static_assert(offsetof(KuroApplicationLibrary_Test, ReturnValue) == 0x000004, "Member 'KuroApplicationLibrary_Test::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroApplicationLibrary.UnBind
// 0x0001 (0x0001 - 0x0000)
struct KuroApplicationLibrary_UnBind final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroApplicationLibrary_UnBind) == 0x000001, "Wrong alignment on KuroApplicationLibrary_UnBind");
static_assert(sizeof(KuroApplicationLibrary_UnBind) == 0x000001, "Wrong size on KuroApplicationLibrary_UnBind");
static_assert(offsetof(KuroApplicationLibrary_UnBind, ReturnValue) == 0x000000, "Member 'KuroApplicationLibrary_UnBind::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroCollectActorComponent.GetActorWithTag
// 0x0018 (0x0018 - 0x0000)
struct KuroCollectActorComponent_GetActorWithTag final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollectActorType                             Type;                                              // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroCollectActorComponent_GetActorWithTag) == 0x000008, "Wrong alignment on KuroCollectActorComponent_GetActorWithTag");
static_assert(sizeof(KuroCollectActorComponent_GetActorWithTag) == 0x000018, "Wrong size on KuroCollectActorComponent_GetActorWithTag");
static_assert(offsetof(KuroCollectActorComponent_GetActorWithTag, Tag) == 0x000000, "Member 'KuroCollectActorComponent_GetActorWithTag::Tag' has a wrong offset!");
static_assert(offsetof(KuroCollectActorComponent_GetActorWithTag, Type) == 0x00000C, "Member 'KuroCollectActorComponent_GetActorWithTag::Type' has a wrong offset!");
static_assert(offsetof(KuroCollectActorComponent_GetActorWithTag, ReturnValue) == 0x000010, "Member 'KuroCollectActorComponent_GetActorWithTag::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroCompressLibrary.CompressFileOrFolder
// 0x00A0 (0x00A0 - 0x0000)
struct KuroCompressLibrary_CompressFileOrFolder final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DestPath;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float Rate)>                   OnProgress;                                        // 0x0020(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(TArray<class FString>& SuccessedPaths)> OnCompressComplete;                                // 0x0048(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnFail;                                            // 0x0070(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         MaxSingleFileReadSize;                             // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroCompressLibrary_CompressFileOrFolder) == 0x000008, "Wrong alignment on KuroCompressLibrary_CompressFileOrFolder");
static_assert(sizeof(KuroCompressLibrary_CompressFileOrFolder) == 0x0000A0, "Wrong size on KuroCompressLibrary_CompressFileOrFolder");
static_assert(offsetof(KuroCompressLibrary_CompressFileOrFolder, Path) == 0x000000, "Member 'KuroCompressLibrary_CompressFileOrFolder::Path' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFileOrFolder, DestPath) == 0x000010, "Member 'KuroCompressLibrary_CompressFileOrFolder::DestPath' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFileOrFolder, OnProgress) == 0x000020, "Member 'KuroCompressLibrary_CompressFileOrFolder::OnProgress' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFileOrFolder, OnCompressComplete) == 0x000048, "Member 'KuroCompressLibrary_CompressFileOrFolder::OnCompressComplete' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFileOrFolder, OnFail) == 0x000070, "Member 'KuroCompressLibrary_CompressFileOrFolder::OnFail' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFileOrFolder, MaxSingleFileReadSize) == 0x000098, "Member 'KuroCompressLibrary_CompressFileOrFolder::MaxSingleFileReadSize' has a wrong offset!");

// Function KuroUtility.KuroCompressLibrary.CompressFilesOrFoldersAsync
// 0x00A8 (0x00A8 - 0x0000)
struct KuroCompressLibrary_CompressFilesOrFoldersAsync final
{
public:
	TArray<class FString>                         Paths;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 DestPath;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float Rate)>                   OnProgress;                                        // 0x0020(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(TArray<class FString>& SuccessedPaths)> OnCompressComplete;                                // 0x0048(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnFail;                                            // 0x0070(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bAutoIncludeFilesUnderFolder;                      // 0x0098(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         MaxSingleFileReadSize;                             // 0x00A0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroCompressLibrary_CompressFilesOrFoldersAsync) == 0x000008, "Wrong alignment on KuroCompressLibrary_CompressFilesOrFoldersAsync");
static_assert(sizeof(KuroCompressLibrary_CompressFilesOrFoldersAsync) == 0x0000A8, "Wrong size on KuroCompressLibrary_CompressFilesOrFoldersAsync");
static_assert(offsetof(KuroCompressLibrary_CompressFilesOrFoldersAsync, Paths) == 0x000000, "Member 'KuroCompressLibrary_CompressFilesOrFoldersAsync::Paths' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFilesOrFoldersAsync, DestPath) == 0x000010, "Member 'KuroCompressLibrary_CompressFilesOrFoldersAsync::DestPath' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFilesOrFoldersAsync, OnProgress) == 0x000020, "Member 'KuroCompressLibrary_CompressFilesOrFoldersAsync::OnProgress' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFilesOrFoldersAsync, OnCompressComplete) == 0x000048, "Member 'KuroCompressLibrary_CompressFilesOrFoldersAsync::OnCompressComplete' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFilesOrFoldersAsync, OnFail) == 0x000070, "Member 'KuroCompressLibrary_CompressFilesOrFoldersAsync::OnFail' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFilesOrFoldersAsync, bAutoIncludeFilesUnderFolder) == 0x000098, "Member 'KuroCompressLibrary_CompressFilesOrFoldersAsync::bAutoIncludeFilesUnderFolder' has a wrong offset!");
static_assert(offsetof(KuroCompressLibrary_CompressFilesOrFoldersAsync, MaxSingleFileReadSize) == 0x0000A0, "Member 'KuroCompressLibrary_CompressFilesOrFoldersAsync::MaxSingleFileReadSize' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.BitwiseLeftShift
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_BitwiseLeftShift final
{
public:
	int64                                         Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bit;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_BitwiseLeftShift) == 0x000008, "Wrong alignment on KuroMathLibrary_BitwiseLeftShift");
static_assert(sizeof(KuroMathLibrary_BitwiseLeftShift) == 0x000018, "Wrong size on KuroMathLibrary_BitwiseLeftShift");
static_assert(offsetof(KuroMathLibrary_BitwiseLeftShift, Source) == 0x000000, "Member 'KuroMathLibrary_BitwiseLeftShift::Source' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_BitwiseLeftShift, Bit) == 0x000008, "Member 'KuroMathLibrary_BitwiseLeftShift::Bit' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_BitwiseLeftShift, ReturnValue) == 0x000010, "Member 'KuroMathLibrary_BitwiseLeftShift::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.BitwiseRightShift
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_BitwiseRightShift final
{
public:
	int64                                         Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bit;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_BitwiseRightShift) == 0x000008, "Wrong alignment on KuroMathLibrary_BitwiseRightShift");
static_assert(sizeof(KuroMathLibrary_BitwiseRightShift) == 0x000018, "Wrong size on KuroMathLibrary_BitwiseRightShift");
static_assert(offsetof(KuroMathLibrary_BitwiseRightShift, Source) == 0x000000, "Member 'KuroMathLibrary_BitwiseRightShift::Source' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_BitwiseRightShift, Bit) == 0x000008, "Member 'KuroMathLibrary_BitwiseRightShift::Bit' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_BitwiseRightShift, ReturnValue) == 0x000010, "Member 'KuroMathLibrary_BitwiseRightShift::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.IntBitwiseAnd
// 0x000C (0x000C - 0x0000)
struct KuroMathLibrary_IntBitwiseAnd final
{
public:
	int32                                         Num1;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num2;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_IntBitwiseAnd) == 0x000004, "Wrong alignment on KuroMathLibrary_IntBitwiseAnd");
static_assert(sizeof(KuroMathLibrary_IntBitwiseAnd) == 0x00000C, "Wrong size on KuroMathLibrary_IntBitwiseAnd");
static_assert(offsetof(KuroMathLibrary_IntBitwiseAnd, Num1) == 0x000000, "Member 'KuroMathLibrary_IntBitwiseAnd::Num1' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_IntBitwiseAnd, Num2) == 0x000004, "Member 'KuroMathLibrary_IntBitwiseAnd::Num2' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_IntBitwiseAnd, ReturnValue) == 0x000008, "Member 'KuroMathLibrary_IntBitwiseAnd::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.IntBitwiseNot
// 0x0008 (0x0008 - 0x0000)
struct KuroMathLibrary_IntBitwiseNot final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_IntBitwiseNot) == 0x000004, "Wrong alignment on KuroMathLibrary_IntBitwiseNot");
static_assert(sizeof(KuroMathLibrary_IntBitwiseNot) == 0x000008, "Wrong size on KuroMathLibrary_IntBitwiseNot");
static_assert(offsetof(KuroMathLibrary_IntBitwiseNot, Num) == 0x000000, "Member 'KuroMathLibrary_IntBitwiseNot::Num' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_IntBitwiseNot, ReturnValue) == 0x000004, "Member 'KuroMathLibrary_IntBitwiseNot::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.IntBitwiseOr
// 0x000C (0x000C - 0x0000)
struct KuroMathLibrary_IntBitwiseOr final
{
public:
	int32                                         Num1;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num2;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_IntBitwiseOr) == 0x000004, "Wrong alignment on KuroMathLibrary_IntBitwiseOr");
static_assert(sizeof(KuroMathLibrary_IntBitwiseOr) == 0x00000C, "Wrong size on KuroMathLibrary_IntBitwiseOr");
static_assert(offsetof(KuroMathLibrary_IntBitwiseOr, Num1) == 0x000000, "Member 'KuroMathLibrary_IntBitwiseOr::Num1' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_IntBitwiseOr, Num2) == 0x000004, "Member 'KuroMathLibrary_IntBitwiseOr::Num2' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_IntBitwiseOr, ReturnValue) == 0x000008, "Member 'KuroMathLibrary_IntBitwiseOr::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.IntBitwiseXOr
// 0x000C (0x000C - 0x0000)
struct KuroMathLibrary_IntBitwiseXOr final
{
public:
	int32                                         Num1;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num2;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_IntBitwiseXOr) == 0x000004, "Wrong alignment on KuroMathLibrary_IntBitwiseXOr");
static_assert(sizeof(KuroMathLibrary_IntBitwiseXOr) == 0x00000C, "Wrong size on KuroMathLibrary_IntBitwiseXOr");
static_assert(offsetof(KuroMathLibrary_IntBitwiseXOr, Num1) == 0x000000, "Member 'KuroMathLibrary_IntBitwiseXOr::Num1' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_IntBitwiseXOr, Num2) == 0x000004, "Member 'KuroMathLibrary_IntBitwiseXOr::Num2' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_IntBitwiseXOr, ReturnValue) == 0x000008, "Member 'KuroMathLibrary_IntBitwiseXOr::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.KuroStringToInt64
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_KuroStringToInt64 final
{
public:
	class FString                                 StringNum;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_KuroStringToInt64) == 0x000008, "Wrong alignment on KuroMathLibrary_KuroStringToInt64");
static_assert(sizeof(KuroMathLibrary_KuroStringToInt64) == 0x000018, "Wrong size on KuroMathLibrary_KuroStringToInt64");
static_assert(offsetof(KuroMathLibrary_KuroStringToInt64, StringNum) == 0x000000, "Member 'KuroMathLibrary_KuroStringToInt64::StringNum' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_KuroStringToInt64, ReturnValue) == 0x000010, "Member 'KuroMathLibrary_KuroStringToInt64::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.LongBitwiseAnd
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_LongBitwiseAnd final
{
public:
	int64                                         Num1;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Num2;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_LongBitwiseAnd) == 0x000008, "Wrong alignment on KuroMathLibrary_LongBitwiseAnd");
static_assert(sizeof(KuroMathLibrary_LongBitwiseAnd) == 0x000018, "Wrong size on KuroMathLibrary_LongBitwiseAnd");
static_assert(offsetof(KuroMathLibrary_LongBitwiseAnd, Num1) == 0x000000, "Member 'KuroMathLibrary_LongBitwiseAnd::Num1' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_LongBitwiseAnd, Num2) == 0x000008, "Member 'KuroMathLibrary_LongBitwiseAnd::Num2' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_LongBitwiseAnd, ReturnValue) == 0x000010, "Member 'KuroMathLibrary_LongBitwiseAnd::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.LongBitwiseNot
// 0x0010 (0x0010 - 0x0000)
struct KuroMathLibrary_LongBitwiseNot final
{
public:
	int64                                         Num;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_LongBitwiseNot) == 0x000008, "Wrong alignment on KuroMathLibrary_LongBitwiseNot");
static_assert(sizeof(KuroMathLibrary_LongBitwiseNot) == 0x000010, "Wrong size on KuroMathLibrary_LongBitwiseNot");
static_assert(offsetof(KuroMathLibrary_LongBitwiseNot, Num) == 0x000000, "Member 'KuroMathLibrary_LongBitwiseNot::Num' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_LongBitwiseNot, ReturnValue) == 0x000008, "Member 'KuroMathLibrary_LongBitwiseNot::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.LongBitwiseOr
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_LongBitwiseOr final
{
public:
	int64                                         Num1;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Num2;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KuroMathLibrary_LongBitwiseOr) == 0x000008, "Wrong alignment on KuroMathLibrary_LongBitwiseOr");
static_assert(sizeof(KuroMathLibrary_LongBitwiseOr) == 0x000018, "Wrong size on KuroMathLibrary_LongBitwiseOr");
static_assert(offsetof(KuroMathLibrary_LongBitwiseOr, Num1) == 0x000000, "Member 'KuroMathLibrary_LongBitwiseOr::Num1' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_LongBitwiseOr, Num2) == 0x000008, "Member 'KuroMathLibrary_LongBitwiseOr::Num2' has a wrong offset!");
static_assert(offsetof(KuroMathLibrary_LongBitwiseOr, ReturnValue) == 0x000010, "Member 'KuroMathLibrary_LongBitwiseOr::ReturnValue' has a wrong offset!");

// Function KuroUtility.KuroMathLibrary.LongBitwiseXOr
// 0x0018 (0x0018 - 0x0000)
struct KuroMathLibrary_LongBitwiseXOr final
{
public:
