#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KuroInteractionEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct KuroInteractionEffect.SPModelShiftColorParameter
// 0x0020 (0x0020 - 0x0000)
struct FSPModelShiftColorParameter final
{
public:
	struct FLinearColor                           LowGrayColor;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HighGrayColor;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSPModelShiftColorParameter) == 0x000004, "Wrong alignment on FSPModelShiftColorParameter");
static_assert(sizeof(FSPModelShiftColorParameter) == 0x000020, "Wrong size on FSPModelShiftColorParameter");
static_assert(offsetof(FSPModelShiftColorParameter, LowGrayColor) == 0x000000, "Member 'FSPModelShiftColorParameter::LowGrayColor' has a wrong offset!");
static_assert(offsetof(FSPModelShiftColorParameter, HighGrayColor) == 0x000010, "Member 'FSPModelShiftColorParameter::HighGrayColor' has a wrong offset!");

// ScriptStruct KuroInteractionEffect.SPModelSCPMap
// 0x0050 (0x0050 - 0x0000)
struct FSPModelSCPMap final
{
public:
	TMap<int32, struct FSPModelShiftColorParameter> ModelColorMap;                                     // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSPModelSCPMap) == 0x000008, "Wrong alignment on FSPModelSCPMap");
static_assert(sizeof(FSPModelSCPMap) == 0x000050, "Wrong size on FSPModelSCPMap");
static_assert(offsetof(FSPModelSCPMap, ModelColorMap) == 0x000000, "Member 'FSPModelSCPMap::ModelColorMap' has a wrong offset!");

// ScriptStruct KuroInteractionEffect.KuroEnviInteractionData
// 0x0004 (0x0004 - 0x0000)
struct FKuroEnviInteractionData final
{
public:
	int32                                         WaterType;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FKuroEnviInteractionData) == 0x000004, "Wrong alignment on FKuroEnviInteractionData");
static_assert(sizeof(FKuroEnviInteractionData) == 0x000004, "Wrong size on FKuroEnviInteractionData");
static_assert(offsetof(FKuroEnviInteractionData, WaterType) == 0x000000, "Member 'FKuroEnviInteractionData::WaterType' has a wrong offset!");

}

