#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelGamePlayBlueprintFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.ClearAllScanEffects
// 0x0008 (0x0008 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects) == 0x000008, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects, __WorldContext) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ClearAllScanEffects::__WorldContext' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.SceneInteractionBind
// 0x0030 (0x0030 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind final
{
public:
	class AActor*                                 actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 seqName;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 eventName;                                         // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind) == 0x000030, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind, actor) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind::actor' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind, seqName) == 0x000008, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind::seqName' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind, eventName) == 0x000018, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind::eventName' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind, __WorldContext) == 0x000028, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_SceneInteractionBind::__WorldContext' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.GetScanMaxDistance
// 0x0010 (0x0010 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance) == 0x000010, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance, __WorldContext) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance, ReturnValue) == 0x000008, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetScanMaxDistance::ReturnValue' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.GetScanInteractionEffectMaxDistance
// 0x0010 (0x0010 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance) == 0x000010, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance, __WorldContext) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance, ReturnValue) == 0x000008, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_GetScanInteractionEffectMaxDistance::ReturnValue' has a wrong offset!");

// Function LevelGamePlayBlueprintFunctionLibrary.LevelGamePlayBlueprintFunctionLibrary_C.ApplyScanEffect
// 0x0020 (0x0020 - 0x0000)
struct LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect final
{
public:
	class AActor*                                 inActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         type;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect) == 0x000008, "Wrong alignment on LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect");
static_assert(sizeof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect) == 0x000020, "Wrong size on LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect, inActor) == 0x000000, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect::inActor' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect, type) == 0x000008, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect::type' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect, __WorldContext) == 0x000010, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect, ReturnValue) == 0x000018, "Member 'LevelGamePlayBlueprintFunctionLibrary_C_ApplyScanEffect::ReturnValue' has a wrong offset!");

}

