#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "LGUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "LTween_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Niagara_classes.hpp"
#include "InputCore_structs.hpp"
#include "KuroCurve_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class LGUI.UIBaseActor
// 0x00E8 (0x0398 - 0x02B0)
class AUIBaseActor : public AActor
{
public:
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, class ALevelSequenceActor*> CurBindingSeqActors;                               // 0x02B8(0x0050)(Transient, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& sequenceName, const class FString& eventName)> OnSequencePlayEvent;                               // 0x0308(0x0028)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	struct FGuid                                  LGUIGuid;                                          // 0x0330(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FSoftObjectPath, class USequencePlayContext*> AllSequencePlayContexts;                           // 0x0340(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_390[0x8];                                      // 0x0390(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateAllChildrenInteraction();
	void CleanIdleAnimSeqActorCache();
	void ClearAllSequence();
	ESequenceLoadState GetLoadStateOfSequenceByKey(const class FString& Key);
	struct FSequenceInfo GetSeqInfoByKey(const class FString& Key);
	class USequencePlayContext* GetSequencePlayContextOfKey(const class FString& Key);
	class ALevelSequenceActor* GetSequencePlayerByKey(const class FString& Name_0);
	void LoadSequenceAssetAsyncByKey(const class FString& Key, const TDelegate<void(class ULevelSequence* Sequence)>& OnLoaded);
	void PauseSequenceByKey(const class FString& Name_0);
	void PlayLevelSequenceByKey(const class FString& Name_0);
	void ReplaySequenceByKey(const class FString& Name_0);
	void ResumeSequenceByKey(const class FString& Name_0);
	void SequenceJumpToEnd(const struct FSoftObjectPath& SoftPath);
	void SequenceJumpToSecondByKey(const class FString& Name_0, const struct FFrameTime& Time);
	void SequencePlayReverseByKey(const class FString& Name_0);
	void StopSequenceByKey(const class FString& Name_0);

	void ExecuteSequencePlayEvent(const class FString& sequenceName, const class FString& eventName) const;
	class UUIItem* GetUIItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIBaseActor">();
	}
	static class AUIBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUIBaseActor>();
	}
};
static_assert(alignof(AUIBaseActor) == 0x000008, "Wrong alignment on AUIBaseActor");
static_assert(sizeof(AUIBaseActor) == 0x000398, "Wrong size on AUIBaseActor");
static_assert(offsetof(AUIBaseActor, CurBindingSeqActors) == 0x0002B8, "Member 'AUIBaseActor::CurBindingSeqActors' has a wrong offset!");
static_assert(offsetof(AUIBaseActor, OnSequencePlayEvent) == 0x000308, "Member 'AUIBaseActor::OnSequencePlayEvent' has a wrong offset!");
static_assert(offsetof(AUIBaseActor, LGUIGuid) == 0x000330, "Member 'AUIBaseActor::LGUIGuid' has a wrong offset!");
static_assert(offsetof(AUIBaseActor, AllSequencePlayContexts) == 0x000340, "Member 'AUIBaseActor::AllSequencePlayContexts' has a wrong offset!");

// Class LGUI.UIPolygonActor
// 0x0008 (0x03A0 - 0x0398)
class AUIPolygonActor final : public AUIBaseActor
{
public:
	class UUIPolygon*                             UIPolygon;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIPolygonActor">();
	}
	static class AUIPolygonActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUIPolygonActor>();
	}
};
static_assert(alignof(AUIPolygonActor) == 0x000008, "Wrong alignment on AUIPolygonActor");
static_assert(sizeof(AUIPolygonActor) == 0x0003A0, "Wrong size on AUIPolygonActor");
static_assert(offsetof(AUIPolygonActor, UIPolygon) == 0x000398, "Member 'AUIPolygonActor::UIPolygon' has a wrong offset!");

// Class LGUI.LGUIPrefabCheckerInterface
// 0x0000 (0x0030 - 0x0030)
class ILGUIPrefabCheckerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIPrefabCheckerInterface">();
	}
	static class ILGUIPrefabCheckerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILGUIPrefabCheckerInterface>();
	}
};
static_assert(alignof(ILGUIPrefabCheckerInterface) == 0x000008, "Wrong alignment on ILGUIPrefabCheckerInterface");
static_assert(sizeof(ILGUIPrefabCheckerInterface) == 0x000030, "Wrong size on ILGUIPrefabCheckerInterface");

// Class LGUI.GuideHookRegistry
// 0x0050 (0x0110 - 0x00C0)
class UGuideHookRegistry final : public UActorComponent
{
public:
	TMap<class FString, TWeakObjectPtr<class AActor>> GuideHookComponents;                               // 0x00C0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GuideHookRegistry">();
	}
	static class UGuideHookRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuideHookRegistry>();
	}
};
static_assert(alignof(UGuideHookRegistry) == 0x000008, "Wrong alignment on UGuideHookRegistry");
static_assert(sizeof(UGuideHookRegistry) == 0x000110, "Wrong size on UGuideHookRegistry");
static_assert(offsetof(UGuideHookRegistry, GuideHookComponents) == 0x0000C0, "Member 'UGuideHookRegistry::GuideHookComponents' has a wrong offset!");

// Class LGUI.PrefabActorHierarchyData
// 0x0000 (0x0030 - 0x0030)
class UPrefabActorHierarchyData final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabActorHierarchyData">();
	}
	static class UPrefabActorHierarchyData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabActorHierarchyData>();
	}
};
static_assert(alignof(UPrefabActorHierarchyData) == 0x000008, "Wrong alignment on UPrefabActorHierarchyData");
static_assert(sizeof(UPrefabActorHierarchyData) == 0x000030, "Wrong size on UPrefabActorHierarchyData");

// Class LGUI.KuroWorldMapUIParams
// 0x0020 (0x00E0 - 0x00C0)
class UKuroWorldMapUIParams final : public UActorComponent
{
public:
	int32                                         MarkMenuRectSize;                                  // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FocusMark_AnchoredPosition;                        // 0x00C4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TweenTime;                                         // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   TweenTypeEase;                                     // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GamePadTweenTime;                                  // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GamePadMoveSpeed;                                  // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KuroWorldMapUIParams">();
	}
	static class UKuroWorldMapUIParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKuroWorldMapUIParams>();
	}
};
static_assert(alignof(UKuroWorldMapUIParams) == 0x000008, "Wrong alignment on UKuroWorldMapUIParams");
static_assert(sizeof(UKuroWorldMapUIParams) == 0x0000E0, "Wrong size on UKuroWorldMapUIParams");
static_assert(offsetof(UKuroWorldMapUIParams, MarkMenuRectSize) == 0x0000C0, "Member 'UKuroWorldMapUIParams::MarkMenuRectSize' has a wrong offset!");
static_assert(offsetof(UKuroWorldMapUIParams, FocusMark_AnchoredPosition) == 0x0000C4, "Member 'UKuroWorldMapUIParams::FocusMark_AnchoredPosition' has a wrong offset!");
static_assert(offsetof(UKuroWorldMapUIParams, TweenTime) == 0x0000CC, "Member 'UKuroWorldMapUIParams::TweenTime' has a wrong offset!");
static_assert(offsetof(UKuroWorldMapUIParams, TweenTypeEase) == 0x0000D0, "Member 'UKuroWorldMapUIParams::TweenTypeEase' has a wrong offset!");
static_assert(offsetof(UKuroWorldMapUIParams, GamePadTweenTime) == 0x0000D4, "Member 'UKuroWorldMapUIParams::GamePadTweenTime' has a wrong offset!");
static_assert(offsetof(UKuroWorldMapUIParams, GamePadMoveSpeed) == 0x0000D8, "Member 'UKuroWorldMapUIParams::GamePadMoveSpeed' has a wrong offset!");

// Class LGUI.LGUIBehaviour
// 0x0040 (0x0100 - 0x00C0)
class ULGUIBehaviour : public UActorComponent
{
public:
	bool                                          enable;                                            // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaTime)>              OnLateUpdate;                                      // 0x00C8(0x0028)(Edit, ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x4];                                       // 0x00F0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UUIItem>                 RootUIComp;                                        // 0x00F4(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AwakeBP();
	class AActor* InstantiateActor(class AActor* OriginObject, class USceneComponent* Parent);
	class AActor* InstantiatePrefab(class ULGUIPrefab* OriginObject, class USceneComponent* Parent);
	class AActor* InstantiatePrefabWithTransform(class ULGUIPrefab* OriginObject, class USceneComponent* Parent, const struct FVector& Location, const struct FRotator& Rotation, const struct FVector& Scale);
	void LateUpdateBP(float DeltaTime);
	void OnDestroyBP();
	void OnDisableBP();
	void OnEnableBP();
	void OnUIActiveInHierarchyBP(bool activeOrInactive);
	void OnUIAttachmentChangedBP();
	void OnUIChildAcitveInHierarchyBP(class UUIItem* child, bool ativeOrInactive);
	void OnUIChildAttachmentChangedBP(class UUIItem* child, bool attachOrDetach);
	void OnUIChildHierarchyIndexChangedBP(class UUIItem* child);
	void OnUIDimensionsChangedBP(bool positionChanged, bool sizeChanged);
	void OnUIInteractionStateChangedBP(bool interactableOrNot);
	void SetEnable(bool value);
	void StartBP();
	void UpdateBP(float DeltaTime);

	bool CheckRootUIComponent() const;
	bool GetEnable() const;
	bool GetIsActiveAndEnable() const;
	class UUIItem* GetRootComponent() const;
	class USceneComponent* GetRootSceneComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIBehaviour">();
	}
	static class ULGUIBehaviour* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBehaviour>();
	}
};
static_assert(alignof(ULGUIBehaviour) == 0x000008, "Wrong alignment on ULGUIBehaviour");
static_assert(sizeof(ULGUIBehaviour) == 0x000100, "Wrong size on ULGUIBehaviour");
static_assert(offsetof(ULGUIBehaviour, enable) == 0x0000C0, "Member 'ULGUIBehaviour::enable' has a wrong offset!");
static_assert(offsetof(ULGUIBehaviour, OnLateUpdate) == 0x0000C8, "Member 'ULGUIBehaviour::OnLateUpdate' has a wrong offset!");
static_assert(offsetof(ULGUIBehaviour, RootUIComp) == 0x0000F4, "Member 'ULGUIBehaviour::RootUIComp' has a wrong offset!");

// Class LGUI.UISelectableComponent
// 0x02D0 (0x03D0 - 0x0100)
class UUISelectableComponent : public ULGUIBehaviour
{
public:
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AUIBaseActor>            TransitionActor;                                   // 0x0120(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AllowEventBubbleUp;                                // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUISelectableTransitionType                   Transition;                                        // 0x0129(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              TransitionTweener;                                 // 0x0130(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 NormalColor;                                       // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 HighlightedColor;                                  // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 PressedColor;                                      // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 DisabledColor;                                     // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 SelectedColor;                                     // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FadeDuration;                                      // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULGUISpriteData_BaseObject*             NormalSprite;                                      // 0x0150(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULGUISpriteData_BaseObject*             HighlightedSprite;                                 // 0x0158(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULGUISpriteData_BaseObject*             PressedSprite;                                     // 0x0160(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULGUISpriteData_BaseObject*             DisabledSprite;                                    // 0x0168(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULGUISpriteData_BaseObject*             SelectedSprite;                                    // 0x0170(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AUIBaseActor>            NormalItem;                                        // 0x0178(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AUIBaseActor>            HighlightedItem;                                   // 0x0180(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AUIBaseActor>            PressedItem;                                       // 0x0188(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AUIBaseActor>            DisabledItem;                                      // 0x0190(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AUIBaseActor>            SelectedItem;                                      // 0x0198(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUISelectableSelectionState                   CurrentSelectionState;                             // 0x01A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bApplyColorToChildren;                             // 0x01A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoScrollOnSelected;                             // 0x01A5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  NavigationGroupParentComponentActor;               // 0x01A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UUISelectableComponent>  NavigationGroupParentComponent;                    // 0x01B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  NavigationGroupComponentActor;                     // 0x01B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UUINavigationGroupComponent> NavigationGroupComponent;                          // 0x01C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  ScrollViewActor;                                   // 0x01C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UUIScrollViewWithScrollbarComponent> ScrollViewComponent;                               // 0x01D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UUISelectableTransitionComponent> TransitionComp;                                    // 0x01D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUISelectableNavigationMode                   NavigationLeft;                                    // 0x01E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGUIComponentReference                NavigationLeftSpecific;                            // 0x01E8(0x0028)(Edit, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	EUISelectableNavigationMode                   NavigationRight;                                   // 0x0210(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGUIComponentReference                NavigationRightSpecific;                           // 0x0218(0x0028)(Edit, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	EUISelectableNavigationMode                   NavigationUp;                                      // 0x0240(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGUIComponentReference                NavigationUpSpecific;                              // 0x0248(0x0028)(Edit, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	EUISelectableNavigationMode                   NavigationDown;                                    // 0x0270(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGUIComponentReference                NavigationDownSpecific;                            // 0x0278(0x0028)(Edit, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	EUISelectableNavigationMode                   NavigationNext;                                    // 0x02A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGUIComponentReference                NavigationNextSpecific;                            // 0x02A8(0x0028)(Edit, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	EUISelectableNavigationMode                   NavigationPrev;                                    // 0x02D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGUIComponentReference                NavigationPrevSpecific;                            // 0x02D8(0x0028)(Edit, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<EStateTransferType, struct FAnimationPlayInfo> AnimationConfig;                                   // 0x0300(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_350[0x8];                                      // 0x0350(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULevelSequence*>                 AllAnims;                                          // 0x0358(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TDelegate<void(bool CurrentSelfInteractive)>  OnSelfInteractiveChanged;                          // 0x0368(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	bool                                          IsSelfInteractive;                                 // 0x0390(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanClickWhenDisable;                              // 0x0391(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_392[0x16];                                     // 0x0392(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             FocusListenerDelegate;                             // 0x03A8(0x0028)(Edit, ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static void ResetSelectableDelegate();
	static void SetSelectableDelegate(const TDelegate<void(class UUISelectableComponent* SelectableComponent, bool bCreate)>& Delegate);
	static void SetShieldMobileHighlight(const bool Value);
	static void SetShieldPCPress(const bool Value);

	void ApplySelectionState(bool bImmediateSet);
	bool GetCanClickWhenDisable();
	EUISelectableSelectionState GetSelectionState();
	bool GetSelfInteractive();
	void NotifyFocusListener();
	void PlayUIAnimationByPlayInfo(const struct FAnimationPlayInfo& PlayInfo);
	void SetCanClickWhenDisable(bool CanClickEnbale);
	void SetHighlightedColor(const struct FColor& NewColor);
	void SetHighlightedSprite(class ULGUISpriteData_BaseObject* NewSprite);
	void SetIsCustomAnim(bool bIsCustomAnim);
	void SetIsCustomTransition(bool bIsCustomTransition);
	void SetNavigationDown(EUISelectableNavigationMode value);
	void SetNavigationDownExplicit(class UUISelectableComponent* value);
	void SetNavigationGroup(class UUINavigationGroupComponent* Component);
	void SetNavigationGroupParent(class UUISelectableComponent* Component);
	void SetNavigationLeft(EUISelectableNavigationMode value);
	void SetNavigationLeftExplicit(class UUISelectableComponent* value);
	void SetNavigationNext(EUISelectableNavigationMode value);
	void SetNavigationNextExplicit(class UUISelectableComponent* value);
	void SetNavigationPrev(EUISelectableNavigationMode value);
	void SetNavigationPrevExplicit(class UUISelectableComponent* value);
	void SetNavigationRight(EUISelectableNavigationMode value);
	void SetNavigationRightExplicit(class UUISelectableComponent* value);
	void SetNavigationUp(EUISelectableNavigationMode value);
	void SetNavigationUpExplicit(class UUISelectableComponent* value);
	void SetNormalColor(const struct FColor& NewColor);
	void SetNormalSprite(class ULGUISpriteData_BaseObject* NewSprite);
	void SetPressedColor(const struct FColor& NewColor);
	void SetPressedSprite(class ULGUISpriteData_BaseObject* NewSprite);
	void SetScrollView(class UUIScrollViewWithScrollbarComponent* Component);
	void SetSelectionState(EUISelectableSelectionState NewState);
	void SetSelfInteractive(bool InteractiveEnable);
	void SetTransitionTarget(class AUIBaseActor* value);

	class ULGUISpriteData_BaseObject* GetDisabledSprite() const;
	struct FColor GetHighlightedColor() const;
	class ULGUISpriteData_BaseObject* GetHighlightedSprite() const;
	EUISelectableNavigationMode GetNavigationDown() const;
	class UUISelectableComponent* GetNavigationDownExplicit() const;
	EUISelectableNavigationMode GetNavigationLeft() const;
	class UUISelectableComponent* GetNavigationLeftExplicit() const;
	EUISelectableNavigationMode GetNavigationNext() const;
	class UUISelectableComponent* GetNavigationNextExplicit() const;
	EUISelectableNavigationMode GetNavigationPrev() const;
	class UUISelectableComponent* GetNavigationPrevExplicit() const;
	EUISelectableNavigationMode GetNavigationRight() const;
	class UUISelectableComponent* GetNavigationRightExplicit() const;
	EUISelectableNavigationMode GetNavigationUp() const;
	class UUISelectableComponent* GetNavigationUpExplicit() const;
	struct FColor GetNormalColor() const;
	class ULGUISpriteData_BaseObject* GetNormalSprite() const;
	struct FColor GetPressedColor() const;
	class ULGUISpriteData_BaseObject* GetPressedSprite() const;
	class ULGUISpriteData_BaseObject* GetSelectedSprite() const;
	class AUIBaseActor* GetTransitionTarget() const;
	bool IsInteractable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UISelectableComponent">();
	}
	static class UUISelectableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUISelectableComponent>();
	}
};
static_assert(alignof(UUISelectableComponent) == 0x000008, "Wrong alignment on UUISelectableComponent");
static_assert(sizeof(UUISelectableComponent) == 0x0003D0, "Wrong size on UUISelectableComponent");
static_assert(offsetof(UUISelectableComponent, TransitionActor) == 0x000120, "Member 'UUISelectableComponent::TransitionActor' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, AllowEventBubbleUp) == 0x000128, "Member 'UUISelectableComponent::AllowEventBubbleUp' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, Transition) == 0x000129, "Member 'UUISelectableComponent::Transition' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, TransitionTweener) == 0x000130, "Member 'UUISelectableComponent::TransitionTweener' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NormalColor) == 0x000138, "Member 'UUISelectableComponent::NormalColor' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, HighlightedColor) == 0x00013C, "Member 'UUISelectableComponent::HighlightedColor' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, PressedColor) == 0x000140, "Member 'UUISelectableComponent::PressedColor' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, DisabledColor) == 0x000144, "Member 'UUISelectableComponent::DisabledColor' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, SelectedColor) == 0x000148, "Member 'UUISelectableComponent::SelectedColor' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, FadeDuration) == 0x00014C, "Member 'UUISelectableComponent::FadeDuration' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NormalSprite) == 0x000150, "Member 'UUISelectableComponent::NormalSprite' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, HighlightedSprite) == 0x000158, "Member 'UUISelectableComponent::HighlightedSprite' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, PressedSprite) == 0x000160, "Member 'UUISelectableComponent::PressedSprite' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, DisabledSprite) == 0x000168, "Member 'UUISelectableComponent::DisabledSprite' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, SelectedSprite) == 0x000170, "Member 'UUISelectableComponent::SelectedSprite' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NormalItem) == 0x000178, "Member 'UUISelectableComponent::NormalItem' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, HighlightedItem) == 0x000180, "Member 'UUISelectableComponent::HighlightedItem' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, PressedItem) == 0x000188, "Member 'UUISelectableComponent::PressedItem' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, DisabledItem) == 0x000190, "Member 'UUISelectableComponent::DisabledItem' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, SelectedItem) == 0x000198, "Member 'UUISelectableComponent::SelectedItem' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, CurrentSelectionState) == 0x0001A0, "Member 'UUISelectableComponent::CurrentSelectionState' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, bApplyColorToChildren) == 0x0001A4, "Member 'UUISelectableComponent::bApplyColorToChildren' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, bAutoScrollOnSelected) == 0x0001A5, "Member 'UUISelectableComponent::bAutoScrollOnSelected' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationGroupParentComponentActor) == 0x0001A8, "Member 'UUISelectableComponent::NavigationGroupParentComponentActor' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationGroupParentComponent) == 0x0001B0, "Member 'UUISelectableComponent::NavigationGroupParentComponent' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationGroupComponentActor) == 0x0001B8, "Member 'UUISelectableComponent::NavigationGroupComponentActor' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationGroupComponent) == 0x0001C0, "Member 'UUISelectableComponent::NavigationGroupComponent' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, ScrollViewActor) == 0x0001C8, "Member 'UUISelectableComponent::ScrollViewActor' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, ScrollViewComponent) == 0x0001D0, "Member 'UUISelectableComponent::ScrollViewComponent' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, TransitionComp) == 0x0001D8, "Member 'UUISelectableComponent::TransitionComp' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationLeft) == 0x0001E0, "Member 'UUISelectableComponent::NavigationLeft' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationLeftSpecific) == 0x0001E8, "Member 'UUISelectableComponent::NavigationLeftSpecific' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationRight) == 0x000210, "Member 'UUISelectableComponent::NavigationRight' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationRightSpecific) == 0x000218, "Member 'UUISelectableComponent::NavigationRightSpecific' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationUp) == 0x000240, "Member 'UUISelectableComponent::NavigationUp' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationUpSpecific) == 0x000248, "Member 'UUISelectableComponent::NavigationUpSpecific' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationDown) == 0x000270, "Member 'UUISelectableComponent::NavigationDown' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationDownSpecific) == 0x000278, "Member 'UUISelectableComponent::NavigationDownSpecific' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationNext) == 0x0002A0, "Member 'UUISelectableComponent::NavigationNext' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationNextSpecific) == 0x0002A8, "Member 'UUISelectableComponent::NavigationNextSpecific' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationPrev) == 0x0002D0, "Member 'UUISelectableComponent::NavigationPrev' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, NavigationPrevSpecific) == 0x0002D8, "Member 'UUISelectableComponent::NavigationPrevSpecific' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, AnimationConfig) == 0x000300, "Member 'UUISelectableComponent::AnimationConfig' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, AllAnims) == 0x000358, "Member 'UUISelectableComponent::AllAnims' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, OnSelfInteractiveChanged) == 0x000368, "Member 'UUISelectableComponent::OnSelfInteractiveChanged' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, IsSelfInteractive) == 0x000390, "Member 'UUISelectableComponent::IsSelfInteractive' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, bCanClickWhenDisable) == 0x000391, "Member 'UUISelectableComponent::bCanClickWhenDisable' has a wrong offset!");
static_assert(offsetof(UUISelectableComponent, FocusListenerDelegate) == 0x0003A8, "Member 'UUISelectableComponent::FocusListenerDelegate' has a wrong offset!");

// Class LGUI.UIButtonComponent
// 0x0288 (0x0658 - 0x03D0)
class UUIButtonComponent : public UUISelectableComponent
{
public:
	uint8                                         Pad_3D0[0x8];                                      // 0x03D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGUIDrawableEvent                     OnClick;                                           // 0x03D8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F0[0x18];                                     // 0x03F0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAllowChangeCursorStyleWhenEnter;                  // 0x0408(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             OnClickCallBack;                                   // 0x0410(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnPointDownCallBack;                               // 0x0438(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnPointUpCallBack;                                 // 0x0460(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnPointCancelCallBack;                             // 0x0488(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnPointEnterCallBack;                              // 0x04B0(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnPointExitCallBack;                               // 0x04D8(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(class ULGUIPointerEventData* eventData)> OnPointerBeginDragCallBack;                        // 0x0500(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(class ULGUIPointerEventData* eventData)> OnPointerDragCallBack;                             // 0x0528(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(class ULGUIPointerEventData* eventData)> OnPointerEndDragCallBack;                          // 0x0550(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AkAudioEvent;                                      // 0x0578(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& eventName)> OnPostAudioEvent;                                  // 0x0598(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMap<EButtonAudioStateTransferType, struct FSoftObjectPath> AudioConfig;                                       // 0x05C0(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        LongPressAudioEvent;                               // 0x0610(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EButtonAudioStateTransferType StateTransfer, const class FString& EventName)> OnPostAudioStateEvent;                             // 0x0630(0x0028)(Edit, ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	bool OnPointerDown_Implementation(class ULGUIPointerEventData* eventData);
	struct FLGUIDelegateHandleWrapper RegisterClickEvent(const TDelegate<void()>& InDelegate);
	void UnregisterClickEvent(const struct FLGUIDelegateHandleWrapper& InDelegateHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIButtonComponent">();
	}
	static class UUIButtonComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIButtonComponent>();
	}
};
static_assert(alignof(UUIButtonComponent) == 0x000008, "Wrong alignment on UUIButtonComponent");
static_assert(sizeof(UUIButtonComponent) == 0x000658, "Wrong size on UUIButtonComponent");
static_assert(offsetof(UUIButtonComponent, OnClick) == 0x0003D8, "Member 'UUIButtonComponent::OnClick' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, bAllowChangeCursorStyleWhenEnter) == 0x000408, "Member 'UUIButtonComponent::bAllowChangeCursorStyleWhenEnter' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnClickCallBack) == 0x000410, "Member 'UUIButtonComponent::OnClickCallBack' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPointDownCallBack) == 0x000438, "Member 'UUIButtonComponent::OnPointDownCallBack' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPointUpCallBack) == 0x000460, "Member 'UUIButtonComponent::OnPointUpCallBack' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPointCancelCallBack) == 0x000488, "Member 'UUIButtonComponent::OnPointCancelCallBack' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPointEnterCallBack) == 0x0004B0, "Member 'UUIButtonComponent::OnPointEnterCallBack' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPointExitCallBack) == 0x0004D8, "Member 'UUIButtonComponent::OnPointExitCallBack' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPointerBeginDragCallBack) == 0x000500, "Member 'UUIButtonComponent::OnPointerBeginDragCallBack' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPointerDragCallBack) == 0x000528, "Member 'UUIButtonComponent::OnPointerDragCallBack' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPointerEndDragCallBack) == 0x000550, "Member 'UUIButtonComponent::OnPointerEndDragCallBack' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, AkAudioEvent) == 0x000578, "Member 'UUIButtonComponent::AkAudioEvent' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPostAudioEvent) == 0x000598, "Member 'UUIButtonComponent::OnPostAudioEvent' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, AudioConfig) == 0x0005C0, "Member 'UUIButtonComponent::AudioConfig' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, LongPressAudioEvent) == 0x000610, "Member 'UUIButtonComponent::LongPressAudioEvent' has a wrong offset!");
static_assert(offsetof(UUIButtonComponent, OnPostAudioStateEvent) == 0x000630, "Member 'UUIButtonComponent::OnPostAudioStateEvent' has a wrong offset!");

// Class LGUI.UISelectableButtonComponent
// 0x0008 (0x0660 - 0x0658)
class UUISelectableButtonComponent final : public UUIButtonComponent
{
public:
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetForceSelect(bool forceSelect);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UISelectableButtonComponent">();
	}
	static class UUISelectableButtonComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUISelectableButtonComponent>();
	}
};
static_assert(alignof(UUISelectableButtonComponent) == 0x000008, "Wrong alignment on UUISelectableButtonComponent");
static_assert(sizeof(UUISelectableButtonComponent) == 0x000660, "Wrong size on UUISelectableButtonComponent");

// Class LGUI.LGUIPrefabHelperObject
// 0x0000 (0x0030 - 0x0030)
class ULGUIPrefabHelperObject final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIPrefabHelperObject">();
	}
	static class ULGUIPrefabHelperObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIPrefabHelperObject>();
	}
};
static_assert(alignof(ULGUIPrefabHelperObject) == 0x000008, "Wrong alignment on ULGUIPrefabHelperObject");
static_assert(sizeof(ULGUIPrefabHelperObject) == 0x000030, "Wrong size on ULGUIPrefabHelperObject");

// Class LGUI.LGUIBaseRayEmitter
// 0x0030 (0x00F0 - 0x00C0)
class ULGUIBaseRayEmitter : public UActorComponent
{
public:
	float                                         clickThreshold;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          holdToDrag;                                        // 0x00C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         holdToDragTime;                                    // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x24];                                      // 0x00CC(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetClickThreshold();
	void GetInitialValue(float* OutClickThreshold, bool* OutHoldToDrag, float* OutHoldToDragTime);
	void SetClickThreshold(float value);
	void SetInitialValue(float InClickThreshold, bool InHoldToDrag, float InHoldToDragTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIBaseRayEmitter">();
	}
	static class ULGUIBaseRayEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUIBaseRayEmitter>();
	}
};
static_assert(alignof(ULGUIBaseRayEmitter) == 0x000008, "Wrong alignment on ULGUIBaseRayEmitter");
static_assert(sizeof(ULGUIBaseRayEmitter) == 0x0000F0, "Wrong size on ULGUIBaseRayEmitter");
static_assert(offsetof(ULGUIBaseRayEmitter, clickThreshold) == 0x0000C0, "Member 'ULGUIBaseRayEmitter::clickThreshold' has a wrong offset!");
static_assert(offsetof(ULGUIBaseRayEmitter, holdToDrag) == 0x0000C4, "Member 'ULGUIBaseRayEmitter::holdToDrag' has a wrong offset!");
static_assert(offsetof(ULGUIBaseRayEmitter, holdToDragTime) == 0x0000C8, "Member 'ULGUIBaseRayEmitter::holdToDragTime' has a wrong offset!");

// Class LGUI.LGUIPrefabHelperActor
// 0x0000 (0x02B0 - 0x02B0)
class ALGUIPrefabHelperActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUIPrefabHelperActor">();
	}
	static class ALGUIPrefabHelperActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALGUIPrefabHelperActor>();
	}
};
static_assert(alignof(ALGUIPrefabHelperActor) == 0x000008, "Wrong alignment on ALGUIPrefabHelperActor");
static_assert(sizeof(ALGUIPrefabHelperActor) == 0x0002B0, "Wrong size on ALGUIPrefabHelperActor");

// Class LGUI.LGUI_CenterScreenRayemitter
// 0x0008 (0x00F8 - 0x00F0)
class ULGUI_CenterScreenRayemitter final : public ULGUIBaseRayEmitter
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGUI_CenterScreenRayemitter">();
	}
	static class ULGUI_CenterScreenRayemitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGUI_CenterScreenRayemitter>();
	}
};
static_assert(alignof(ULGUI_CenterScreenRayemitter) == 0x000008, "Wrong alignment on ULGUI_CenterScreenRayemitter");
static_assert(sizeof(ULGUI_CenterScreenRayemitter) == 0x0000F8, "Wrong size on ULGUI_CenterScreenRayemitter");

// Class LGUI.UIItem
// 0x0320 (0x0540 - 0x0220)
class UUIItem : public USceneComponent
{
public:
	uint8                                         Pad_218[0xD8];                                     // 0x0218(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIWidget                              widget;                                            // 0x02F0(0x0040)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIItem*>                        UIChildren;                                        // 0x0340(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          inheritAlpha;                                      // 0x0350(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 Color;                                             // 0x0354(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Alpha;                                             // 0x0358(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Width;                                             // 0x035C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Height;                                            // 0x0360(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          useChangeColor;                                    // 0x0364(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 changeColor;                                       // 0x0368(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FSequenceInfo>     LevelSequences;                                    // 0x0370(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FLGUILevelSequenceBindings> LevelSequenceBindings;                             // 0x03C0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        HardRefAssets;                                     // 0x0410(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_420[0xC];                                      // 0x0420(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  RenderCanvasActor;                                 // 0x042C(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_434[0x6D];                                     // 0x0434(0x006D)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsRenderAfterBlur;                                // 0x04A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRenderBeforeBloom;                              // 0x04A2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRenderBeforeUpScale;                            // 0x04A3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A4[0x1];                                      // 0x04A4(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsUIActive;                                       // 0x04A5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bClipOutOfViewport;                                // 0x04A6(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A7[0x5];                                      // 0x04A7(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         hierarchyIndex;                                    // 0x04AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         flattenHierarchyIndex;                             // 0x04B0(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AdditionalIndexDelta;                              // 0x04B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 displayName;                                       // 0x04C0(0x0010)(Edit, ZeroConstructor, EditConst, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRaycastTarget;                                    // 0x04D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBubbleUpToParent;                                 // 0x04D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETraceTypeQuery                               traceChannel;                                      // 0x04D2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D3[0x65];                                     // 0x04D3(0x0065)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AUIBaseActor>            DebugCollisionLine;                                // 0x0538(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void GetAllAttachUIChildren(TArray<class UUIItem*>* OutArray);
	const struct FVector GetLGUISpaceAbsolutePosition();
	const struct FVector GetLGUISpaceAbsolutePositionByPivot(const struct FVector2D& Pivot);
	const struct FVector GetLGUISpaceCenterAbsolutePosition();
	bool GetOverlapWith(class UUIItem* UIItem);
	class UUIItem* GetParentAsUIItem();
	struct FVector2D GetPositionInScreen(bool bIsScaledByDPI);
	struct FVector2D GetPositionInViewPort(bool bIsScaledByDPI);
	class ULGUICanvas* GetRenderCanvas();
	bool IsBoundOutOfScreen();
	bool IsRenderTargetUI();
	bool IsScreenSpaceOverlayUI();
	bool IsWorldSpaceUI();
	void PlayUIItemAlphaTween(float StartValue, float EndValue, float Duration);
	void PlayUIItemScaleTween(float StartValue, float EndValue, float Duration);
	void ReverseChildrenIndex();
	void SetAlpha(float newAlpha);
	void SetAnchorAlign(EUIAnchorHorizontalAlign HAlign, EUIAnchorVerticalAlign VAlign);
	void SetAnchorHAlign(EUIAnchorHorizontalAlign align);
	void SetAnchorOffset(const struct FVector2D& NewOffset);
	void SetAnchorOffsetX(float NewOffset);
	void SetAnchorOffsetY(float NewOffset);
	void SetAnchorVAlign(EUIAnchorVerticalAlign align);
	void SetAsFirstHierarchy();
	void SetAsLastHierarchy();
	void SetBubbleUpToParent(bool NewBool);
	void SetChangeColor(bool bUseChangeColor, const struct FColor& NewColor);
	void SetColor(const struct FColor& NewColor);
	void SetDepth(int32 depth, bool propagateToChildren);
	void SetDisplayName(const class FString& InName);
	void SetHeight(float NewHeight);
	void SetHierarchyIndex(int32 InInt);
	void SetHorizontalStretch(const struct FVector2D& newStretch);
	void SetIsUIActive(bool active);
	void SetLGUISpaceAbsolutePosition(const struct FVector& Pos);
	void SetPivot(const struct FVector2D& NewPivot);
	void SetPivot_Raw(const struct FVector2D& NewPivot, bool bAdjustLocation);
	void SetRaycastTarget(bool NewBool);
	void SetStretchBottom(float newBottom);
	void SetStretchLeft(float newLeft);
	void SetStretchRight(float newRight);
	void SetStretchTop(float newTop);
	void SetTraceChannel(ETraceTypeQuery InTraceChannel);
	void SetUIActive(bool bActive);
	void SetUIItemAlpha(float Value);
	void SetUIItemScale(const struct FVector& Value);
	void SetUIParent(class UUIItem* InParent, bool KeepWorldTransform);
	void SetUIRelativeLocation(const struct FVector& NewLocation);
	void SetUIRelativeRotation(const struct FRotator& NewRotation);
	void SetUIRelativeScale3D(const struct FVector& NewScale3D);
	void SetUIRenderAfterBlur(bool bAfterBlur);
	void SetUIRenderBeforeBloom(bool bBeforeBloom);
	void SetUIRenderBeforeUpScale(bool bBeforeUpScale);
	void SetUIWorldLocation(const struct FVector& NewLocation);
