#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LTween

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "LTween_structs.hpp"


namespace SDK::Params
{

// Function LTween.LTweenActor.GetLTweenInstance
// 0x0010 (0x0010 - 0x0000)
struct LTweenActor_GetLTweenInstance final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALTweenActor*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenActor_GetLTweenInstance) == 0x000008, "Wrong alignment on LTweenActor_GetLTweenInstance");
static_assert(sizeof(LTweenActor_GetLTweenInstance) == 0x000010, "Wrong size on LTweenActor_GetLTweenInstance");
static_assert(offsetof(LTweenActor_GetLTweenInstance, WorldContextObject) == 0x000000, "Member 'LTweenActor_GetLTweenInstance::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenActor_GetLTweenInstance, ReturnValue) == 0x000008, "Member 'LTweenActor_GetLTweenInstance::ReturnValue' has a wrong offset!");

// Function LTween.LTweenActor.CustomTick
// 0x0004 (0x0004 - 0x0000)
struct LTweenActor_CustomTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenActor_CustomTick) == 0x000004, "Wrong alignment on LTweenActor_CustomTick");
static_assert(sizeof(LTweenActor_CustomTick) == 0x000004, "Wrong size on LTweenActor_CustomTick");
static_assert(offsetof(LTweenActor_CustomTick, DeltaTime) == 0x000000, "Member 'LTweenActor_CustomTick::DeltaTime' has a wrong offset!");

// Function LTween.LTweenActor.KillAllTweens
// 0x0001 (0x0001 - 0x0000)
struct LTweenActor_KillAllTweens final
{
public:
	bool                                          callComplete;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenActor_KillAllTweens) == 0x000001, "Wrong alignment on LTweenActor_KillAllTweens");
static_assert(sizeof(LTweenActor_KillAllTweens) == 0x000001, "Wrong size on LTweenActor_KillAllTweens");
static_assert(offsetof(LTweenActor_KillAllTweens, callComplete) == 0x000000, "Member 'LTweenActor_KillAllTweens::callComplete' has a wrong offset!");

// Function LTween.LTweenBPLibrary.ArrayKillIfIsTweening
// 0x0020 (0x0020 - 0x0000)
struct LTweenBPLibrary_ArrayKillIfIsTweening final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULTweener*>                      inTweenerArray;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          callComplete;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LTweenBPLibrary_ArrayKillIfIsTweening) == 0x000008, "Wrong alignment on LTweenBPLibrary_ArrayKillIfIsTweening");
static_assert(sizeof(LTweenBPLibrary_ArrayKillIfIsTweening) == 0x000020, "Wrong size on LTweenBPLibrary_ArrayKillIfIsTweening");
static_assert(offsetof(LTweenBPLibrary_ArrayKillIfIsTweening, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_ArrayKillIfIsTweening::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ArrayKillIfIsTweening, inTweenerArray) == 0x000008, "Member 'LTweenBPLibrary_ArrayKillIfIsTweening::inTweenerArray' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ArrayKillIfIsTweening, callComplete) == 0x000018, "Member 'LTweenBPLibrary_ArrayKillIfIsTweening::callComplete' has a wrong offset!");

// Function LTween.LTweenBPLibrary.ColorTo
// 0x0050 (0x0050 - 0x0000)
struct LTweenBPLibrary_ColorTo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(struct FColor& value)>         setter;                                            // 0x0008(0x0028)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FColor                                 startValue;                                        // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 endValue;                                          // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_ColorTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_ColorTo");
static_assert(sizeof(LTweenBPLibrary_ColorTo) == 0x000050, "Wrong size on LTweenBPLibrary_ColorTo");
static_assert(offsetof(LTweenBPLibrary_ColorTo, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_ColorTo::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, setter) == 0x000008, "Member 'LTweenBPLibrary_ColorTo::setter' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, startValue) == 0x000030, "Member 'LTweenBPLibrary_ColorTo::startValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, endValue) == 0x000034, "Member 'LTweenBPLibrary_ColorTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, duration) == 0x000038, "Member 'LTweenBPLibrary_ColorTo::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, delay) == 0x00003C, "Member 'LTweenBPLibrary_ColorTo::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, ease) == 0x000040, "Member 'LTweenBPLibrary_ColorTo::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_ColorTo, ReturnValue) == 0x000048, "Member 'LTweenBPLibrary_ColorTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.DelayCall
// 0x0040 (0x0040 - 0x0000)
struct LTweenBPLibrary_DelayCall final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delayTime;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             delayComplete;                                     // 0x0010(0x0028)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class ULTweener*                              ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_DelayCall) == 0x000008, "Wrong alignment on LTweenBPLibrary_DelayCall");
static_assert(sizeof(LTweenBPLibrary_DelayCall) == 0x000040, "Wrong size on LTweenBPLibrary_DelayCall");
static_assert(offsetof(LTweenBPLibrary_DelayCall, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_DelayCall::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayCall, delayTime) == 0x000008, "Member 'LTweenBPLibrary_DelayCall::delayTime' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayCall, delayComplete) == 0x000010, "Member 'LTweenBPLibrary_DelayCall::delayComplete' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayCall, ReturnValue) == 0x000038, "Member 'LTweenBPLibrary_DelayCall::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.DelayFrameCall
// 0x0040 (0x0040 - 0x0000)
struct LTweenBPLibrary_DelayFrameCall final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameCount;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             delayComplete;                                     // 0x0010(0x0028)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class ULTweener*                              ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_DelayFrameCall) == 0x000008, "Wrong alignment on LTweenBPLibrary_DelayFrameCall");
static_assert(sizeof(LTweenBPLibrary_DelayFrameCall) == 0x000040, "Wrong size on LTweenBPLibrary_DelayFrameCall");
static_assert(offsetof(LTweenBPLibrary_DelayFrameCall, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_DelayFrameCall::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayFrameCall, frameCount) == 0x000008, "Member 'LTweenBPLibrary_DelayFrameCall::frameCount' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayFrameCall, delayComplete) == 0x000010, "Member 'LTweenBPLibrary_DelayFrameCall::delayComplete' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_DelayFrameCall, ReturnValue) == 0x000038, "Member 'LTweenBPLibrary_DelayFrameCall::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.FloatTo
// 0x0050 (0x0050 - 0x0000)
struct LTweenBPLibrary_FloatTo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float value)>                  setter;                                            // 0x0008(0x0028)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         startValue;                                        // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_FloatTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_FloatTo");
static_assert(sizeof(LTweenBPLibrary_FloatTo) == 0x000050, "Wrong size on LTweenBPLibrary_FloatTo");
static_assert(offsetof(LTweenBPLibrary_FloatTo, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_FloatTo::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, setter) == 0x000008, "Member 'LTweenBPLibrary_FloatTo::setter' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, startValue) == 0x000030, "Member 'LTweenBPLibrary_FloatTo::startValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, endValue) == 0x000034, "Member 'LTweenBPLibrary_FloatTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, duration) == 0x000038, "Member 'LTweenBPLibrary_FloatTo::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, delay) == 0x00003C, "Member 'LTweenBPLibrary_FloatTo::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, ease) == 0x000040, "Member 'LTweenBPLibrary_FloatTo::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_FloatTo, ReturnValue) == 0x000048, "Member 'LTweenBPLibrary_FloatTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.IntTo
// 0x0050 (0x0050 - 0x0000)
struct LTweenBPLibrary_IntTo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 value)>                  setter;                                            // 0x0008(0x0028)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         startValue;                                        // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         endValue;                                          // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_IntTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_IntTo");
static_assert(sizeof(LTweenBPLibrary_IntTo) == 0x000050, "Wrong size on LTweenBPLibrary_IntTo");
static_assert(offsetof(LTweenBPLibrary_IntTo, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_IntTo::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, setter) == 0x000008, "Member 'LTweenBPLibrary_IntTo::setter' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, startValue) == 0x000030, "Member 'LTweenBPLibrary_IntTo::startValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, endValue) == 0x000034, "Member 'LTweenBPLibrary_IntTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, duration) == 0x000038, "Member 'LTweenBPLibrary_IntTo::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, delay) == 0x00003C, "Member 'LTweenBPLibrary_IntTo::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, ease) == 0x000040, "Member 'LTweenBPLibrary_IntTo::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IntTo, ReturnValue) == 0x000048, "Member 'LTweenBPLibrary_IntTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.IsTweening
// 0x0018 (0x0018 - 0x0000)
struct LTweenBPLibrary_IsTweening final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULTweener*                              inTweener;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LTweenBPLibrary_IsTweening) == 0x000008, "Wrong alignment on LTweenBPLibrary_IsTweening");
static_assert(sizeof(LTweenBPLibrary_IsTweening) == 0x000018, "Wrong size on LTweenBPLibrary_IsTweening");
static_assert(offsetof(LTweenBPLibrary_IsTweening, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_IsTweening::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IsTweening, inTweener) == 0x000008, "Member 'LTweenBPLibrary_IsTweening::inTweener' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_IsTweening, ReturnValue) == 0x000010, "Member 'LTweenBPLibrary_IsTweening::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.KillIfIsTweening
// 0x0018 (0x0018 - 0x0000)
struct LTweenBPLibrary_KillIfIsTweening final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULTweener*                              inTweener;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          callComplete;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LTweenBPLibrary_KillIfIsTweening) == 0x000008, "Wrong alignment on LTweenBPLibrary_KillIfIsTweening");
static_assert(sizeof(LTweenBPLibrary_KillIfIsTweening) == 0x000018, "Wrong size on LTweenBPLibrary_KillIfIsTweening");
static_assert(offsetof(LTweenBPLibrary_KillIfIsTweening, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_KillIfIsTweening::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_KillIfIsTweening, inTweener) == 0x000008, "Member 'LTweenBPLibrary_KillIfIsTweening::inTweener' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_KillIfIsTweening, callComplete) == 0x000010, "Member 'LTweenBPLibrary_KillIfIsTweening::callComplete' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LinearColorTo
// 0x0068 (0x0068 - 0x0000)
struct LTweenBPLibrary_LinearColorTo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(struct FLinearColor& value)>   setter;                                            // 0x0008(0x0028)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           startValue;                                        // 0x0030(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           endValue;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x0054(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LinearColorTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LinearColorTo");
static_assert(sizeof(LTweenBPLibrary_LinearColorTo) == 0x000068, "Wrong size on LTweenBPLibrary_LinearColorTo");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, WorldContextObject) == 0x000000, "Member 'LTweenBPLibrary_LinearColorTo::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, setter) == 0x000008, "Member 'LTweenBPLibrary_LinearColorTo::setter' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, startValue) == 0x000030, "Member 'LTweenBPLibrary_LinearColorTo::startValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, endValue) == 0x000040, "Member 'LTweenBPLibrary_LinearColorTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, duration) == 0x000050, "Member 'LTweenBPLibrary_LinearColorTo::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, delay) == 0x000054, "Member 'LTweenBPLibrary_LinearColorTo::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, ease) == 0x000058, "Member 'LTweenBPLibrary_LinearColorTo::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LinearColorTo, ReturnValue) == 0x000060, "Member 'LTweenBPLibrary_LinearColorTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionTo
// 0x0028 (0x0028 - 0x0000)
struct LTweenBPLibrary_LocalPositionTo final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                endValue;                                          // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionTo");
static_assert(sizeof(LTweenBPLibrary_LocalPositionTo) == 0x000028, "Wrong size on LTweenBPLibrary_LocalPositionTo");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionTo::target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, duration) == 0x000014, "Member 'LTweenBPLibrary_LocalPositionTo::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, delay) == 0x000018, "Member 'LTweenBPLibrary_LocalPositionTo::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, ease) == 0x00001C, "Member 'LTweenBPLibrary_LocalPositionTo::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo, ReturnValue) == 0x000020, "Member 'LTweenBPLibrary_LocalPositionTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionTo_Sweep
// 0x00C0 (0x00C0 - 0x0000)
struct LTweenBPLibrary_LocalPositionTo_Sweep final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                endValue;                                          // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             sweepHitResult;                                    // 0x0014(0x0094)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          sweep;                                             // 0x00A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          teleport;                                          // 0x00A9(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x00B0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x00B4(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x00B8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionTo_Sweep) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionTo_Sweep");
static_assert(sizeof(LTweenBPLibrary_LocalPositionTo_Sweep) == 0x0000C0, "Wrong size on LTweenBPLibrary_LocalPositionTo_Sweep");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, sweepHitResult) == 0x000014, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::sweepHitResult' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, sweep) == 0x0000A8, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::sweep' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, teleport) == 0x0000A9, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::teleport' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, duration) == 0x0000AC, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, delay) == 0x0000B0, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, ease) == 0x0000B4, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionTo_Sweep, ReturnValue) == 0x0000B8, "Member 'LTweenBPLibrary_LocalPositionTo_Sweep::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionXTo
// 0x0020 (0x0020 - 0x0000)
struct LTweenBPLibrary_LocalPositionXTo final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionXTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionXTo");
static_assert(sizeof(LTweenBPLibrary_LocalPositionXTo) == 0x000020, "Wrong size on LTweenBPLibrary_LocalPositionXTo");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionXTo::target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionXTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, duration) == 0x00000C, "Member 'LTweenBPLibrary_LocalPositionXTo::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, delay) == 0x000010, "Member 'LTweenBPLibrary_LocalPositionXTo::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, ease) == 0x000014, "Member 'LTweenBPLibrary_LocalPositionXTo::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo, ReturnValue) == 0x000018, "Member 'LTweenBPLibrary_LocalPositionXTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionXTo_Sweep
// 0x00B8 (0x00B8 - 0x0000)
struct LTweenBPLibrary_LocalPositionXTo_Sweep final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             sweepHitResult;                                    // 0x000C(0x0094)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          sweep;                                             // 0x00A0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          teleport;                                          // 0x00A1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x00A4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x00AC(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionXTo_Sweep) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionXTo_Sweep");
static_assert(sizeof(LTweenBPLibrary_LocalPositionXTo_Sweep) == 0x0000B8, "Wrong size on LTweenBPLibrary_LocalPositionXTo_Sweep");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, sweepHitResult) == 0x00000C, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::sweepHitResult' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, sweep) == 0x0000A0, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::sweep' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, teleport) == 0x0000A1, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::teleport' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, duration) == 0x0000A4, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, delay) == 0x0000A8, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, ease) == 0x0000AC, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionXTo_Sweep, ReturnValue) == 0x0000B0, "Member 'LTweenBPLibrary_LocalPositionXTo_Sweep::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionYTo
// 0x0020 (0x0020 - 0x0000)
struct LTweenBPLibrary_LocalPositionYTo final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionYTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionYTo");
static_assert(sizeof(LTweenBPLibrary_LocalPositionYTo) == 0x000020, "Wrong size on LTweenBPLibrary_LocalPositionYTo");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionYTo::target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionYTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, duration) == 0x00000C, "Member 'LTweenBPLibrary_LocalPositionYTo::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, delay) == 0x000010, "Member 'LTweenBPLibrary_LocalPositionYTo::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, ease) == 0x000014, "Member 'LTweenBPLibrary_LocalPositionYTo::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo, ReturnValue) == 0x000018, "Member 'LTweenBPLibrary_LocalPositionYTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionYTo_Sweep
// 0x00B8 (0x00B8 - 0x0000)
struct LTweenBPLibrary_LocalPositionYTo_Sweep final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             sweepHitResult;                                    // 0x000C(0x0094)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          sweep;                                             // 0x00A0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          teleport;                                          // 0x00A1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x00A4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x00AC(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionYTo_Sweep) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionYTo_Sweep");
static_assert(sizeof(LTweenBPLibrary_LocalPositionYTo_Sweep) == 0x0000B8, "Wrong size on LTweenBPLibrary_LocalPositionYTo_Sweep");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, sweepHitResult) == 0x00000C, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::sweepHitResult' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, sweep) == 0x0000A0, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::sweep' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, teleport) == 0x0000A1, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::teleport' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, duration) == 0x0000A4, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, delay) == 0x0000A8, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, ease) == 0x0000AC, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionYTo_Sweep, ReturnValue) == 0x0000B0, "Member 'LTweenBPLibrary_LocalPositionYTo_Sweep::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionZTo
// 0x0020 (0x0020 - 0x0000)
struct LTweenBPLibrary_LocalPositionZTo final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionZTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionZTo");
static_assert(sizeof(LTweenBPLibrary_LocalPositionZTo) == 0x000020, "Wrong size on LTweenBPLibrary_LocalPositionZTo");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionZTo::target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionZTo::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, duration) == 0x00000C, "Member 'LTweenBPLibrary_LocalPositionZTo::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, delay) == 0x000010, "Member 'LTweenBPLibrary_LocalPositionZTo::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, ease) == 0x000014, "Member 'LTweenBPLibrary_LocalPositionZTo::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo, ReturnValue) == 0x000018, "Member 'LTweenBPLibrary_LocalPositionZTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalPositionZTo_Sweep
// 0x00B8 (0x00B8 - 0x0000)
struct LTweenBPLibrary_LocalPositionZTo_Sweep final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         endValue;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             sweepHitResult;                                    // 0x000C(0x0094)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          sweep;                                             // 0x00A0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          teleport;                                          // 0x00A1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x00A4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x00AC(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalPositionZTo_Sweep) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalPositionZTo_Sweep");
static_assert(sizeof(LTweenBPLibrary_LocalPositionZTo_Sweep) == 0x0000B8, "Wrong size on LTweenBPLibrary_LocalPositionZTo_Sweep");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, target) == 0x000000, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, endValue) == 0x000008, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::endValue' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, sweepHitResult) == 0x00000C, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::sweepHitResult' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, sweep) == 0x0000A0, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::sweep' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, teleport) == 0x0000A1, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::teleport' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, duration) == 0x0000A4, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, delay) == 0x0000A8, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, ease) == 0x0000AC, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalPositionZTo_Sweep, ReturnValue) == 0x0000B0, "Member 'LTweenBPLibrary_LocalPositionZTo_Sweep::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalRotateEulerAngleTo
// 0x0028 (0x0028 - 0x0000)
struct LTweenBPLibrary_LocalRotateEulerAngleTo final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                eulerAngle;                                        // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalRotateEulerAngleTo) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalRotateEulerAngleTo");
static_assert(sizeof(LTweenBPLibrary_LocalRotateEulerAngleTo) == 0x000028, "Wrong size on LTweenBPLibrary_LocalRotateEulerAngleTo");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, target) == 0x000000, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::target' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, eulerAngle) == 0x000008, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::eulerAngle' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, duration) == 0x000014, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::duration' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, delay) == 0x000018, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::delay' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, ease) == 0x00001C, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::ease' has a wrong offset!");
static_assert(offsetof(LTweenBPLibrary_LocalRotateEulerAngleTo, ReturnValue) == 0x000020, "Member 'LTweenBPLibrary_LocalRotateEulerAngleTo::ReturnValue' has a wrong offset!");

// Function LTween.LTweenBPLibrary.LocalRotateEulerAngleTo_Sweep
// 0x00C0 (0x00C0 - 0x0000)
struct LTweenBPLibrary_LocalRotateEulerAngleTo_Sweep final
{
public:
	class USceneComponent*                        target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                eulerAngle;                                        // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             sweepHitResult;                                    // 0x0014(0x0094)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          sweep;                                             // 0x00A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          teleport;                                          // 0x00A9(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x00AC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         delay;                                             // 0x00B0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELTweenEase                                   ease;                                              // 0x00B4(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULTweener*                              ReturnValue;                                       // 0x00B8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LTweenBPLibrary_LocalRotateEulerAngleTo_Sweep) == 0x000008, "Wrong alignment on LTweenBPLibrary_LocalRotateEulerAngleTo_Sweep");
static_assert(sizeof(LTweenBPLibrary_LocalRotateEulerAngleTo_Sweep) == 0x0000C0, "Wrong size on LTweenBPLibrary_LocalRotateEulerAngleTo_Sweep");
