#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PD_CharacterControllerData

#include "Basic.hpp"

#include "KuroCurve_structs.hpp"


namespace SDK::Params
{

// Function PD_CharacterControllerData.PD_CharacterControllerData_C.InitCache
// 0x0068 (0x0068 - 0x0000)
struct PD_CharacterControllerData_C_InitCache final
{
public:
	TArray<struct FKuroCurveLinearColor>          ColorEnd;                                          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveLinearColor>          ColorLoop;                                         // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveLinearColor>          ColorStart;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveFloat>                FloatEnd;                                          // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveFloat>                FloatLoop;                                         // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKuroCurveFloat>                FloatStart;                                        // 0x0050(0x0010)(Edit, BlueprintVisible)
	class UKuroCharacterMaterialControllerCache*  CallFunc_SpawnObject_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PD_CharacterControllerData_C_InitCache) == 0x000008, "Wrong alignment on PD_CharacterControllerData_C_InitCache");
static_assert(sizeof(PD_CharacterControllerData_C_InitCache) == 0x000068, "Wrong size on PD_CharacterControllerData_C_InitCache");
static_assert(offsetof(PD_CharacterControllerData_C_InitCache, ColorEnd) == 0x000000, "Member 'PD_CharacterControllerData_C_InitCache::ColorEnd' has a wrong offset!");
static_assert(offsetof(PD_CharacterControllerData_C_InitCache, ColorLoop) == 0x000010, "Member 'PD_CharacterControllerData_C_InitCache::ColorLoop' has a wrong offset!");
static_assert(offsetof(PD_CharacterControllerData_C_InitCache, ColorStart) == 0x000020, "Member 'PD_CharacterControllerData_C_InitCache::ColorStart' has a wrong offset!");
static_assert(offsetof(PD_CharacterControllerData_C_InitCache, FloatEnd) == 0x000030, "Member 'PD_CharacterControllerData_C_InitCache::FloatEnd' has a wrong offset!");
static_assert(offsetof(PD_CharacterControllerData_C_InitCache, FloatLoop) == 0x000040, "Member 'PD_CharacterControllerData_C_InitCache::FloatLoop' has a wrong offset!");
static_assert(offsetof(PD_CharacterControllerData_C_InitCache, FloatStart) == 0x000050, "Member 'PD_CharacterControllerData_C_InitCache::FloatStart' has a wrong offset!");
static_assert(offsetof(PD_CharacterControllerData_C_InitCache, CallFunc_SpawnObject_ReturnValue) == 0x000060, "Member 'PD_CharacterControllerData_C_InitCache::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

}

