#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PD_CharacterControllerData

#include "Basic.hpp"

#include "ECharacterControllerType_structs.hpp"
#include "ECharacterBodySpecifiedType_structs.hpp"
#include "ECharacterMeshPart_structs.hpp"
#include "ECharacterSlotSpecifiedType_structs.hpp"
#include "SMaterialControllerFloatGroup_structs.hpp"
#include "ECharacterControllerApplyType_structs.hpp"
#include "SMaterialControllerLoopTime_structs.hpp"
#include "ECharacterControllerChannelSwitch_structs.hpp"
#include "SMaterialControllerColorGroup_structs.hpp"
#include "ECharacterControllerUVSwitch_structs.hpp"
#include "SMaterialControllerFloatParameter_structs.hpp"
#include "SMaterialControllerColorParameter_structs.hpp"
#include "SMaterialControllerTextureParameter_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PD_CharacterControllerData.PD_CharacterControllerData_C
// 0x4A48 (0x4A98 - 0x0050)
class UPD_CharacterControllerData_C final : public UKuroMaterialControllerDataAsset
{
public:
	ECharacterControllerType                      DataType;                                          // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterBodySpecifiedType                   SpecifiedBodyType;                                 // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharacterMeshPart>                    SpecifiedParts;                                    // 0x0058(0x0010)(Edit, BlueprintVisible)
	ECharacterSlotSpecifiedType                   SpecifiedSlotType;                                 // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterControllerApplyType                 MaterialModifyType;                                // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ReplaceMaterial;                                   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseRim;                                            // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseOutline;                                        // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseDissolve;                                       // 0x007A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerLoopTime           LoopTime;                                          // 0x007C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RimRevertProperty;                                 // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          RimUseTex;                                         // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECharacterControllerChannelSwitch             RimChannel;                                        // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerFloatGroup         RimRange;                                          // 0x0090(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSMaterialControllerColorGroup         RimColor;                                          // 0x0240(0x0660)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          OutlineRevertProperty;                             // 0x08A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          OutlineUseTex;                                     // 0x08A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A2[0x6];                                      // 0x08A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerFloatGroup         OutlineWidth;                                      // 0x08A8(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSMaterialControllerColorGroup         OutlineColor;                                      // 0x0A58(0x0660)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          DissolveRevertProperty;                            // 0x10B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, AdvancedDisplay)
	ECharacterControllerChannelSwitch             DissolveChannel;                                   // 0x10B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10BA[0x6];                                     // 0x10BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerFloatGroup         DissolveProgress;                                  // 0x10C0(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSMaterialControllerColorGroup         DissolveColor;                                     // 0x1270(0x0660)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSMaterialControllerFloatGroup         DissolveColorIntensity;                            // 0x18D0(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          UseTextureSample;                                  // 0x1A80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TextureSampleRevertProperty;                       // 0x1A81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseAlphaToMask;                                    // 0x1A82(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A83[0x5];                                     // 0x1A83(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             MaskTexture;                                       // 0x1A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMaterialControllerFloatGroup         Rotation;                                          // 0x1A90(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	ECharacterControllerUVSwitch::ECharacterControllerUVSwitch UVSelection;                                       // 0x1C40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C41[0x7];                                     // 0x1C41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerColorGroup         TextureScaleAndOffset;                             // 0x1C48(0x0660)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSMaterialControllerColorGroup         TextureSpeed;                                      // 0x22A8(0x0660)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSMaterialControllerColorGroup         TextureColorTint;                                  // 0x2908(0x0660)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSMaterialControllerFloatGroup         OutlineIntensity;                                  // 0x2F68(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          UseOuterOutlineEffect;                             // 0x3118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MobileUseDifferentMaterial;                        // 0x3119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311A[0x6];                                     // 0x311A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ReplaceMaterialMobile;                             // 0x3120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RevertMaterial;                                    // 0x3128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          UseParameterModify;                                // 0x3129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312A[0x6];                                     // 0x312A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMaterialControllerFloatParameter> FloatParameters;                                   // 0x3130(0x0010)(Edit, BlueprintVisible)
	bool                                          UseColor;                                          // 0x3140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ColorRevertProperty;                               // 0x3141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          BaseUseTex;                                        // 0x3142(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3143[0x5];                                     // 0x3143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerColorGroup         BaseColor;                                         // 0x3148(0x0660)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSMaterialControllerFloatGroup         BaseColorIntensity;                                // 0x37A8(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          EmissionUseTex;                                    // 0x3958(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3959[0x7];                                     // 0x3959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerColorGroup         EmissionColor;                                     // 0x3960(0x0660)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSMaterialControllerFloatGroup         EmissionIntensity;                                 // 0x3FC0(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FSMaterialControllerColorParameter> ColorParameters;                                   // 0x4170(0x0010)(Edit, BlueprintVisible)
	bool                                          UseCustomMaterialEffect;                           // 0x4180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CustomRevertProperty;                              // 0x4181(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_4182[0x6];                                     // 0x4182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMaterialControllerFloatParameter> CustomFloatParameters;                             // 0x4188(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSMaterialControllerColorParameter> CustomColorParameters;                             // 0x4198(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FSMaterialControllerTextureParameter> CustomTextureParameters;                           // 0x41A8(0x0010)(Edit, BlueprintVisible)
	bool                                          UseMotionOffset;                                   // 0x41B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MotionOffsetRevertProperty;                        // 0x41B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_41BA[0x2];                                     // 0x41BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MotionOffsetLength;                                // 0x41BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MotionAffectVertexRange;                           // 0x41C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C4[0x4];                                     // 0x41C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         WeaponCases;                                       // 0x41C8(0x0010)(Edit, BlueprintVisible)
	bool                                          IgnoreTimeDilation;                                // 0x41D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HiddenAfterEffect;                                 // 0x41D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41DA[0x6];                                     // 0x41DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerFloatGroup         DissolveSmooth;                                    // 0x41E0(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSMaterialControllerFloatGroup         MotionNoiseSpeed;                                  // 0x4390(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          UseDitherEffect;                                   // 0x4540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DitherRevertProperty;                              // 0x4541(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_4542[0x6];                                     // 0x4542(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerFloatGroup         DitherValue;                                       // 0x4548(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FString>                         OtherCases;                                        // 0x46F8(0x0010)(Edit, BlueprintVisible)
	bool                                          CleanOriginEffect;                                 // 0x4708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_4709[0x7];                                     // 0x4709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMaterialControllerFloatGroup         RimIntensity;                                      // 0x4710(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FString>                         CustomPartNames;                                   // 0x48C0(0x0010)(Edit, BlueprintVisible)
	struct FSMaterialControllerFloatGroup         TextureMaskRange;                                  // 0x48D0(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          MaskOriginEffect;                                  // 0x4A80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UpdateAtLeastOneFrame;                             // 0x4A81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A82[0x6];                                     // 0x4A82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CustomExcludePartNames;                            // 0x4A88(0x0010)(Edit, BlueprintVisible)

public:
	void InitCache();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PD_CharacterControllerData_C">();
	}
	static class UPD_CharacterControllerData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPD_CharacterControllerData_C>();
	}
};
static_assert(alignof(UPD_CharacterControllerData_C) == 0x000008, "Wrong alignment on UPD_CharacterControllerData_C");
static_assert(sizeof(UPD_CharacterControllerData_C) == 0x004A98, "Wrong size on UPD_CharacterControllerData_C");
static_assert(offsetof(UPD_CharacterControllerData_C, DataType) == 0x000050, "Member 'UPD_CharacterControllerData_C::DataType' has a wrong offset!");
static_assert(offsetof(UPD_CharacterControllerData_C, SpecifiedBodyType) == 0x000051, "Member 'UPD_CharacterControllerData_C::SpecifiedBodyType' has a wrong offset!");
