#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PD_CloudPreset

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PD_CloudPreset.PD_CloudPreset_C
// 0x0990 (0x09C8 - 0x0038)
class UPD_CloudPreset_C final : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class UPD_CloudPrefab_C>       天城;                                              // 0x0038(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       遗落原乡;                                          // 0x0068(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       无光之森;                                          // 0x0098(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       中曲台地;                                          // 0x00C8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       登录界面;                                          // 0x00F8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       无音区沉寂态;                                      // 0x0128(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       无音区01;                                          // 0x0158(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       怨鸟泽;                                            // 0x0188(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       原画测试专用云;                                    // 0x01B8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       无音区02;                                          // 0x01E8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       无音区03;                                          // 0x0218(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       无音区04;                                          // 0x0248(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       无音区05;                                          // 0x0278(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       漩涡云;                                            // 0x02A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       鸣潮天气;                                          // 0x02D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       阴天异象;                                          // 0x0308(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       黄昏异象;                                          // 0x0338(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       夜晚异象;                                          // 0x0368(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       乘宵山异象;                                        // 0x0398(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       乘宵山;                                            // 0x03C8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       黑海岸上层;                                        // 0x03F8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       黑海岸下层;                                        // 0x0428(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       黑海岸夜晚;                                        // 0x0458(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       肉鸽月亮01;                                        // 0x0488(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       肉鸽月亮02;                                        // 0x04B8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       肉鸽月亮03;                                        // 0x04E8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       肉鸽月亮04;                                        // 0x0518(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       黎娜汐塔;                                          // 0x0548(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       帕尔米罗墓地;                                      // 0x0578(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       槲生半岛;                                          // 0x05A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       狄萨莱海脊永夜解密前;                              // 0x05D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       狄萨莱海脊永夜解密后;                              // 0x0608(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       金库上层;                                          // 0x0638(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       肉鸽月亮05;                                        // 0x0668(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       黑海岸天气_阴;                                     // 0x0698(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       狂欢节;                                            // 0x06C8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       槲生半岛解密后;                                    // 0x06F8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       云海区;                                            // 0x0728(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       罗墓岛夜晚;                                        // 0x0758(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       黎娜汐塔阴;                                        // 0x0788(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       金库上解密后;                                      // 0x07B8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       费洛洛出场;                                        // 0x07E8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       彩虹天气;                                          // 0x0818(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       颠倒塔白天;                                        // 0x0848(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       颠倒塔夜晚;                                        // 0x0878(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       颠倒塔流星;                                        // 0x08A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       七丘;                                              // 0x08D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       七丘阴天;                                          // 0x0908(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       残破竞技场;                                        // 0x0938(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       尖刺山;                                            // 0x0968(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD_CloudPrefab_C>       观测塔;                                            // 0x0998(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PD_CloudPreset_C">();
	}
	static class UPD_CloudPreset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPD_CloudPreset_C>();
	}
};
static_assert(alignof(UPD_CloudPreset_C) == 0x000008, "Wrong alignment on UPD_CloudPreset_C");
static_assert(sizeof(UPD_CloudPreset_C) == 0x0009C8, "Wrong size on UPD_CloudPreset_C");
static_assert(offsetof(UPD_CloudPreset_C, 天城) == 0x000038, "Member 'UPD_CloudPreset_C::天城' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 遗落原乡) == 0x000068, "Member 'UPD_CloudPreset_C::遗落原乡' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 无光之森) == 0x000098, "Member 'UPD_CloudPreset_C::无光之森' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 中曲台地) == 0x0000C8, "Member 'UPD_CloudPreset_C::中曲台地' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 登录界面) == 0x0000F8, "Member 'UPD_CloudPreset_C::登录界面' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 无音区沉寂态) == 0x000128, "Member 'UPD_CloudPreset_C::无音区沉寂态' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 无音区01) == 0x000158, "Member 'UPD_CloudPreset_C::无音区01' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 怨鸟泽) == 0x000188, "Member 'UPD_CloudPreset_C::怨鸟泽' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 原画测试专用云) == 0x0001B8, "Member 'UPD_CloudPreset_C::原画测试专用云' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 无音区02) == 0x0001E8, "Member 'UPD_CloudPreset_C::无音区02' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 无音区03) == 0x000218, "Member 'UPD_CloudPreset_C::无音区03' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 无音区04) == 0x000248, "Member 'UPD_CloudPreset_C::无音区04' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 无音区05) == 0x000278, "Member 'UPD_CloudPreset_C::无音区05' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 漩涡云) == 0x0002A8, "Member 'UPD_CloudPreset_C::漩涡云' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 鸣潮天气) == 0x0002D8, "Member 'UPD_CloudPreset_C::鸣潮天气' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 阴天异象) == 0x000308, "Member 'UPD_CloudPreset_C::阴天异象' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 黄昏异象) == 0x000338, "Member 'UPD_CloudPreset_C::黄昏异象' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 夜晚异象) == 0x000368, "Member 'UPD_CloudPreset_C::夜晚异象' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 乘宵山异象) == 0x000398, "Member 'UPD_CloudPreset_C::乘宵山异象' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 乘宵山) == 0x0003C8, "Member 'UPD_CloudPreset_C::乘宵山' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 黑海岸上层) == 0x0003F8, "Member 'UPD_CloudPreset_C::黑海岸上层' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 黑海岸下层) == 0x000428, "Member 'UPD_CloudPreset_C::黑海岸下层' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 黑海岸夜晚) == 0x000458, "Member 'UPD_CloudPreset_C::黑海岸夜晚' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 肉鸽月亮01) == 0x000488, "Member 'UPD_CloudPreset_C::肉鸽月亮01' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 肉鸽月亮02) == 0x0004B8, "Member 'UPD_CloudPreset_C::肉鸽月亮02' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 肉鸽月亮03) == 0x0004E8, "Member 'UPD_CloudPreset_C::肉鸽月亮03' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 肉鸽月亮04) == 0x000518, "Member 'UPD_CloudPreset_C::肉鸽月亮04' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 黎娜汐塔) == 0x000548, "Member 'UPD_CloudPreset_C::黎娜汐塔' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 帕尔米罗墓地) == 0x000578, "Member 'UPD_CloudPreset_C::帕尔米罗墓地' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 槲生半岛) == 0x0005A8, "Member 'UPD_CloudPreset_C::槲生半岛' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 狄萨莱海脊永夜解密前) == 0x0005D8, "Member 'UPD_CloudPreset_C::狄萨莱海脊永夜解密前' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 狄萨莱海脊永夜解密后) == 0x000608, "Member 'UPD_CloudPreset_C::狄萨莱海脊永夜解密后' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 金库上层) == 0x000638, "Member 'UPD_CloudPreset_C::金库上层' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 肉鸽月亮05) == 0x000668, "Member 'UPD_CloudPreset_C::肉鸽月亮05' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 黑海岸天气_阴) == 0x000698, "Member 'UPD_CloudPreset_C::黑海岸天气_阴' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 狂欢节) == 0x0006C8, "Member 'UPD_CloudPreset_C::狂欢节' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 槲生半岛解密后) == 0x0006F8, "Member 'UPD_CloudPreset_C::槲生半岛解密后' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 云海区) == 0x000728, "Member 'UPD_CloudPreset_C::云海区' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 罗墓岛夜晚) == 0x000758, "Member 'UPD_CloudPreset_C::罗墓岛夜晚' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 黎娜汐塔阴) == 0x000788, "Member 'UPD_CloudPreset_C::黎娜汐塔阴' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 金库上解密后) == 0x0007B8, "Member 'UPD_CloudPreset_C::金库上解密后' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 费洛洛出场) == 0x0007E8, "Member 'UPD_CloudPreset_C::费洛洛出场' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 彩虹天气) == 0x000818, "Member 'UPD_CloudPreset_C::彩虹天气' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 颠倒塔白天) == 0x000848, "Member 'UPD_CloudPreset_C::颠倒塔白天' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 颠倒塔夜晚) == 0x000878, "Member 'UPD_CloudPreset_C::颠倒塔夜晚' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 颠倒塔流星) == 0x0008A8, "Member 'UPD_CloudPreset_C::颠倒塔流星' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 七丘) == 0x0008D8, "Member 'UPD_CloudPreset_C::七丘' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 七丘阴天) == 0x000908, "Member 'UPD_CloudPreset_C::七丘阴天' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 残破竞技场) == 0x000938, "Member 'UPD_CloudPreset_C::残破竞技场' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 尖刺山) == 0x000968, "Member 'UPD_CloudPreset_C::尖刺山' has a wrong offset!");
static_assert(offsetof(UPD_CloudPreset_C, 观测塔) == 0x000998, "Member 'UPD_CloudPreset_C::观测塔' has a wrong offset!");

}

