#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PD_NpcSetupData

#include "Basic.hpp"


namespace SDK::Params
{

// Function PD_NpcSetupData.PD_NpcSetupData_C.IsEmpty
// 0x000D (0x000D - 0x0000)
struct PD_NpcSetupData_C_IsEmpty final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelBody_Result;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelBodyDown_Result;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelBodyUp_Result;                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelFace_Result;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelHair_Result;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelMain_Result;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PD_NpcSetupData_C_IsEmpty) == 0x000001, "Wrong alignment on PD_NpcSetupData_C_IsEmpty");
static_assert(sizeof(PD_NpcSetupData_C_IsEmpty) == 0x00000D, "Wrong size on PD_NpcSetupData_C_IsEmpty");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, Result) == 0x000000, "Member 'PD_NpcSetupData_C_IsEmpty::Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_HasSkelBody_Result) == 0x000001, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_HasSkelBody_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_HasSkelBodyDown_Result) == 0x000002, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_HasSkelBodyDown_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_HasSkelBodyUp_Result) == 0x000003, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_HasSkelBodyUp_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_HasSkelFace_Result) == 0x000004, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_HasSkelFace_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_HasSkelHair_Result) == 0x000005, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_HasSkelHair_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_HasSkelMain_Result) == 0x000006, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_HasSkelMain_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_BooleanOR_ReturnValue_1) == 0x000008, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_BooleanOR_ReturnValue_2) == 0x000009, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_BooleanOR_ReturnValue_3) == 0x00000A, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_BooleanOR_ReturnValue_4) == 0x00000B, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_IsEmpty, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'PD_NpcSetupData_C_IsEmpty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function PD_NpcSetupData.PD_NpcSetupData_C.HasSkelMain
// 0x0002 (0x0002 - 0x0000)
struct PD_NpcSetupData_C_HasSkelMain final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PD_NpcSetupData_C_HasSkelMain) == 0x000001, "Wrong alignment on PD_NpcSetupData_C_HasSkelMain");
static_assert(sizeof(PD_NpcSetupData_C_HasSkelMain) == 0x000002, "Wrong size on PD_NpcSetupData_C_HasSkelMain");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelMain, Result) == 0x000000, "Member 'PD_NpcSetupData_C_HasSkelMain::Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelMain, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000001, "Member 'PD_NpcSetupData_C_HasSkelMain::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function PD_NpcSetupData.PD_NpcSetupData_C.HasSkelHair
// 0x0002 (0x0002 - 0x0000)
struct PD_NpcSetupData_C_HasSkelHair final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PD_NpcSetupData_C_HasSkelHair) == 0x000001, "Wrong alignment on PD_NpcSetupData_C_HasSkelHair");
static_assert(sizeof(PD_NpcSetupData_C_HasSkelHair) == 0x000002, "Wrong size on PD_NpcSetupData_C_HasSkelHair");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelHair, Result) == 0x000000, "Member 'PD_NpcSetupData_C_HasSkelHair::Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelHair, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000001, "Member 'PD_NpcSetupData_C_HasSkelHair::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function PD_NpcSetupData.PD_NpcSetupData_C.HasSkelFace
// 0x0002 (0x0002 - 0x0000)
struct PD_NpcSetupData_C_HasSkelFace final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PD_NpcSetupData_C_HasSkelFace) == 0x000001, "Wrong alignment on PD_NpcSetupData_C_HasSkelFace");
static_assert(sizeof(PD_NpcSetupData_C_HasSkelFace) == 0x000002, "Wrong size on PD_NpcSetupData_C_HasSkelFace");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelFace, Result) == 0x000000, "Member 'PD_NpcSetupData_C_HasSkelFace::Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelFace, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000001, "Member 'PD_NpcSetupData_C_HasSkelFace::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function PD_NpcSetupData.PD_NpcSetupData_C.HasSkelBodyUp
// 0x0002 (0x0002 - 0x0000)
struct PD_NpcSetupData_C_HasSkelBodyUp final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PD_NpcSetupData_C_HasSkelBodyUp) == 0x000001, "Wrong alignment on PD_NpcSetupData_C_HasSkelBodyUp");
static_assert(sizeof(PD_NpcSetupData_C_HasSkelBodyUp) == 0x000002, "Wrong size on PD_NpcSetupData_C_HasSkelBodyUp");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelBodyUp, Result) == 0x000000, "Member 'PD_NpcSetupData_C_HasSkelBodyUp::Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelBodyUp, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000001, "Member 'PD_NpcSetupData_C_HasSkelBodyUp::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function PD_NpcSetupData.PD_NpcSetupData_C.HasSkelBodyDown
// 0x0002 (0x0002 - 0x0000)
struct PD_NpcSetupData_C_HasSkelBodyDown final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PD_NpcSetupData_C_HasSkelBodyDown) == 0x000001, "Wrong alignment on PD_NpcSetupData_C_HasSkelBodyDown");
static_assert(sizeof(PD_NpcSetupData_C_HasSkelBodyDown) == 0x000002, "Wrong size on PD_NpcSetupData_C_HasSkelBodyDown");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelBodyDown, Result) == 0x000000, "Member 'PD_NpcSetupData_C_HasSkelBodyDown::Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelBodyDown, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000001, "Member 'PD_NpcSetupData_C_HasSkelBodyDown::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function PD_NpcSetupData.PD_NpcSetupData_C.HasSkelBody
// 0x0002 (0x0002 - 0x0000)
struct PD_NpcSetupData_C_HasSkelBody final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PD_NpcSetupData_C_HasSkelBody) == 0x000001, "Wrong alignment on PD_NpcSetupData_C_HasSkelBody");
static_assert(sizeof(PD_NpcSetupData_C_HasSkelBody) == 0x000002, "Wrong size on PD_NpcSetupData_C_HasSkelBody");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelBody, Result) == 0x000000, "Member 'PD_NpcSetupData_C_HasSkelBody::Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_HasSkelBody, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000001, "Member 'PD_NpcSetupData_C_HasSkelBody::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function PD_NpcSetupData.PD_NpcSetupData_C.GetAllParts
// 0x0040 (0x0040 - 0x0000)
struct PD_NpcSetupData_C_GetAllParts final
{
public:
	TArray<class USkeletalMesh*>                  OutParts;                                          // 0x0000(0x0010)(Parm, OutParm)
	TArray<class USkeletalMesh*>                  OutMeshes;                                         // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_HasSkelFace_Result;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelHair_Result;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelBodyDown_Result;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelBodyUp_Result;                     // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_3;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSkelBody_Result;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_4;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PD_NpcSetupData_C_GetAllParts) == 0x000008, "Wrong alignment on PD_NpcSetupData_C_GetAllParts");
static_assert(sizeof(PD_NpcSetupData_C_GetAllParts) == 0x000040, "Wrong size on PD_NpcSetupData_C_GetAllParts");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, OutParts) == 0x000000, "Member 'PD_NpcSetupData_C_GetAllParts::OutParts' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, OutMeshes) == 0x000010, "Member 'PD_NpcSetupData_C_GetAllParts::OutMeshes' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_HasSkelFace_Result) == 0x000020, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_HasSkelFace_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_HasSkelHair_Result) == 0x000021, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_HasSkelHair_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_HasSkelBodyDown_Result) == 0x000022, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_HasSkelBodyDown_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_HasSkelBodyUp_Result) == 0x000023, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_HasSkelBodyUp_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_Array_AddUnique_ReturnValue) == 0x000024, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000028, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_Array_AddUnique_ReturnValue_2) == 0x00002C, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_Array_AddUnique_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_Array_AddUnique_ReturnValue_3) == 0x000030, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_Array_AddUnique_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_HasSkelBody_Result) == 0x000034, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_HasSkelBody_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllParts, CallFunc_Array_AddUnique_ReturnValue_4) == 0x000038, "Member 'PD_NpcSetupData_C_GetAllParts::CallFunc_Array_AddUnique_ReturnValue_4' has a wrong offset!");

// Function PD_NpcSetupData.PD_NpcSetupData_C.GetAllPartMaterials
// 0x0040 (0x0040 - 0x0000)
struct PD_NpcSetupData_C_GetAllPartMaterials final
{
public:
	TArray<class UMaterialInstance*>              Results;                                           // 0x0000(0x0010)(Parm, OutParm)
	TArray<class UMaterialInstance*>              OutMaterials;                                      // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSkelFace_Result;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelHair_Result;                       // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelBodyDown_Result;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelBodyUp_Result;                     // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSkelBody_Result;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PD_NpcSetupData_C_GetAllPartMaterials) == 0x000008, "Wrong alignment on PD_NpcSetupData_C_GetAllPartMaterials");
static_assert(sizeof(PD_NpcSetupData_C_GetAllPartMaterials) == 0x000040, "Wrong size on PD_NpcSetupData_C_GetAllPartMaterials");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, Results) == 0x000000, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::Results' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, OutMaterials) == 0x000010, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::OutMaterials' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_Array_Add_ReturnValue_1) == 0x000024, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_Array_Add_ReturnValue_2) == 0x000028, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_Array_Add_ReturnValue_3) == 0x00002C, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_Array_Add_ReturnValue_4) == 0x000030, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_HasSkelFace_Result) == 0x000034, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_HasSkelFace_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_HasSkelHair_Result) == 0x000035, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_HasSkelHair_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_HasSkelBodyDown_Result) == 0x000036, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_HasSkelBodyDown_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_HasSkelBodyUp_Result) == 0x000037, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_HasSkelBodyUp_Result' has a wrong offset!");
static_assert(offsetof(PD_NpcSetupData_C_GetAllPartMaterials, CallFunc_HasSkelBody_Result) == 0x000038, "Member 'PD_NpcSetupData_C_GetAllPartMaterials::CallFunc_HasSkelBody_Result' has a wrong offset!");

}

