#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoadNetRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "RoadNetRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class RoadNetRuntime.RoadNetActor
// 0x0008 (0x02B8 - 0x02B0)
class ARoadNetActor final : public AActor
{
public:
	class URoadNetComponent*                      RoadNetComponent;                                  // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadNetActor">();
	}
	static class ARoadNetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoadNetActor>();
	}
};
static_assert(alignof(ARoadNetActor) == 0x000008, "Wrong alignment on ARoadNetActor");
static_assert(sizeof(ARoadNetActor) == 0x0002B8, "Wrong size on ARoadNetActor");
static_assert(offsetof(ARoadNetActor, RoadNetComponent) == 0x0002B0, "Member 'ARoadNetActor::RoadNetComponent' has a wrong offset!");

// Class RoadNetRuntime.RoadNetComponent
// 0x0080 (0x0580 - 0x0500)
class URoadNetComponent final : public UPrimitiveComponent
{
public:
	bool                                          bDrawDebug;                                        // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasBeenEdited;                                    // 0x04F9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C5A[0x2];                                     // 0x04FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TileSize;                                          // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FRoadNetNode>              RoadNetNodes;                                      // 0x0508(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	uint32                                        RoadNetID;                                         // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   DataBoundsBox;                                     // 0x055C(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C5B[0x8];                                     // 0x0578(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetLeaveTangentAtNode(int32 NodeID, ERoadNetCoordinateSpace CoordinateSpace) const;
	struct FVector GetLocationAtNode(int32 NodeID, ERoadNetCoordinateSpace CoordinateSpace) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadNetComponent">();
	}
	static class URoadNetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadNetComponent>();
	}
};
static_assert(alignof(URoadNetComponent) == 0x000010, "Wrong alignment on URoadNetComponent");
static_assert(sizeof(URoadNetComponent) == 0x000580, "Wrong size on URoadNetComponent");
static_assert(offsetof(URoadNetComponent, bDrawDebug) == 0x0004F8, "Member 'URoadNetComponent::bDrawDebug' has a wrong offset!");
static_assert(offsetof(URoadNetComponent, bHasBeenEdited) == 0x0004F9, "Member 'URoadNetComponent::bHasBeenEdited' has a wrong offset!");
static_assert(offsetof(URoadNetComponent, TileSize) == 0x0004FC, "Member 'URoadNetComponent::TileSize' has a wrong offset!");
static_assert(offsetof(URoadNetComponent, RoadNetNodes) == 0x000508, "Member 'URoadNetComponent::RoadNetNodes' has a wrong offset!");
static_assert(offsetof(URoadNetComponent, RoadNetID) == 0x000558, "Member 'URoadNetComponent::RoadNetID' has a wrong offset!");
static_assert(offsetof(URoadNetComponent, DataBoundsBox) == 0x00055C, "Member 'URoadNetComponent::DataBoundsBox' has a wrong offset!");

// Class RoadNetRuntime.RoadNetSetting
// 0x0010 (0x0040 - 0x0030)
class URoadNetSetting final : public UObject
{
public:
	struct FVector                                NodePlaceOffset;                                   // 0x0030(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C5E[0x4];                                     // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadNetSetting">();
	}
	static class URoadNetSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadNetSetting>();
	}
};
static_assert(alignof(URoadNetSetting) == 0x000008, "Wrong alignment on URoadNetSetting");
static_assert(sizeof(URoadNetSetting) == 0x000040, "Wrong size on URoadNetSetting");
static_assert(offsetof(URoadNetSetting, NodePlaceOffset) == 0x000030, "Member 'URoadNetSetting::NodePlaceOffset' has a wrong offset!");

}

