#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SceneInteractionActor

#include "Basic.hpp"

#include "ESceneInteractionEffect_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"
#include "SSceneInteractionTags_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SSceneInteractionitem_structs.hpp"
#include "SScenePropertyEffect_structs.hpp"


namespace SDK
{

// TypeScriptGeneratedClass SceneInteractionActor.SceneInteractionActor_C
// 0x0268 (0x0518 - 0x02B0)
class ASceneInteractionActor_C final : public AKuroSceneInteractionActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<EKuroSceneInteractionState, struct FSSceneInteractionitem> States;                                            // 0x02B8(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, class AActor*>            ReferenceActors;                                   // 0x0308(0x0050)(Edit, BlueprintVisible)
	TArray<class AActor*>                         CollisionActors;                                   // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class FString                                 LevelName;                                         // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         HandleId;                                          // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9A[0x4];                                     // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ESceneInteractionEffect, class ABP_EffectActor_C*> EndEffects;                                        // 0x0380(0x0050)(Edit, BlueprintVisible)
	TMap<ESceneInteractionEffect, struct FSScenePropertyEffect> Effects;                                           // 0x03D0(0x0050)(Edit, BlueprintVisible)
	TArray<class AActor*>                         InteractionEffectHookActors;                       // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ATsBaseCharacter_C*                     CharacterForOrgan;                                 // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FSSceneInteractionTags> TagsAndCorrespondingEffects;                       // 0x0438(0x0050)(Edit, BlueprintVisible)
	TArray<class AActor*>                         ActorsForProjection;                               // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<class AActor*, struct FGameplayTag>      PartCollisionActorsAndCorrespondingTags;           // 0x0498(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class UMaterialInstance*                      MaterialForProjection;                             // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASkeletalMeshActor*>             SkeletalMeshActors;                                // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         ReceivingDecalsActors;                             // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_InteractionMaterialController_C*    InteractionMaterialController;                     // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DestroySelf();
	class ALevelSequenceActor* GetDirectorBySequence(class ULevelSequence* Sequence);
	void StopExtraEffectOnTagsChange(const struct FGameplayTag& Tag);
	void ResetTagActorHide(const struct FGameplayTag& Tag);
	void AddMatrialDataForChildrenActor(class AActor* Actor, class UItemMaterialControllerActorData_C* MaterialData);
	void AddNewEndEffect();
	void UpdateTimeDilation();
	void AddNewState();
	void AddNewEffect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SceneInteractionActor_C">();
	}
	static class ASceneInteractionActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASceneInteractionActor_C>();
	}
};
static_assert(alignof(ASceneInteractionActor_C) == 0x000008, "Wrong alignment on ASceneInteractionActor_C");
static_assert(sizeof(ASceneInteractionActor_C) == 0x000518, "Wrong size on ASceneInteractionActor_C");
static_assert(offsetof(ASceneInteractionActor_C, DefaultSceneRoot) == 0x0002B0, "Member 'ASceneInteractionActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, States) == 0x0002B8, "Member 'ASceneInteractionActor_C::States' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, ReferenceActors) == 0x000308, "Member 'ASceneInteractionActor_C::ReferenceActors' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, CollisionActors) == 0x000358, "Member 'ASceneInteractionActor_C::CollisionActors' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, LevelName) == 0x000368, "Member 'ASceneInteractionActor_C::LevelName' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, HandleId) == 0x000378, "Member 'ASceneInteractionActor_C::HandleId' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, EndEffects) == 0x000380, "Member 'ASceneInteractionActor_C::EndEffects' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, Effects) == 0x0003D0, "Member 'ASceneInteractionActor_C::Effects' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, InteractionEffectHookActors) == 0x000420, "Member 'ASceneInteractionActor_C::InteractionEffectHookActors' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, CharacterForOrgan) == 0x000430, "Member 'ASceneInteractionActor_C::CharacterForOrgan' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, TagsAndCorrespondingEffects) == 0x000438, "Member 'ASceneInteractionActor_C::TagsAndCorrespondingEffects' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, ActorsForProjection) == 0x000488, "Member 'ASceneInteractionActor_C::ActorsForProjection' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, PartCollisionActorsAndCorrespondingTags) == 0x000498, "Member 'ASceneInteractionActor_C::PartCollisionActorsAndCorrespondingTags' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, MaterialForProjection) == 0x0004E8, "Member 'ASceneInteractionActor_C::MaterialForProjection' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, SkeletalMeshActors) == 0x0004F0, "Member 'ASceneInteractionActor_C::SkeletalMeshActors' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, ReceivingDecalsActors) == 0x000500, "Member 'ASceneInteractionActor_C::ReceivingDecalsActors' has a wrong offset!");
static_assert(offsetof(ASceneInteractionActor_C, InteractionMaterialController) == 0x000510, "Member 'ASceneInteractionActor_C::InteractionMaterialController' has a wrong offset!");

}

