#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCommonQteButton

#include "Basic.hpp"

#include "ECommonQteInputAction_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LGUI_structs.hpp"


namespace SDK
{

// UserDefinedStruct SCommonQteButton.SCommonQteButton
// 0x0048 (0x0048 - 0x0000)
struct FSCommonQteButton final
{
public:
	ECommonQteInputAction                         Action_22_BEE201624F8C42CD7E3068B4405D79DC;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ULGUITexturePackerSpriteData> Icon_12_9597A3ED443AEFEB19F47F8EDCB774E4;     // 0x0008(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EUIAnchorHorizontalAlign                      AnchorHAlign_13_4BBFAE1242753435D28254BFDF81A27D;  // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIAnchorVerticalAlign                        AnchorVAlign_14_6C94AAEE40FD1863900CC6B2F6F9A2E2;  // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              AnchorOffset_15_082F5366466B8444EA863FAF524C86B1;  // 0x003C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSCommonQteButton) == 0x000008, "Wrong alignment on FSCommonQteButton");
static_assert(sizeof(FSCommonQteButton) == 0x000048, "Wrong size on FSCommonQteButton");
static_assert(offsetof(FSCommonQteButton, Action_22_BEE201624F8C42CD7E3068B4405D79DC) == 0x000000, "Member 'FSCommonQteButton::Action_22_BEE201624F8C42CD7E3068B4405D79DC' has a wrong offset!");
static_assert(offsetof(FSCommonQteButton, Icon_12_9597A3ED443AEFEB19F47F8EDCB774E4) == 0x000008, "Member 'FSCommonQteButton::Icon_12_9597A3ED443AEFEB19F47F8EDCB774E4' has a wrong offset!");
static_assert(offsetof(FSCommonQteButton, AnchorHAlign_13_4BBFAE1242753435D28254BFDF81A27D) == 0x000038, "Member 'FSCommonQteButton::AnchorHAlign_13_4BBFAE1242753435D28254BFDF81A27D' has a wrong offset!");
static_assert(offsetof(FSCommonQteButton, AnchorVAlign_14_6C94AAEE40FD1863900CC6B2F6F9A2E2) == 0x000039, "Member 'FSCommonQteButton::AnchorVAlign_14_6C94AAEE40FD1863900CC6B2F6F9A2E2' has a wrong offset!");
static_assert(offsetof(FSCommonQteButton, AnchorOffset_15_082F5366466B8444EA863FAF524C86B1) == 0x00003C, "Member 'FSCommonQteButton::AnchorOffset_15_082F5366466B8444EA863FAF524C86B1' has a wrong offset!");

}

