#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCommonQte_ContinuousClick

#include "Basic.hpp"

#include "ECommonQteViewType_SingleButtonContinuousClick_structs.hpp"
#include "ECommonQteInteractiveTiming_structs.hpp"
#include "SCommonQteButton_structs.hpp"


namespace SDK
{

// UserDefinedStruct SCommonQte_ContinuousClick.SCommonQte_ContinuousClick
// 0x0080 (0x0080 - 0x0000)
struct FSCommonQte_ContinuousClick final
{
public:
	ECommonQteViewType_SingleButtonContinuousClick ViewType_31_18444E3942D5E78BD3CCE2853B53FED6;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCommonQteButton                      UIConfig_24_17F2A82548DE4864C1C98DAD76E7E0B1;      // 0x0008(0x0048)(Edit, BlueprintVisible, HasGetValueTypeHash)
	ECommonQteInteractiveTiming                   InteractiveTiming_30_E8AC86F443D02F74858377A1C94A1910; // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowBorder_29_1520ECF942FF61AC7AC266951688E335;  // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsShowTip_35_15E22DD34E6478130985D2AA7DFACC42;     // 0x0052(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TipTextId_47_A70E38514FB4B63902B907B4A0B3671B;     // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         InitialEnergyPercent_2_7BDE45A34B820A0E374DCA86A172B0AA; // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetEnergyPercent_4_1B0F6C9144FFF585CBC089BB46E09FB5; // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaEnergyPercentPerSecond_6_373E96854E6E56C83204A19E0C7CBB51; // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaEnergyPercentPerClick_18_44F348D34D4251A1E52FD180679FA777; // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PerformInterpSpeedForEnergyPercent_43_0770FFC944A5AB55B47ED780FF88E456; // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSCommonQte_ContinuousClick) == 0x000008, "Wrong alignment on FSCommonQte_ContinuousClick");
static_assert(sizeof(FSCommonQte_ContinuousClick) == 0x000080, "Wrong size on FSCommonQte_ContinuousClick");
static_assert(offsetof(FSCommonQte_ContinuousClick, ViewType_31_18444E3942D5E78BD3CCE2853B53FED6) == 0x000000, "Member 'FSCommonQte_ContinuousClick::ViewType_31_18444E3942D5E78BD3CCE2853B53FED6' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, UIConfig_24_17F2A82548DE4864C1C98DAD76E7E0B1) == 0x000008, "Member 'FSCommonQte_ContinuousClick::UIConfig_24_17F2A82548DE4864C1C98DAD76E7E0B1' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, InteractiveTiming_30_E8AC86F443D02F74858377A1C94A1910) == 0x000050, "Member 'FSCommonQte_ContinuousClick::InteractiveTiming_30_E8AC86F443D02F74858377A1C94A1910' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, IsShowBorder_29_1520ECF942FF61AC7AC266951688E335) == 0x000051, "Member 'FSCommonQte_ContinuousClick::IsShowBorder_29_1520ECF942FF61AC7AC266951688E335' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, IsShowTip_35_15E22DD34E6478130985D2AA7DFACC42) == 0x000052, "Member 'FSCommonQte_ContinuousClick::IsShowTip_35_15E22DD34E6478130985D2AA7DFACC42' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, TipTextId_47_A70E38514FB4B63902B907B4A0B3671B) == 0x000058, "Member 'FSCommonQte_ContinuousClick::TipTextId_47_A70E38514FB4B63902B907B4A0B3671B' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, InitialEnergyPercent_2_7BDE45A34B820A0E374DCA86A172B0AA) == 0x000068, "Member 'FSCommonQte_ContinuousClick::InitialEnergyPercent_2_7BDE45A34B820A0E374DCA86A172B0AA' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, TargetEnergyPercent_4_1B0F6C9144FFF585CBC089BB46E09FB5) == 0x00006C, "Member 'FSCommonQte_ContinuousClick::TargetEnergyPercent_4_1B0F6C9144FFF585CBC089BB46E09FB5' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, DeltaEnergyPercentPerSecond_6_373E96854E6E56C83204A19E0C7CBB51) == 0x000070, "Member 'FSCommonQte_ContinuousClick::DeltaEnergyPercentPerSecond_6_373E96854E6E56C83204A19E0C7CBB51' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, DeltaEnergyPercentPerClick_18_44F348D34D4251A1E52FD180679FA777) == 0x000074, "Member 'FSCommonQte_ContinuousClick::DeltaEnergyPercentPerClick_18_44F348D34D4251A1E52FD180679FA777' has a wrong offset!");
static_assert(offsetof(FSCommonQte_ContinuousClick, PerformInterpSpeedForEnergyPercent_43_0770FFC944A5AB55B47ED780FF88E456) == 0x000078, "Member 'FSCommonQte_ContinuousClick::PerformInterpSpeedForEnergyPercent_43_0770FFC944A5AB55B47ED780FF88E456' has a wrong offset!");

}

