#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SInputCommandTransform

#include "Basic.hpp"

#include "EInputAction_structs.hpp"
#include "SSkillBehaviorCondition_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EInputState_structs.hpp"
#include "sInputCommand_structs.hpp"


namespace SDK
{

// UserDefinedStruct SInputCommandTransform.SInputCommandTransform
// 0x0058 (0x0058 - 0x0000)
struct FSInputCommandTransform final
{
public:
	class FString                                 Desc_2_79D2BAD242819FAC1A30968E06BE444E;           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EInputAction                                  Action_5_F97621724288CEEA7F3477A41209AE91;         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputState                                   State_12_136F539C4787B626189D819738985C8F;         // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag_24_AE78E5A64BB6C2BAA5300DBB4C47EF16;           // 0x0014(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSSkillBehaviorCondition>       BehaviorConditionGroup_16_3DC0C63E4FAACBA04C5755A9D8887A44; // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FString                                 BehaviorConditionFormula_20_A2A5CE3947819059351FDAB1C848414C; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         Command_23_061595D1437A329EE2E95EB7542A6A0B;       // 0x0040(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSInputCommandTransform) == 0x000008, "Wrong alignment on FSInputCommandTransform");
static_assert(sizeof(FSInputCommandTransform) == 0x000058, "Wrong size on FSInputCommandTransform");
static_assert(offsetof(FSInputCommandTransform, Desc_2_79D2BAD242819FAC1A30968E06BE444E) == 0x000000, "Member 'FSInputCommandTransform::Desc_2_79D2BAD242819FAC1A30968E06BE444E' has a wrong offset!");
static_assert(offsetof(FSInputCommandTransform, Action_5_F97621724288CEEA7F3477A41209AE91) == 0x000010, "Member 'FSInputCommandTransform::Action_5_F97621724288CEEA7F3477A41209AE91' has a wrong offset!");
static_assert(offsetof(FSInputCommandTransform, State_12_136F539C4787B626189D819738985C8F) == 0x000011, "Member 'FSInputCommandTransform::State_12_136F539C4787B626189D819738985C8F' has a wrong offset!");
static_assert(offsetof(FSInputCommandTransform, Tag_24_AE78E5A64BB6C2BAA5300DBB4C47EF16) == 0x000014, "Member 'FSInputCommandTransform::Tag_24_AE78E5A64BB6C2BAA5300DBB4C47EF16' has a wrong offset!");
static_assert(offsetof(FSInputCommandTransform, BehaviorConditionGroup_16_3DC0C63E4FAACBA04C5755A9D8887A44) == 0x000020, "Member 'FSInputCommandTransform::BehaviorConditionGroup_16_3DC0C63E4FAACBA04C5755A9D8887A44' has a wrong offset!");
static_assert(offsetof(FSInputCommandTransform, BehaviorConditionFormula_20_A2A5CE3947819059351FDAB1C848414C) == 0x000030, "Member 'FSInputCommandTransform::BehaviorConditionFormula_20_A2A5CE3947819059351FDAB1C848414C' has a wrong offset!");
static_assert(offsetof(FSInputCommandTransform, Command_23_061595D1437A329EE2E95EB7542A6A0B) == 0x000040, "Member 'FSInputCommandTransform::Command_23_061595D1437A329EE2E95EB7542A6A0B' has a wrong offset!");

}

