#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SLockOnFollowShooter

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SLockOnFollowShooter.SLockOnFollowShooter
// 0x0010 (0x0010 - 0x0000)
struct FSLockOnFollowShooter final
{
public:
	bool                                          Enable_10_0A4B539E4EB9F18771BCECB4296FA033;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GapTime_4_2C6A17E4438FDFC72F07FAAE4C1DA353;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Distance_12_CDE2B3DD48D8E5ABE7CEEE8B56EDDEDB;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Radius_9_CFF8B5764AF3E74E4F4CFABC1625944D;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSLockOnFollowShooter) == 0x000004, "Wrong alignment on FSLockOnFollowShooter");
static_assert(sizeof(FSLockOnFollowShooter) == 0x000010, "Wrong size on FSLockOnFollowShooter");
static_assert(offsetof(FSLockOnFollowShooter, Enable_10_0A4B539E4EB9F18771BCECB4296FA033) == 0x000000, "Member 'FSLockOnFollowShooter::Enable_10_0A4B539E4EB9F18771BCECB4296FA033' has a wrong offset!");
static_assert(offsetof(FSLockOnFollowShooter, GapTime_4_2C6A17E4438FDFC72F07FAAE4C1DA353) == 0x000004, "Member 'FSLockOnFollowShooter::GapTime_4_2C6A17E4438FDFC72F07FAAE4C1DA353' has a wrong offset!");
static_assert(offsetof(FSLockOnFollowShooter, Distance_12_CDE2B3DD48D8E5ABE7CEEE8B56EDDEDB) == 0x000008, "Member 'FSLockOnFollowShooter::Distance_12_CDE2B3DD48D8E5ABE7CEEE8B56EDDEDB' has a wrong offset!");
static_assert(offsetof(FSLockOnFollowShooter, Radius_9_CFF8B5764AF3E74E4F4CFABC1625944D) == 0x00000C, "Member 'FSLockOnFollowShooter::Radius_9_CFF8B5764AF3E74E4F4CFABC1625944D' has a wrong offset!");

}

