#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SSceneInteractionitem

#include "Basic.hpp"

#include "SSceneInteractionitemIndestructibleEffectsParameters_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "SSceneInteractionSequence_structs.hpp"
#include "SSceneInteractionMontage_structs.hpp"
#include "SSceneInteractionMaterialController_structs.hpp"
#include "SSceneInteractionAudio_structs.hpp"
#include "SStateBasedEffect_structs.hpp"
#include "SSceneInteractionCrossStateEffect_structs.hpp"
#include "SSceneInteractionActorSkeletalmeshDestructible_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct SSceneInteractionitem.SSceneInteractionitem
// 0x0200 (0x0200 - 0x0000)
struct FSSceneInteractionitem final
{
public:
	class FString                                 Name_115_FFED5F8840F2D109EC72A8B694552791;         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSSceneInteractionSequence             Sequence_36_B8940AC64CC949B03180C8B44D27357D;      // 0x0010(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSSceneInteractionMontage              AnimMontage_35_18248B464237B126EE78CBBD099741AF;   // 0x0020(0x0018)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_EffectActor_C*>              Effects_89_54B6DE4441F3AEADA2B6158A3CE7A73A;       // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         Actors_30_3CB998D844868816DFA499A2D346ED92;        // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         HideActors_28_0358E37C417F8434637F2882B09FAA0A;    // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<EKuroSceneInteractionState, EKuroSceneInteractionState> TransitionMap_43_687ABCC0441F5CD4AECFAD9D7EA2B413; // 0x0068(0x0050)(Edit, BlueprintVisible)
	TArray<struct FSSceneInteractionMaterialController> MaterialControllers_50_0EBC035B4225A706D705E986C7C02F96; // 0x00B8(0x0010)(Edit, BlueprintVisible)
	struct FSSceneInteractionAudio                AkEvent_55_13AFBE064E3EE720B032EEB28FD64E67;       // 0x00C8(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSStateBasedEffect>             StateBasedEffect_64_73E7A59A47D638467E5151AD988AC976; // 0x00D8(0x0010)(Edit, BlueprintVisible)
	bool                                          IsForceSetState_66_E46DD56C4B1577706375779EE9901CDC; // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD_CharacterControllerDataGroup_C*     CharacterDataGroupForOrgan_69_B03A0A914328798FF4DDB6A1EBC5C950; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSSceneInteractionitemIndestructibleEffectsParameters> IndestructibleEffectsParameters_82_B16BD5A64450652CED7731AF68D8E053; // 0x00F8(0x0010)(Edit, BlueprintVisible)
	TArray<class ADestructibleActor*>             DestructibleActors_99_A07716B4422E6A54621BEDB3F449F6E9; // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FSSceneInteractionCrossStateEffect> CrossStateEffects_109_5016CE794DA6206622021E974D237C3F; // 0x0118(0x0010)(Edit, BlueprintVisible)
	float                                         TransitionTime_112_12FA0D394CCB866377EB3CAF50BC4FCF; // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedExpressionAnyway_124_E922E35944150267116058B40F3428FE; // 0x012C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MaterialRuntimeParUpdate_C*         BP_MaterialRuntimeParUpdate_127_9A0CC7B346E88F894D52DB86AA793A1A; // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSSceneInteractionActorSkeletalMeshDestructible SkeletalMeshDestructible_130_3EEAC93A44C8ED181B770F9E64CC1407; // 0x0138(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMap<class AActor*, struct FCollisionProfileName> EnterStateActorCollisionProfile_145_269B4C09457B0627372B7F8295647243; // 0x0158(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<class AActor*, struct FCollisionProfileName> ExitStateActorCollisionProfile_147_C168A2DC488D39A04D4C9CBE4877E466; // 0x01A8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          WaitForPlayableFinished_144_B68E6DD24B98F3700493C8AC9702D334; // 0x01F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSSceneInteractionitem) == 0x000008, "Wrong alignment on FSSceneInteractionitem");
static_assert(sizeof(FSSceneInteractionitem) == 0x000200, "Wrong size on FSSceneInteractionitem");
static_assert(offsetof(FSSceneInteractionitem, Name_115_FFED5F8840F2D109EC72A8B694552791) == 0x000000, "Member 'FSSceneInteractionitem::Name_115_FFED5F8840F2D109EC72A8B694552791' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, Sequence_36_B8940AC64CC949B03180C8B44D27357D) == 0x000010, "Member 'FSSceneInteractionitem::Sequence_36_B8940AC64CC949B03180C8B44D27357D' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, AnimMontage_35_18248B464237B126EE78CBBD099741AF) == 0x000020, "Member 'FSSceneInteractionitem::AnimMontage_35_18248B464237B126EE78CBBD099741AF' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, Effects_89_54B6DE4441F3AEADA2B6158A3CE7A73A) == 0x000038, "Member 'FSSceneInteractionitem::Effects_89_54B6DE4441F3AEADA2B6158A3CE7A73A' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, Actors_30_3CB998D844868816DFA499A2D346ED92) == 0x000048, "Member 'FSSceneInteractionitem::Actors_30_3CB998D844868816DFA499A2D346ED92' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, HideActors_28_0358E37C417F8434637F2882B09FAA0A) == 0x000058, "Member 'FSSceneInteractionitem::HideActors_28_0358E37C417F8434637F2882B09FAA0A' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, TransitionMap_43_687ABCC0441F5CD4AECFAD9D7EA2B413) == 0x000068, "Member 'FSSceneInteractionitem::TransitionMap_43_687ABCC0441F5CD4AECFAD9D7EA2B413' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, MaterialControllers_50_0EBC035B4225A706D705E986C7C02F96) == 0x0000B8, "Member 'FSSceneInteractionitem::MaterialControllers_50_0EBC035B4225A706D705E986C7C02F96' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, AkEvent_55_13AFBE064E3EE720B032EEB28FD64E67) == 0x0000C8, "Member 'FSSceneInteractionitem::AkEvent_55_13AFBE064E3EE720B032EEB28FD64E67' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, StateBasedEffect_64_73E7A59A47D638467E5151AD988AC976) == 0x0000D8, "Member 'FSSceneInteractionitem::StateBasedEffect_64_73E7A59A47D638467E5151AD988AC976' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, IsForceSetState_66_E46DD56C4B1577706375779EE9901CDC) == 0x0000E8, "Member 'FSSceneInteractionitem::IsForceSetState_66_E46DD56C4B1577706375779EE9901CDC' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, CharacterDataGroupForOrgan_69_B03A0A914328798FF4DDB6A1EBC5C950) == 0x0000F0, "Member 'FSSceneInteractionitem::CharacterDataGroupForOrgan_69_B03A0A914328798FF4DDB6A1EBC5C950' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, IndestructibleEffectsParameters_82_B16BD5A64450652CED7731AF68D8E053) == 0x0000F8, "Member 'FSSceneInteractionitem::IndestructibleEffectsParameters_82_B16BD5A64450652CED7731AF68D8E053' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, DestructibleActors_99_A07716B4422E6A54621BEDB3F449F6E9) == 0x000108, "Member 'FSSceneInteractionitem::DestructibleActors_99_A07716B4422E6A54621BEDB3F449F6E9' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, CrossStateEffects_109_5016CE794DA6206622021E974D237C3F) == 0x000118, "Member 'FSSceneInteractionitem::CrossStateEffects_109_5016CE794DA6206622021E974D237C3F' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, TransitionTime_112_12FA0D394CCB866377EB3CAF50BC4FCF) == 0x000128, "Member 'FSSceneInteractionitem::TransitionTime_112_12FA0D394CCB866377EB3CAF50BC4FCF' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, NeedExpressionAnyway_124_E922E35944150267116058B40F3428FE) == 0x00012C, "Member 'FSSceneInteractionitem::NeedExpressionAnyway_124_E922E35944150267116058B40F3428FE' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, BP_MaterialRuntimeParUpdate_127_9A0CC7B346E88F894D52DB86AA793A1A) == 0x000130, "Member 'FSSceneInteractionitem::BP_MaterialRuntimeParUpdate_127_9A0CC7B346E88F894D52DB86AA793A1A' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, SkeletalMeshDestructible_130_3EEAC93A44C8ED181B770F9E64CC1407) == 0x000138, "Member 'FSSceneInteractionitem::SkeletalMeshDestructible_130_3EEAC93A44C8ED181B770F9E64CC1407' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, EnterStateActorCollisionProfile_145_269B4C09457B0627372B7F8295647243) == 0x000158, "Member 'FSSceneInteractionitem::EnterStateActorCollisionProfile_145_269B4C09457B0627372B7F8295647243' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, ExitStateActorCollisionProfile_147_C168A2DC488D39A04D4C9CBE4877E466) == 0x0001A8, "Member 'FSSceneInteractionitem::ExitStateActorCollisionProfile_147_C168A2DC488D39A04D4C9CBE4877E466' has a wrong offset!");
static_assert(offsetof(FSSceneInteractionitem, WaitForPlayableFinished_144_B68E6DD24B98F3700493C8AC9702D334) == 0x0001F8, "Member 'FSSceneInteractionitem::WaitForPlayableFinished_144_B68E6DD24B98F3700493C8AC9702D334' has a wrong offset!");

}

