#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SSequenceCamera_SpecificConfig

#include "Basic.hpp"

#include "ESequenceCameraAnsEffectiveClientType_structs.hpp"
#include "ESequenceCameraSpecificType_structs.hpp"


namespace SDK
{

// UserDefinedStruct SSequenceCamera_SpecificConfig.SSequenceCamera_SpecificConfig
// 0x0010 (0x0010 - 0x0000)
struct FSSequenceCamera_SpecificConfig final
{
public:
	ESequenceCameraSpecificType                   SpecificType_15_50AB36014A88C4E7CC96A0A34AEB7D72;  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideSequenceTime_17_2399CDF14D0B86FADE36E7A7CFD0481B; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverrideBlendOutTime_18_1D2DFCA140CDF02915E029891E4D4788; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceCameraAnsEffectiveClientType         OverrideCondition_21_31248186440632D4E0F4CDA0B3511622; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRecoverRotation_24_0A7E7DB54F99BC4EBEBA12BB296047CC; // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSSequenceCamera_SpecificConfig) == 0x000004, "Wrong alignment on FSSequenceCamera_SpecificConfig");
static_assert(sizeof(FSSequenceCamera_SpecificConfig) == 0x000010, "Wrong size on FSSequenceCamera_SpecificConfig");
static_assert(offsetof(FSSequenceCamera_SpecificConfig, SpecificType_15_50AB36014A88C4E7CC96A0A34AEB7D72) == 0x000000, "Member 'FSSequenceCamera_SpecificConfig::SpecificType_15_50AB36014A88C4E7CC96A0A34AEB7D72' has a wrong offset!");
static_assert(offsetof(FSSequenceCamera_SpecificConfig, OverrideSequenceTime_17_2399CDF14D0B86FADE36E7A7CFD0481B) == 0x000004, "Member 'FSSequenceCamera_SpecificConfig::OverrideSequenceTime_17_2399CDF14D0B86FADE36E7A7CFD0481B' has a wrong offset!");
static_assert(offsetof(FSSequenceCamera_SpecificConfig, OverrideBlendOutTime_18_1D2DFCA140CDF02915E029891E4D4788) == 0x000008, "Member 'FSSequenceCamera_SpecificConfig::OverrideBlendOutTime_18_1D2DFCA140CDF02915E029891E4D4788' has a wrong offset!");
static_assert(offsetof(FSSequenceCamera_SpecificConfig, OverrideCondition_21_31248186440632D4E0F4CDA0B3511622) == 0x00000C, "Member 'FSSequenceCamera_SpecificConfig::OverrideCondition_21_31248186440632D4E0F4CDA0B3511622' has a wrong offset!");
static_assert(offsetof(FSSequenceCamera_SpecificConfig, IsRecoverRotation_24_0A7E7DB54F99BC4EBEBA12BB296047CC) == 0x00000D, "Member 'FSSequenceCamera_SpecificConfig::IsRecoverRotation_24_0A7E7DB54F99BC4EBEBA12BB296047CC' has a wrong offset!");

}

