#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SSpecialEnergyBar

#include "Basic.hpp"

#include "ESpecialEnergyBarPrefabType_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SSpecialEnergyBarKey_structs.hpp"


namespace SDK
{

// UserDefinedStruct SSpecialEnergyBar.SSpecialEnergyBar
// 0x01A8 (0x01A8 - 0x0000)
struct FSSpecialEnergyBar final
{
public:
	class FString                                 Name_2_C39CDBBF409469DCF96974B4E03ED6F9;           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	ESpecialEnergyBarPrefabType                   PrefabType_115_34BDB3AE48638D5CF67EEC9A1B4378DA;   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_363F[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ExtraType_169_36C378BE4256A36F272B87AB26132598;    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotNum_126_E7916B8C47391E6AAAF2178D79DC396F;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3640[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ExtraFloatParams_130_F64FCDB74317682714A850A8BDF1E5E5; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UPrefabAsset>            PrefabPath_6_D3E0271649443A790645EFB3945D0903;     // 0x0030(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         AttributeId_9_6C3F6EBD441A30C3C6EA09B019FCAEC5;    // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAttributeId_11_1D46A5CC47E357D1B3848E831C3A9897; // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         BuffId_133_34E7489A4E4A3BB47428CE958F039353;       // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, int32>              TagEnergyBarIdMap_122_23425FDB40B244DF21D7358D443435A6; // 0x0070(0x0050)(Edit, BlueprintVisible)
	class FString                                 EffectColor_96_B669342E4F4C470D04DFE8AA3D9ABC23;   // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PointColor_136_7EF590B04BE65DBEDD8285A332812D34;   // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              TexturePath_173_6A10CBA4484098EBEF412B8FC8C296E6;  // 0x00E0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              EnableTexturePath_177_492DD2EF451F3864F5DFB9A9C2A1F7ED; // 0x0110(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              FrontTexturePath_179_687F374D45311CFA7FE06090A4E9D084; // 0x0140(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UNiagaraSystem>>  NiagaraList_145_2BC58AB540AF00F7ADD49BA60C96D3E6;  // 0x0170(0x0010)(Edit, BlueprintVisible)
	int32                                         KeyEnableNiagaraIndex_150_17032E5C4FB664FDE6EABDA5C41D1278; // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KeyType_113_74271F1F43580C0F10BE239847EFC8E7;      // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DisableKeyOnPercent_117_8269AE0F47D830FBC01E608120E63D8D; // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           KeyEnableTag_154_EFE4A8724BFFE62197A795AD4E07FD34; // 0x018C(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSSpecialEnergyBarKey>          KeyInfoList_112_4E2A3BA5436E9DBCDE6CF894A3F9F9BC;  // 0x0198(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FSSpecialEnergyBar) == 0x000008, "Wrong alignment on FSSpecialEnergyBar");
static_assert(sizeof(FSSpecialEnergyBar) == 0x0001A8, "Wrong size on FSSpecialEnergyBar");
static_assert(offsetof(FSSpecialEnergyBar, Name_2_C39CDBBF409469DCF96974B4E03ED6F9) == 0x000000, "Member 'FSSpecialEnergyBar::Name_2_C39CDBBF409469DCF96974B4E03ED6F9' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, PrefabType_115_34BDB3AE48638D5CF67EEC9A1B4378DA) == 0x000010, "Member 'FSSpecialEnergyBar::PrefabType_115_34BDB3AE48638D5CF67EEC9A1B4378DA' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, ExtraType_169_36C378BE4256A36F272B87AB26132598) == 0x000014, "Member 'FSSpecialEnergyBar::ExtraType_169_36C378BE4256A36F272B87AB26132598' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, SlotNum_126_E7916B8C47391E6AAAF2178D79DC396F) == 0x000018, "Member 'FSSpecialEnergyBar::SlotNum_126_E7916B8C47391E6AAAF2178D79DC396F' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, ExtraFloatParams_130_F64FCDB74317682714A850A8BDF1E5E5) == 0x000020, "Member 'FSSpecialEnergyBar::ExtraFloatParams_130_F64FCDB74317682714A850A8BDF1E5E5' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, PrefabPath_6_D3E0271649443A790645EFB3945D0903) == 0x000030, "Member 'FSSpecialEnergyBar::PrefabPath_6_D3E0271649443A790645EFB3945D0903' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, AttributeId_9_6C3F6EBD441A30C3C6EA09B019FCAEC5) == 0x000060, "Member 'FSSpecialEnergyBar::AttributeId_9_6C3F6EBD441A30C3C6EA09B019FCAEC5' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, MaxAttributeId_11_1D46A5CC47E357D1B3848E831C3A9897) == 0x000064, "Member 'FSSpecialEnergyBar::MaxAttributeId_11_1D46A5CC47E357D1B3848E831C3A9897' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, BuffId_133_34E7489A4E4A3BB47428CE958F039353) == 0x000068, "Member 'FSSpecialEnergyBar::BuffId_133_34E7489A4E4A3BB47428CE958F039353' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, TagEnergyBarIdMap_122_23425FDB40B244DF21D7358D443435A6) == 0x000070, "Member 'FSSpecialEnergyBar::TagEnergyBarIdMap_122_23425FDB40B244DF21D7358D443435A6' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, EffectColor_96_B669342E4F4C470D04DFE8AA3D9ABC23) == 0x0000C0, "Member 'FSSpecialEnergyBar::EffectColor_96_B669342E4F4C470D04DFE8AA3D9ABC23' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, PointColor_136_7EF590B04BE65DBEDD8285A332812D34) == 0x0000D0, "Member 'FSSpecialEnergyBar::PointColor_136_7EF590B04BE65DBEDD8285A332812D34' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, TexturePath_173_6A10CBA4484098EBEF412B8FC8C296E6) == 0x0000E0, "Member 'FSSpecialEnergyBar::TexturePath_173_6A10CBA4484098EBEF412B8FC8C296E6' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, EnableTexturePath_177_492DD2EF451F3864F5DFB9A9C2A1F7ED) == 0x000110, "Member 'FSSpecialEnergyBar::EnableTexturePath_177_492DD2EF451F3864F5DFB9A9C2A1F7ED' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, FrontTexturePath_179_687F374D45311CFA7FE06090A4E9D084) == 0x000140, "Member 'FSSpecialEnergyBar::FrontTexturePath_179_687F374D45311CFA7FE06090A4E9D084' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, NiagaraList_145_2BC58AB540AF00F7ADD49BA60C96D3E6) == 0x000170, "Member 'FSSpecialEnergyBar::NiagaraList_145_2BC58AB540AF00F7ADD49BA60C96D3E6' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, KeyEnableNiagaraIndex_150_17032E5C4FB664FDE6EABDA5C41D1278) == 0x000180, "Member 'FSSpecialEnergyBar::KeyEnableNiagaraIndex_150_17032E5C4FB664FDE6EABDA5C41D1278' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, KeyType_113_74271F1F43580C0F10BE239847EFC8E7) == 0x000184, "Member 'FSSpecialEnergyBar::KeyType_113_74271F1F43580C0F10BE239847EFC8E7' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, DisableKeyOnPercent_117_8269AE0F47D830FBC01E608120E63D8D) == 0x000188, "Member 'FSSpecialEnergyBar::DisableKeyOnPercent_117_8269AE0F47D830FBC01E608120E63D8D' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, KeyEnableTag_154_EFE4A8724BFFE62197A795AD4E07FD34) == 0x00018C, "Member 'FSSpecialEnergyBar::KeyEnableTag_154_EFE4A8724BFFE62197A795AD4E07FD34' has a wrong offset!");
static_assert(offsetof(FSSpecialEnergyBar, KeyInfoList_112_4E2A3BA5436E9DBCDE6CF894A3F9F9BC) == 0x000198, "Member 'FSSpecialEnergyBar::KeyInfoList_112_4E2A3BA5436E9DBCDE6CF894A3F9F9BC' has a wrong offset!");

}

