#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAiController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KuroGameplay_classes.hpp"
#include "ECharacterState_structs.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsAiController.TsAiController_C
// 0x0018 (0x03D8 - 0x03C0)
class ATsAiController_C : public AKuroAIController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBehaviorTree*                          BehaviorTree;                                      // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKuroStateMachineGroup*                 StateMachineGroup;                                 // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TsAiController(int32 EntryPoint);
	void ReceiveDestroyed();
	void ActivateSkillGroup(int32 skillGroupIndex, bool activate);
	void AddSkillCd(int32 skillInfoId, float cdAdd);
	void SetBattleWanderTime(float min_0, float max_0);
	void AddComplicatedEventBinder(const struct FSAiConditions& conditions, class UKuroBooleanEventBinder* eventBinder);
	void OnStart();
	class FText GetDebugText();
	void ChangeHatred(int32 entityId, float rate, float abs);
	void ClearHatred(int32 entityId);
	void SetBattleWanderIndex(int32 index);
	void AddBattleWanderEndTime(float addTime);
	void TestChangeAi(const class FString& id);
	void AicApplyBuff(int64 buffId);
	void AicRemoveBuff(int64 buffId);
	void AicAddTag(const struct FGameplayTag& tag);
	void AicRemoveTag(const struct FGameplayTag& tag);
	void SetAiEnable(bool enable, const class FString& key);
	void LogReport(int32 logId);
	void SetAiSenseEnable(int32 index, bool enable);
	void AddOrRemoveAiSense(int32 aiSenseId, bool add);
	void EnableAiSenseByType(int32 type, bool enable);
	void AddHateEventBinder(class UKuroPerceptionEventBinder* handler1);
	void AddPerceptionEventBinder(class UKuroPerceptionEventBinder* handler);
	void AddHateOutRangeEventBinder(class UKuroPerceptionEventBinder* handler);
	void SetPerceptionEventState(bool includeFriend, bool includeEnemy, bool includeNeutral);
	void AddSceneItemDestroyEventBinder(float distance, class UKuroActorEventBinder* eventBinder);
	void SetAiHateConfig(const class FString& configId);
	void AddAlertEventBinder(class UKuroBooleanEventBinder* eventBinder);
	void SetAiAlertConfig(const class FString& configId);
	bool GetCoolDownDone(int32 id);
	float GetCoolDownRemainTime(int32 id);
	void SetCoolDown(int32 id, float cd);
	void InitCooldownEvent(int32 id, class UKuroBooleanEventBinder* eventBinder);
	void StartCooldownTimer(int32 id, float duration);
	bool 逻辑主控();
	bool 移动主控();
	void 获取控制权时();
	void 状态切换时(ECharacterState oldState, ECharacterState newState, bool isAutonomousProxy);
	bool 检查状态机状态(TArray<class FString>& states);
	void 切换状态机状态(TArray<class FString>& states);
	void GetDebugStateMachine(TArray<class FText>& output);
	void AicApplyBuffToTarget(int32 targetId, int64 buffId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsAiController_C">();
	}
	static class ATsAiController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATsAiController_C>();
	}
};
static_assert(alignof(ATsAiController_C) == 0x000008, "Wrong alignment on ATsAiController_C");
static_assert(sizeof(ATsAiController_C) == 0x0003D8, "Wrong size on ATsAiController_C");
static_assert(offsetof(ATsAiController_C, UberGraphFrame) == 0x0003C0, "Member 'ATsAiController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATsAiController_C, BehaviorTree) == 0x0003C8, "Member 'ATsAiController_C::BehaviorTree' has a wrong offset!");
static_assert(offsetof(ATsAiController_C, StateMachineGroup) == 0x0003D0, "Member 'ATsAiController_C::StateMachineGroup' has a wrong offset!");

}

