#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAnimNotifyStateCleanBurstCamera

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsAnimNotifyStateCleanBurstCamera.TsAnimNotifyStateCleanBurstCamera_C
// 0x0008 (0x0050 - 0x0048)
class UTsAnimNotifyStateCleanBurstCamera_C final : public UKuroAnimNotifyState
{
public:
	bool                                          隐藏敌对目标Mesh;                                  // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          隐藏敌对目标特效;                                  // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          不接受命中特效;                                    // 0x004A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)

public:
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
	bool K2_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime);
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);

	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsAnimNotifyStateCleanBurstCamera_C">();
	}
	static class UTsAnimNotifyStateCleanBurstCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsAnimNotifyStateCleanBurstCamera_C>();
	}
};
static_assert(alignof(UTsAnimNotifyStateCleanBurstCamera_C) == 0x000008, "Wrong alignment on UTsAnimNotifyStateCleanBurstCamera_C");
static_assert(sizeof(UTsAnimNotifyStateCleanBurstCamera_C) == 0x000050, "Wrong size on UTsAnimNotifyStateCleanBurstCamera_C");
static_assert(offsetof(UTsAnimNotifyStateCleanBurstCamera_C, 隐藏敌对目标Mesh) == 0x000048, "Member 'UTsAnimNotifyStateCleanBurstCamera_C::隐藏敌对目标Mesh' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateCleanBurstCamera_C, 隐藏敌对目标特效) == 0x000049, "Member 'UTsAnimNotifyStateCleanBurstCamera_C::隐藏敌对目标特效' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateCleanBurstCamera_C, 不接受命中特效) == 0x00004A, "Member 'UTsAnimNotifyStateCleanBurstCamera_C::不接受命中特效' has a wrong offset!");

}

