#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAnimNotifyStateJumpLandDetect

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsAnimNotifyStateJumpLandDetect.TsAnimNotifyStateJumpLandDetect_C
// 0x0018 (0x0060 - 0x0048)
class UTsAnimNotifyStateJumpLandDetect_C final : public UKuroAnimNotifyState
{
public:
	float                                         MaxHeightOffset;                                   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IgnoreActorTag;                                    // 0x004C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyDown;                                          // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DebugDraw;                                         // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EndPointHeight;                                    // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
	bool K2_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime);
	void Init();

	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsAnimNotifyStateJumpLandDetect_C">();
	}
	static class UTsAnimNotifyStateJumpLandDetect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsAnimNotifyStateJumpLandDetect_C>();
	}
};
static_assert(alignof(UTsAnimNotifyStateJumpLandDetect_C) == 0x000008, "Wrong alignment on UTsAnimNotifyStateJumpLandDetect_C");
static_assert(sizeof(UTsAnimNotifyStateJumpLandDetect_C) == 0x000060, "Wrong size on UTsAnimNotifyStateJumpLandDetect_C");
static_assert(offsetof(UTsAnimNotifyStateJumpLandDetect_C, MaxHeightOffset) == 0x000048, "Member 'UTsAnimNotifyStateJumpLandDetect_C::MaxHeightOffset' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateJumpLandDetect_C, IgnoreActorTag) == 0x00004C, "Member 'UTsAnimNotifyStateJumpLandDetect_C::IgnoreActorTag' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateJumpLandDetect_C, OnlyDown) == 0x000058, "Member 'UTsAnimNotifyStateJumpLandDetect_C::OnlyDown' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateJumpLandDetect_C, DebugDraw) == 0x000059, "Member 'UTsAnimNotifyStateJumpLandDetect_C::DebugDraw' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateJumpLandDetect_C, EndPointHeight) == 0x00005C, "Member 'UTsAnimNotifyStateJumpLandDetect_C::EndPointHeight' has a wrong offset!");

}

