#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAnimNotifyAudioEvent

#include "Basic.hpp"

#include "SAudioEventProbabilityCooldownInfo_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsAnimNotifyAudioEvent.TsAnimNotifyAudioEvent_C
// 0x0058 (0x00A0 - 0x0048)
class UTsAnimNotifyAudioEvent_C final : public UKuroAnimNotify
{
public:
	TSoftObjectPtr<class UAkAudioEvent>           AudioEvent;                                        // 0x0048(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0078(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Follow;                                            // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSAudioEventProbabilityCooldownInfo    TagProbabilityInfo;                                // 0x0088(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	bool K2_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsAnimNotifyAudioEvent_C">();
	}
	static class UTsAnimNotifyAudioEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsAnimNotifyAudioEvent_C>();
	}
};
static_assert(alignof(UTsAnimNotifyAudioEvent_C) == 0x000008, "Wrong alignment on UTsAnimNotifyAudioEvent_C");
static_assert(sizeof(UTsAnimNotifyAudioEvent_C) == 0x0000A0, "Wrong size on UTsAnimNotifyAudioEvent_C");
static_assert(offsetof(UTsAnimNotifyAudioEvent_C, AudioEvent) == 0x000048, "Member 'UTsAnimNotifyAudioEvent_C::AudioEvent' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyAudioEvent_C, SocketName) == 0x000078, "Member 'UTsAnimNotifyAudioEvent_C::SocketName' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyAudioEvent_C, Follow) == 0x000084, "Member 'UTsAnimNotifyAudioEvent_C::Follow' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyAudioEvent_C, TagProbabilityInfo) == 0x000088, "Member 'UTsAnimNotifyAudioEvent_C::TagProbabilityInfo' has a wrong offset!");

}

