#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAnimNotifyStateSubMeshControl

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsAnimNotifyStateSubMeshControl.TsAnimNotifyStateSubMeshControl_C
// 0x0098 (0x00E0 - 0x0048)
class UTsAnimNotifyStateSubMeshControl_C final : public UKuroAnimNotifyState
{
public:
	class FString                                 MeshName;                                          // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ___;                                               // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD_CharacterControllerData_C*          __P_;                                              // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelBase>        __yH;                                              // 0x0068(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          ____0;                                             // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD_CharacterControllerData_C*          __P__0;                                            // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UEffectModelBase>        __yH_0;                                            // 0x00A8(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         ______;                                            // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _______0;                                          // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsAnimNotifyStateSubMeshControl_C">();
	}
	static class UTsAnimNotifyStateSubMeshControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsAnimNotifyStateSubMeshControl_C>();
	}
};
static_assert(alignof(UTsAnimNotifyStateSubMeshControl_C) == 0x000008, "Wrong alignment on UTsAnimNotifyStateSubMeshControl_C");
static_assert(sizeof(UTsAnimNotifyStateSubMeshControl_C) == 0x0000E0, "Wrong size on UTsAnimNotifyStateSubMeshControl_C");
static_assert(offsetof(UTsAnimNotifyStateSubMeshControl_C, MeshName) == 0x000048, "Member 'UTsAnimNotifyStateSubMeshControl_C::MeshName' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateSubMeshControl_C, ___) == 0x000058, "Member 'UTsAnimNotifyStateSubMeshControl_C::___' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateSubMeshControl_C, __P_) == 0x000060, "Member 'UTsAnimNotifyStateSubMeshControl_C::__P_' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateSubMeshControl_C, __yH) == 0x000068, "Member 'UTsAnimNotifyStateSubMeshControl_C::__yH' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateSubMeshControl_C, ____0) == 0x000098, "Member 'UTsAnimNotifyStateSubMeshControl_C::____0' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateSubMeshControl_C, __P__0) == 0x0000A0, "Member 'UTsAnimNotifyStateSubMeshControl_C::__P__0' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateSubMeshControl_C, __yH_0) == 0x0000A8, "Member 'UTsAnimNotifyStateSubMeshControl_C::__yH_0' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateSubMeshControl_C, ______) == 0x0000D8, "Member 'UTsAnimNotifyStateSubMeshControl_C::______' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateSubMeshControl_C, _______0) == 0x0000DC, "Member 'UTsAnimNotifyStateSubMeshControl_C::_______0' has a wrong offset!");

}

