#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAnimNotifyStateAbsoluteTimeStop

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsAnimNotifyStateAbsoluteTimeStop.TsAnimNotifyStateAbsoluteTimeStop_C
// 0x0008 (0x0050 - 0x0048)
class UTsAnimNotifyStateAbsoluteTimeStop_C final : public UKuroAnimNotifyState
{
public:
	bool                                          副本计时停止;                                      // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          角色战斗机制停止;                                  // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          怪物战斗机制停止;                                  // 0x004A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          是否冻结移动效果;                                  // 0x004B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);

	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsAnimNotifyStateAbsoluteTimeStop_C">();
	}
	static class UTsAnimNotifyStateAbsoluteTimeStop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsAnimNotifyStateAbsoluteTimeStop_C>();
	}
};
static_assert(alignof(UTsAnimNotifyStateAbsoluteTimeStop_C) == 0x000008, "Wrong alignment on UTsAnimNotifyStateAbsoluteTimeStop_C");
static_assert(sizeof(UTsAnimNotifyStateAbsoluteTimeStop_C) == 0x000050, "Wrong size on UTsAnimNotifyStateAbsoluteTimeStop_C");
static_assert(offsetof(UTsAnimNotifyStateAbsoluteTimeStop_C, 副本计时停止) == 0x000048, "Member 'UTsAnimNotifyStateAbsoluteTimeStop_C::副本计时停止' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateAbsoluteTimeStop_C, 角色战斗机制停止) == 0x000049, "Member 'UTsAnimNotifyStateAbsoluteTimeStop_C::角色战斗机制停止' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateAbsoluteTimeStop_C, 怪物战斗机制停止) == 0x00004A, "Member 'UTsAnimNotifyStateAbsoluteTimeStop_C::怪物战斗机制停止' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateAbsoluteTimeStop_C, 是否冻结移动效果) == 0x00004B, "Member 'UTsAnimNotifyStateAbsoluteTimeStop_C::是否冻结移动效果' has a wrong offset!");

}

