#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAnimNotifyCameraModify

#include "Basic.hpp"

#include "SCameraModifier_Condition_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCameraModifier_Settings_structs.hpp"
#include "ECameraAnsEffectiveClientType_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsAnimNotifyCameraModify.TsAnimNotifyCameraModify_C
// 0x0160 (0x01A8 - 0x0048)
class UTsAnimNotifyCameraModify_C final : public UKuroAnimNotify
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0048(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	float                                         持续时间;                                          // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         淡入时间;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         淡出时间;                                          // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         打断淡出时间;                                      // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCameraModifier_Settings              相机修改配置;                                      // 0x0068(0x0118)(Edit, BlueprintVisible, HasGetValueTypeHash)
	ECameraAnsEffectiveClientType                 生效客户端类型;                                    // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CameraAttachSocket;                                // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FSCameraModifier_Condition>     条件;                                              // 0x0198(0x0010)(Edit, BlueprintVisible)

public:
	bool K2_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

	class FString GetNotifyName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsAnimNotifyCameraModify_C">();
	}
	static class UTsAnimNotifyCameraModify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsAnimNotifyCameraModify_C>();
	}
};
static_assert(alignof(UTsAnimNotifyCameraModify_C) == 0x000008, "Wrong alignment on UTsAnimNotifyCameraModify_C");
static_assert(sizeof(UTsAnimNotifyCameraModify_C) == 0x0001A8, "Wrong size on UTsAnimNotifyCameraModify_C");
static_assert(offsetof(UTsAnimNotifyCameraModify_C, Tag) == 0x000048, "Member 'UTsAnimNotifyCameraModify_C::Tag' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyCameraModify_C, 持续时间) == 0x000054, "Member 'UTsAnimNotifyCameraModify_C::持续时间' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyCameraModify_C, 淡入时间) == 0x000058, "Member 'UTsAnimNotifyCameraModify_C::淡入时间' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyCameraModify_C, 淡出时间) == 0x00005C, "Member 'UTsAnimNotifyCameraModify_C::淡出时间' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyCameraModify_C, 打断淡出时间) == 0x000060, "Member 'UTsAnimNotifyCameraModify_C::打断淡出时间' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyCameraModify_C, 相机修改配置) == 0x000068, "Member 'UTsAnimNotifyCameraModify_C::相机修改配置' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyCameraModify_C, 生效客户端类型) == 0x000180, "Member 'UTsAnimNotifyCameraModify_C::生效客户端类型' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyCameraModify_C, CameraAttachSocket) == 0x000188, "Member 'UTsAnimNotifyCameraModify_C::CameraAttachSocket' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyCameraModify_C, 条件) == 0x000198, "Member 'UTsAnimNotifyCameraModify_C::条件' has a wrong offset!");

}

