#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAnimNotifyStateFoleyAudioEvent

#include "Basic.hpp"

#include "KuroAudio_structs.hpp"
#include "E_FoleyVariant_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsAnimNotifyStateFoleyAudioEvent.TsAnimNotifyStateFoleyAudioEvent_C
// 0x0008 (0x0050 - 0x0048)
class UTsAnimNotifyStateFoleyAudioEvent_C final : public UKuroAnimNotifyState
{
public:
	int32                                         FadeDuration;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAudioFadeCurve                               FadeCurve;                                         // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_FoleyVariant                                Variant;                                           // 0x004D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsAnimNotifyStateFoleyAudioEvent_C">();
	}
	static class UTsAnimNotifyStateFoleyAudioEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTsAnimNotifyStateFoleyAudioEvent_C>();
	}
};
static_assert(alignof(UTsAnimNotifyStateFoleyAudioEvent_C) == 0x000008, "Wrong alignment on UTsAnimNotifyStateFoleyAudioEvent_C");
static_assert(sizeof(UTsAnimNotifyStateFoleyAudioEvent_C) == 0x000050, "Wrong size on UTsAnimNotifyStateFoleyAudioEvent_C");
static_assert(offsetof(UTsAnimNotifyStateFoleyAudioEvent_C, FadeDuration) == 0x000048, "Member 'UTsAnimNotifyStateFoleyAudioEvent_C::FadeDuration' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateFoleyAudioEvent_C, FadeCurve) == 0x00004C, "Member 'UTsAnimNotifyStateFoleyAudioEvent_C::FadeCurve' has a wrong offset!");
static_assert(offsetof(UTsAnimNotifyStateFoleyAudioEvent_C, Variant) == 0x00004D, "Member 'UTsAnimNotifyStateFoleyAudioEvent_C::Variant' has a wrong offset!");

}

