#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsBaseCharacter

#include "Basic.hpp"

#include "ECharacterRenderingType_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ECharacterDitherType_structs.hpp"
#include "ECamp_structs.hpp"
#include "KuroGAS_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsBaseCharacter.TsBaseCharacter_C
// 0x0130 (0x0790 - 0x0660)
#pragma pack(push, 0x1)
class alignas(0x10) ATsBaseCharacter_C : public ABaseCharacter
{
public:
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNavigationInvokerComponent*            NavigationInvoker;                                 // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTsCharacterDebugComponent_C*           TsCharacterDebugComponent;                         // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharRenderingComponent_C*              CharRenderingComponent;                            // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FightManager_C*                     FightManager;                                      // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DtHitEffect;                                       // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DtBaseMovementSetting;                             // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           BattleSockets;                                     // 0x0698(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           NormalSockets;                                     // 0x06A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPD_CharacterControllerData_C*          WeaponInEffect;                                    // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterRenderingType                       RenderType;                                        // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             DtNewBulletDataMain;                               // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DtCharacterPart;                                   // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftClassPath                         InputComponentClass;                               // 0x06D8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UPrimaryDataAsset*                      FkData;                                            // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEffectModelBase*                       WeaponHideEffect;                                  // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UPrimaryDataAsset*                      CharacterData;                                     // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UAkComponent*>        AkComponentMap;                                    // 0x0710(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          PhysicsClothSimulateEnable;                        // 0x0760(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PhysicsClothSimulateDisableOneFrame;               // 0x0761(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CachePoseEnableOneFrame;                           // 0x0762(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_763[0x1];                                      // 0x0763(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CacheTime;                                         // 0x0764(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UDataTable*                             DtCameraConfig;                                    // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         EntityId;                                          // 0x0770(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BasePlatform_C*                     BasePlatform;                                      // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ECamp                                         Camp;                                              // 0x0780(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TsBaseCharacter(int32 EntryPoint);
	void ReceiveDestroyed();
	void K2_UpdateCustomMovement(float DeltaTime);
	void ReceiveUnpossessed(class AController* OldController);
	void ReceivePossessed(class AController* NewController);
	void K2_OnMovementModeChanged(EMovementMode PrevMovementMode, EMovementMode NewMovementMode, uint8 PrevCustomMode, uint8 NewCustomMode);
	void FightCommand(bool IsInAir);
	void Initialize();
	void SetDitherEffect(float Dither, ECharacterDitherType DitherType);
	int32 GetEntityId();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsBaseCharacter_C">();
	}
	static class ATsBaseCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATsBaseCharacter_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ATsBaseCharacter_C) == 0x000010, "Wrong alignment on ATsBaseCharacter_C");
static_assert(sizeof(ATsBaseCharacter_C) == 0x000790, "Wrong size on ATsBaseCharacter_C");
static_assert(offsetof(ATsBaseCharacter_C, UberGraphFrame) == 0x000660, "Member 'ATsBaseCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, NavigationInvoker) == 0x000668, "Member 'ATsBaseCharacter_C::NavigationInvoker' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, TsCharacterDebugComponent) == 0x000670, "Member 'ATsBaseCharacter_C::TsCharacterDebugComponent' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, CharRenderingComponent) == 0x000678, "Member 'ATsBaseCharacter_C::CharRenderingComponent' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, FightManager) == 0x000680, "Member 'ATsBaseCharacter_C::FightManager' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, DtHitEffect) == 0x000688, "Member 'ATsBaseCharacter_C::DtHitEffect' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, DtBaseMovementSetting) == 0x000690, "Member 'ATsBaseCharacter_C::DtBaseMovementSetting' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, BattleSockets) == 0x000698, "Member 'ATsBaseCharacter_C::BattleSockets' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, NormalSockets) == 0x0006A8, "Member 'ATsBaseCharacter_C::NormalSockets' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, WeaponInEffect) == 0x0006B8, "Member 'ATsBaseCharacter_C::WeaponInEffect' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, RenderType) == 0x0006C0, "Member 'ATsBaseCharacter_C::RenderType' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, DtNewBulletDataMain) == 0x0006C8, "Member 'ATsBaseCharacter_C::DtNewBulletDataMain' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, DtCharacterPart) == 0x0006D0, "Member 'ATsBaseCharacter_C::DtCharacterPart' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, InputComponentClass) == 0x0006D8, "Member 'ATsBaseCharacter_C::InputComponentClass' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, FkData) == 0x0006F8, "Member 'ATsBaseCharacter_C::FkData' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, WeaponHideEffect) == 0x000700, "Member 'ATsBaseCharacter_C::WeaponHideEffect' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, CharacterData) == 0x000708, "Member 'ATsBaseCharacter_C::CharacterData' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, AkComponentMap) == 0x000710, "Member 'ATsBaseCharacter_C::AkComponentMap' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, PhysicsClothSimulateEnable) == 0x000760, "Member 'ATsBaseCharacter_C::PhysicsClothSimulateEnable' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, PhysicsClothSimulateDisableOneFrame) == 0x000761, "Member 'ATsBaseCharacter_C::PhysicsClothSimulateDisableOneFrame' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, CachePoseEnableOneFrame) == 0x000762, "Member 'ATsBaseCharacter_C::CachePoseEnableOneFrame' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, CacheTime) == 0x000764, "Member 'ATsBaseCharacter_C::CacheTime' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, DtCameraConfig) == 0x000768, "Member 'ATsBaseCharacter_C::DtCameraConfig' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, EntityId) == 0x000770, "Member 'ATsBaseCharacter_C::EntityId' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, BasePlatform) == 0x000778, "Member 'ATsBaseCharacter_C::BasePlatform' has a wrong offset!");
static_assert(offsetof(ATsBaseCharacter_C, Camp) == 0x000780, "Member 'ATsBaseCharacter_C::Camp' has a wrong offset!");

}

