#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsEffectFunctionLibrary

#include "Basic.hpp"

#include "SEffectVectorParameter_structs.hpp"
#include "EEffectPlay_structs.hpp"
#include "EEffectType_structs.hpp"
#include "SEffectColorParameter_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SEffectFloatParameter_structs.hpp"


namespace SDK::Params
{

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.InitializeWithPreview
// 0x0010 (0x0010 - 0x0000)
struct TsEffectFunctionLibrary_C_InitializeWithPreview final
{
public:
	bool                                          refresh;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_InitializeWithPreview) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_InitializeWithPreview");
static_assert(sizeof(TsEffectFunctionLibrary_C_InitializeWithPreview) == 0x000010, "Wrong size on TsEffectFunctionLibrary_C_InitializeWithPreview");
static_assert(offsetof(TsEffectFunctionLibrary_C_InitializeWithPreview, refresh) == 0x000000, "Member 'TsEffectFunctionLibrary_C_InitializeWithPreview::refresh' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_InitializeWithPreview, __WorldContext) == 0x000008, "Member 'TsEffectFunctionLibrary_C_InitializeWithPreview::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.EditorTickHandle
// 0x0010 (0x0010 - 0x0000)
struct TsEffectFunctionLibrary_C_EditorTickHandle final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         delta;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_EditorTickHandle) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_EditorTickHandle");
static_assert(sizeof(TsEffectFunctionLibrary_C_EditorTickHandle) == 0x000010, "Wrong size on TsEffectFunctionLibrary_C_EditorTickHandle");
static_assert(offsetof(TsEffectFunctionLibrary_C_EditorTickHandle, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_EditorTickHandle::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_EditorTickHandle, delta) == 0x000004, "Member 'TsEffectFunctionLibrary_C_EditorTickHandle::delta' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_EditorTickHandle, __WorldContext) == 0x000008, "Member 'TsEffectFunctionLibrary_C_EditorTickHandle::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.PlayEffect
// 0x0030 (0x0030 - 0x0000)
struct TsEffectFunctionLibrary_C_PlayEffect final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                callObject;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 reason;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsEffectFunctionLibrary_C_PlayEffect) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_PlayEffect");
static_assert(sizeof(TsEffectFunctionLibrary_C_PlayEffect) == 0x000030, "Wrong size on TsEffectFunctionLibrary_C_PlayEffect");
static_assert(offsetof(TsEffectFunctionLibrary_C_PlayEffect, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_PlayEffect::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_PlayEffect, callObject) == 0x000008, "Member 'TsEffectFunctionLibrary_C_PlayEffect::callObject' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_PlayEffect, reason) == 0x000010, "Member 'TsEffectFunctionLibrary_C_PlayEffect::reason' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_PlayEffect, __WorldContext) == 0x000020, "Member 'TsEffectFunctionLibrary_C_PlayEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_PlayEffect, ReturnValue) == 0x000028, "Member 'TsEffectFunctionLibrary_C_PlayEffect::ReturnValue' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.GetEffectActor
// 0x0018 (0x0018 - 0x0000)
struct TsEffectFunctionLibrary_C_GetEffectActor final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_GetEffectActor) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_GetEffectActor");
static_assert(sizeof(TsEffectFunctionLibrary_C_GetEffectActor) == 0x000018, "Wrong size on TsEffectFunctionLibrary_C_GetEffectActor");
static_assert(offsetof(TsEffectFunctionLibrary_C_GetEffectActor, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_GetEffectActor::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_GetEffectActor, __WorldContext) == 0x000008, "Member 'TsEffectFunctionLibrary_C_GetEffectActor::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_GetEffectActor, ReturnValue) == 0x000010, "Member 'TsEffectFunctionLibrary_C_GetEffectActor::ReturnValue' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.StopEffect
// 0x0038 (0x0038 - 0x0000)
struct TsEffectFunctionLibrary_C_StopEffect final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                callObject;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 reason;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          immediately;                                       // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          destroyActor;                                      // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsEffectFunctionLibrary_C_StopEffect) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_StopEffect");
static_assert(sizeof(TsEffectFunctionLibrary_C_StopEffect) == 0x000038, "Wrong size on TsEffectFunctionLibrary_C_StopEffect");
static_assert(offsetof(TsEffectFunctionLibrary_C_StopEffect, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_StopEffect::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_StopEffect, callObject) == 0x000008, "Member 'TsEffectFunctionLibrary_C_StopEffect::callObject' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_StopEffect, reason) == 0x000010, "Member 'TsEffectFunctionLibrary_C_StopEffect::reason' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_StopEffect, immediately) == 0x000020, "Member 'TsEffectFunctionLibrary_C_StopEffect::immediately' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_StopEffect, destroyActor) == 0x000021, "Member 'TsEffectFunctionLibrary_C_StopEffect::destroyActor' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_StopEffect, __WorldContext) == 0x000028, "Member 'TsEffectFunctionLibrary_C_StopEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_StopEffect, ReturnValue) == 0x000030, "Member 'TsEffectFunctionLibrary_C_StopEffect::ReturnValue' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.EffectHandleIsValid
// 0x0018 (0x0018 - 0x0000)
struct TsEffectFunctionLibrary_C_EffectHandleIsValid final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsEffectFunctionLibrary_C_EffectHandleIsValid) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_EffectHandleIsValid");
static_assert(sizeof(TsEffectFunctionLibrary_C_EffectHandleIsValid) == 0x000018, "Wrong size on TsEffectFunctionLibrary_C_EffectHandleIsValid");
static_assert(offsetof(TsEffectFunctionLibrary_C_EffectHandleIsValid, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_EffectHandleIsValid::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_EffectHandleIsValid, __WorldContext) == 0x000008, "Member 'TsEffectFunctionLibrary_C_EffectHandleIsValid::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_EffectHandleIsValid, ReturnValue) == 0x000010, "Member 'TsEffectFunctionLibrary_C_EffectHandleIsValid::ReturnValue' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.AttachEffectActorToComponent
// 0x0028 (0x0028 - 0x0000)
struct TsEffectFunctionLibrary_C_AttachEffectActorToComponent final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        parent;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   socketName;                                        // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               locationRule;                                      // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               rotationRule;                                      // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               scaleRule;                                         // 0x001E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWeldSimulatedBodies;                              // 0x001F(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_AttachEffectActorToComponent");
static_assert(sizeof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent) == 0x000028, "Wrong size on TsEffectFunctionLibrary_C_AttachEffectActorToComponent");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToComponent::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent, parent) == 0x000008, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToComponent::parent' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent, socketName) == 0x000010, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToComponent::socketName' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent, locationRule) == 0x00001C, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToComponent::locationRule' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent, rotationRule) == 0x00001D, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToComponent::rotationRule' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent, scaleRule) == 0x00001E, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToComponent::scaleRule' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent, bWeldSimulatedBodies) == 0x00001F, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToComponent::bWeldSimulatedBodies' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToComponent, __WorldContext) == 0x000020, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToComponent::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SetEffectActorRelativeLocation
// 0x0030 (0x0030 - 0x0000)
struct TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          newRelativeLocation;                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSweep;                                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bTeleport;                                         // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation");
static_assert(sizeof(TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation) == 0x000030, "Wrong size on TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation, newRelativeLocation) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation::newRelativeLocation' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation, bSweep) == 0x000020, "Member 'TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation::bSweep' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation, bTeleport) == 0x000021, "Member 'TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation::bTeleport' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation, __WorldContext) == 0x000028, "Member 'TsEffectFunctionLibrary_C_SetEffectActorRelativeLocation::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SetEffectParameterNiagara
// 0x0060 (0x0060 - 0x0000)
struct TsEffectFunctionLibrary_C_SetEffectParameterNiagara final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSEffectFloatParameter>         userParameterFloat;                                // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSEffectColorParameter>         userParameterColor;                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSEffectVectorParameter>        userParameterVector;                               // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSEffectFloatParameter>         materialParameterFloat;                            // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSEffectColorParameter>         materialParameterColor;                            // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SetEffectParameterNiagara) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_SetEffectParameterNiagara");
static_assert(sizeof(TsEffectFunctionLibrary_C_SetEffectParameterNiagara) == 0x000060, "Wrong size on TsEffectFunctionLibrary_C_SetEffectParameterNiagara");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectParameterNiagara, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SetEffectParameterNiagara::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectParameterNiagara, userParameterFloat) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SetEffectParameterNiagara::userParameterFloat' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectParameterNiagara, userParameterColor) == 0x000018, "Member 'TsEffectFunctionLibrary_C_SetEffectParameterNiagara::userParameterColor' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectParameterNiagara, userParameterVector) == 0x000028, "Member 'TsEffectFunctionLibrary_C_SetEffectParameterNiagara::userParameterVector' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectParameterNiagara, materialParameterFloat) == 0x000038, "Member 'TsEffectFunctionLibrary_C_SetEffectParameterNiagara::materialParameterFloat' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectParameterNiagara, materialParameterColor) == 0x000048, "Member 'TsEffectFunctionLibrary_C_SetEffectParameterNiagara::materialParameterColor' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectParameterNiagara, __WorldContext) == 0x000058, "Member 'TsEffectFunctionLibrary_C_SetEffectParameterNiagara::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.AttachEffectActorToActor
// 0x0028 (0x0028 - 0x0000)
struct TsEffectFunctionLibrary_C_AttachEffectActorToActor final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 parent;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   socketName;                                        // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               locationRule;                                      // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               rotationRule;                                      // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachmentRule                               scaleRule;                                         // 0x001E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWeldSimulatedBodies;                              // 0x001F(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_AttachEffectActorToActor) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_AttachEffectActorToActor");
static_assert(sizeof(TsEffectFunctionLibrary_C_AttachEffectActorToActor) == 0x000028, "Wrong size on TsEffectFunctionLibrary_C_AttachEffectActorToActor");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToActor, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToActor::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToActor, parent) == 0x000008, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToActor::parent' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToActor, socketName) == 0x000010, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToActor::socketName' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToActor, locationRule) == 0x00001C, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToActor::locationRule' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToActor, rotationRule) == 0x00001D, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToActor::rotationRule' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToActor, scaleRule) == 0x00001E, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToActor::scaleRule' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToActor, bWeldSimulatedBodies) == 0x00001F, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToActor::bWeldSimulatedBodies' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_AttachEffectActorToActor, __WorldContext) == 0x000020, "Member 'TsEffectFunctionLibrary_C_AttachEffectActorToActor::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SetEffectHiddenInGame
// 0x0010 (0x0010 - 0x0000)
struct TsEffectFunctionLibrary_C_SetEffectHiddenInGame final
{
public:
	int32                                         handle1;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          value1;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SetEffectHiddenInGame) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_SetEffectHiddenInGame");
static_assert(sizeof(TsEffectFunctionLibrary_C_SetEffectHiddenInGame) == 0x000010, "Wrong size on TsEffectFunctionLibrary_C_SetEffectHiddenInGame");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectHiddenInGame, handle1) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SetEffectHiddenInGame::handle1' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectHiddenInGame, value1) == 0x000004, "Member 'TsEffectFunctionLibrary_C_SetEffectHiddenInGame::value1' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectHiddenInGame, __WorldContext) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SetEffectHiddenInGame::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SpawnEffectUI
// 0x0080 (0x0080 - 0x0000)
struct TsEffectFunctionLibrary_C_SpawnEffectUI final
{
public:
	class UObject*                                worldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                callObject;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 path;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTransformDouble                       transform;                                         // 0x0020(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class FString                                 reason;                                            // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0078(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SpawnEffectUI) == 0x000010, "Wrong alignment on TsEffectFunctionLibrary_C_SpawnEffectUI");
static_assert(sizeof(TsEffectFunctionLibrary_C_SpawnEffectUI) == 0x000080, "Wrong size on TsEffectFunctionLibrary_C_SpawnEffectUI");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectUI, worldContext) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SpawnEffectUI::worldContext' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectUI, callObject) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SpawnEffectUI::callObject' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectUI, path) == 0x000010, "Member 'TsEffectFunctionLibrary_C_SpawnEffectUI::path' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectUI, transform) == 0x000020, "Member 'TsEffectFunctionLibrary_C_SpawnEffectUI::transform' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectUI, reason) == 0x000060, "Member 'TsEffectFunctionLibrary_C_SpawnEffectUI::reason' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectUI, __WorldContext) == 0x000070, "Member 'TsEffectFunctionLibrary_C_SpawnEffectUI::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectUI, ReturnValue) == 0x000078, "Member 'TsEffectFunctionLibrary_C_SpawnEffectUI::ReturnValue' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SetEffectIgnoreVisibilityOptimize
// 0x0010 (0x0010 - 0x0000)
struct TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ignore;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize");
static_assert(sizeof(TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize) == 0x000010, "Wrong size on TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize, ignore) == 0x000004, "Member 'TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize::ignore' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize, __WorldContext) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SetEffectIgnoreVisibilityOptimize::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SetGlobalStoppingTime
// 0x0010 (0x0010 - 0x0000)
struct TsEffectFunctionLibrary_C_SetGlobalStoppingTime final
{
public:
	bool                                          stoppingTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         playTime;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SetGlobalStoppingTime) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_SetGlobalStoppingTime");
static_assert(sizeof(TsEffectFunctionLibrary_C_SetGlobalStoppingTime) == 0x000010, "Wrong size on TsEffectFunctionLibrary_C_SetGlobalStoppingTime");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetGlobalStoppingTime, stoppingTime) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SetGlobalStoppingTime::stoppingTime' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetGlobalStoppingTime, playTime) == 0x000004, "Member 'TsEffectFunctionLibrary_C_SetGlobalStoppingTime::playTime' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetGlobalStoppingTime, __WorldContext) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SetGlobalStoppingTime::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SetEffectStoppingTime
// 0x0010 (0x0010 - 0x0000)
struct TsEffectFunctionLibrary_C_SetEffectStoppingTime final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          stoppingTime;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SetEffectStoppingTime) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_SetEffectStoppingTime");
static_assert(sizeof(TsEffectFunctionLibrary_C_SetEffectStoppingTime) == 0x000010, "Wrong size on TsEffectFunctionLibrary_C_SetEffectStoppingTime");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectStoppingTime, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SetEffectStoppingTime::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectStoppingTime, stoppingTime) == 0x000004, "Member 'TsEffectFunctionLibrary_C_SetEffectStoppingTime::stoppingTime' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetEffectStoppingTime, __WorldContext) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SetEffectStoppingTime::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SetPublicToSequence
// 0x0018 (0x0018 - 0x0000)
struct TsEffectFunctionLibrary_C_SetPublicToSequence final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EffectActor_C*                      actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SetPublicToSequence) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_SetPublicToSequence");
static_assert(sizeof(TsEffectFunctionLibrary_C_SetPublicToSequence) == 0x000018, "Wrong size on TsEffectFunctionLibrary_C_SetPublicToSequence");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetPublicToSequence, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SetPublicToSequence::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetPublicToSequence, actor) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SetPublicToSequence::actor' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetPublicToSequence, __WorldContext) == 0x000010, "Member 'TsEffectFunctionLibrary_C_SetPublicToSequence::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SetSimulateFromSequence
// 0x0018 (0x0018 - 0x0000)
struct TsEffectFunctionLibrary_C_SetSimulateFromSequence final
{
public:
	int32                                         handle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EffectActor_C*                      actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SetSimulateFromSequence) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_SetSimulateFromSequence");
static_assert(sizeof(TsEffectFunctionLibrary_C_SetSimulateFromSequence) == 0x000018, "Wrong size on TsEffectFunctionLibrary_C_SetSimulateFromSequence");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetSimulateFromSequence, handle) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SetSimulateFromSequence::handle' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetSimulateFromSequence, actor) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SetSimulateFromSequence::actor' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SetSimulateFromSequence, __WorldContext) == 0x000010, "Member 'TsEffectFunctionLibrary_C_SetSimulateFromSequence::__WorldContext' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SpawnEffect
// 0x0090 (0x0090 - 0x0000)
struct TsEffectFunctionLibrary_C_SpawnEffect final
{
public:
	class UObject*                                worldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                callObject;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 path;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FTransformDouble                       transform;                                         // 0x0020(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class FString                                 reason;                                            // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EEffectPlay                                   playType;                                          // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          disablePostProcess;                                // 0x0071(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0080(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SpawnEffect) == 0x000010, "Wrong alignment on TsEffectFunctionLibrary_C_SpawnEffect");
static_assert(sizeof(TsEffectFunctionLibrary_C_SpawnEffect) == 0x000090, "Wrong size on TsEffectFunctionLibrary_C_SpawnEffect");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffect, worldContext) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SpawnEffect::worldContext' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffect, callObject) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SpawnEffect::callObject' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffect, path) == 0x000010, "Member 'TsEffectFunctionLibrary_C_SpawnEffect::path' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffect, transform) == 0x000020, "Member 'TsEffectFunctionLibrary_C_SpawnEffect::transform' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffect, reason) == 0x000060, "Member 'TsEffectFunctionLibrary_C_SpawnEffect::reason' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffect, playType) == 0x000070, "Member 'TsEffectFunctionLibrary_C_SpawnEffect::playType' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffect, disablePostProcess) == 0x000071, "Member 'TsEffectFunctionLibrary_C_SpawnEffect::disablePostProcess' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffect, __WorldContext) == 0x000078, "Member 'TsEffectFunctionLibrary_C_SpawnEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffect, ReturnValue) == 0x000080, "Member 'TsEffectFunctionLibrary_C_SpawnEffect::ReturnValue' has a wrong offset!");

// Function TsEffectFunctionLibrary.TsEffectFunctionLibrary_C.SpawnEffectWithActor
// 0x0050 (0x0050 - 0x0000)
struct TsEffectFunctionLibrary_C_SpawnEffectWithActor final
{
public:
	class UObject*                                worldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                callObject;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 effectActor;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 path;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 reason;                                            // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EEffectPlay                                   playType;                                          // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEffectType                                   effectType;                                        // 0x0039(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          disablePostProcess;                                // 0x003A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsEffectFunctionLibrary_C_SpawnEffectWithActor) == 0x000008, "Wrong alignment on TsEffectFunctionLibrary_C_SpawnEffectWithActor");
static_assert(sizeof(TsEffectFunctionLibrary_C_SpawnEffectWithActor) == 0x000050, "Wrong size on TsEffectFunctionLibrary_C_SpawnEffectWithActor");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectWithActor, worldContext) == 0x000000, "Member 'TsEffectFunctionLibrary_C_SpawnEffectWithActor::worldContext' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectWithActor, callObject) == 0x000008, "Member 'TsEffectFunctionLibrary_C_SpawnEffectWithActor::callObject' has a wrong offset!");
static_assert(offsetof(TsEffectFunctionLibrary_C_SpawnEffectWithActor, effectActor) == 0x000010, "Member 'TsEffectFunctionLibrary_C_SpawnEffectWithActor::effectActor' has a wrong offset!");
