#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsGameplayBlueprintFunctionLibrary

#include "Basic.hpp"

#include "EFishingSkillType_structs.hpp"
#include "SSkillBehaviorAction_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ECharacterLoadType_structs.hpp"
#include "SSkillBehaviorCondition_structs.hpp"
#include "EHookInteractTypeBp_structs.hpp"
#include "ESkillTargetDirection_structs.hpp"
#include "EVisionType_structs.hpp"
#include "EHitAnim_structs.hpp"
#include "SVisionCounterAttack_structs.hpp"
#include "EAimViewState_structs.hpp"
#include "Engine_structs.hpp"
#include "ECharViewDirectionState_structs.hpp"
#include "ECharParentMoveState_structs.hpp"
#include "ECharState_structs.hpp"
#include "SSkillInfo_structs.hpp"
#include "SCounterAttackBuff_structs.hpp"
#include "SCounterAttack_structs.hpp"
#include "SHitInformation_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.ContainsTag
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_ContainsTag final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           tag;                                               // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_ContainsTag) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_ContainsTag");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_ContainsTag) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_ContainsTag");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_ContainsTag, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_ContainsTag::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_ContainsTag, tag) == 0x000004, "Member 'TsGameplayBlueprintFunctionLibrary_C_ContainsTag::tag' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_ContainsTag, __WorldContext) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_ContainsTag::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_ContainsTag, ReturnValue) == 0x000018, "Member 'TsGameplayBlueprintFunctionLibrary_C_ContainsTag::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.AddTag
// 0x0018 (0x0018 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_AddTag final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           tag;                                               // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_AddTag) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_AddTag");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_AddTag) == 0x000018, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_AddTag");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTag, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTag::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTag, tag) == 0x000004, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTag::tag' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTag, __WorldContext) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTag::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.AddTagWithDuration
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         duration;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           tag;                                               // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration, duration) == 0x000004, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration::duration' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration, tag) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration::tag' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration, __WorldContext) == 0x000018, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTagWithDuration::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.AddTagByName
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_AddTagByName final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 tagName;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_AddTagByName) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_AddTagByName");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_AddTagByName) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_AddTagByName");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTagByName, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTagByName::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTagByName, tagName) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTagByName::tagName' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddTagByName, __WorldContext) == 0x000018, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddTagByName::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.RemoveTag
// 0x0018 (0x0018 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_RemoveTag final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           tag;                                               // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_RemoveTag) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_RemoveTag");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_RemoveTag) == 0x000018, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_RemoveTag");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveTag, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveTag::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveTag, tag) == 0x000004, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveTag::tag' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveTag, __WorldContext) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveTag::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.RemoveTagByName
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 tagName;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName, tagName) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName::tagName' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName, __WorldContext) == 0x000018, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveTagByName::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.IsLogicAutonomousProxy
// 0x0018 (0x0018 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy) == 0x000018, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_IsLogicAutonomousProxy::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.RemoveActiveGameplayEffect
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            handle;                                            // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         stacksToRemove;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect, handle) == 0x000004, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect::handle' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect, stacksToRemove) == 0x00000C, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect::stacksToRemove' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect, __WorldContext) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect, ReturnValue) == 0x000018, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveActiveGameplayEffect::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.RemoveBuffByTag
// 0x0018 (0x0018 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           tag;                                               // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag) == 0x000018, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag, tag) == 0x000004, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag::tag' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag, __WorldContext) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveBuffByTag::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.AddPassiveSkill
// 0x0018 (0x0018 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         passiveSkillId;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill) == 0x000018, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill, passiveSkillId) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill::passiveSkillId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill, __WorldContext) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddPassiveSkill::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.RemovePassiveSkill
// 0x0018 (0x0018 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         passiveSkillId;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill) == 0x000018, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill, passiveSkillId) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill::passiveSkillId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill, __WorldContext) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemovePassiveSkill::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.AddBuffForDebug
// 0x0018 (0x0018 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug final
{
public:
	int32                                         instigatorEntityId;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         targetEntityId;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         buffId;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug) == 0x000018, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug, instigatorEntityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug::instigatorEntityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug, targetEntityId) == 0x000004, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug::targetEntityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug, buffId) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug::buffId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug, __WorldContext) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddBuffForDebug::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.RemoveBuffById
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         buffId;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         stackCount;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById, buffId) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById::buffId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById, stackCount) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById::stackCount' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById, __WorldContext) == 0x000018, "Member 'TsGameplayBlueprintFunctionLibrary_C_RemoveBuffById::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetBuffCountById
// 0x0028 (0x0028 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         buffId;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          enforceOnGoingCheck;                               // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById) == 0x000028, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById, buffId) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById::buffId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById, enforceOnGoingCheck) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById::enforceOnGoingCheck' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById, __WorldContext) == 0x000018, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById, ReturnValue) == 0x000020, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetBuffCountById::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.AddGameplayCueLocal
// 0x0018 (0x0018 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         duration;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         cueId;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal) == 0x000018, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal, duration) == 0x000004, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal::duration' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal, cueId) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal::cueId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal, __WorldContext) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_AddGameplayCueLocal::__WorldContext' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetGeDebugString
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetGeDebugString::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetTagDebugStrings
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetTagDebugStrings::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetBuffDebugStrings
// 0x0030 (0x0030 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 buffStr;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings) == 0x000030, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings, buffStr) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings::buffStr' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings, __WorldContext) == 0x000018, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings, ReturnValue) == 0x000020, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetBuffDebugStrings::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetShieldDebugString
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetShieldDebugString::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetPassiveSkillDebugString
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetPassiveSkillDebugString::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetShieldValue
// 0x0018 (0x0018 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetShieldValue final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         shieldCid;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetShieldValue) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetShieldValue");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetShieldValue) == 0x000018, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetShieldValue");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetShieldValue, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetShieldValue::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetShieldValue, shieldCid) == 0x000004, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetShieldValue::shieldCid' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetShieldValue, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetShieldValue::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetShieldValue, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetShieldValue::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetAttributeDebugString
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetAttributeDebugString::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetAllAttributeDebugStrings
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetAllAttributeDebugStrings::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetServerBuffString
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerBuffString::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetServerTagString
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetServerTagString final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetServerTagString) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetServerTagString");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetServerTagString) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetServerTagString");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerTagString, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerTagString::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerTagString, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerTagString::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerTagString, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerTagString::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetServerAttributeString
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerAttributeString::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetServerPartString
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetServerPartString final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetServerPartString) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetServerPartString");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetServerPartString) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetServerPartString");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerPartString, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerPartString::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerPartString, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerPartString::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerPartString, ReturnValue) == 0x000010, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerPartString::ReturnValue' has a wrong offset!");

// Function TsGameplayBlueprintFunctionLibrary.TsGameplayBlueprintFunctionLibrary_C.GetServerHateString
// 0x0020 (0x0020 - 0x0000)
struct TsGameplayBlueprintFunctionLibrary_C_GetServerHateString final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(TsGameplayBlueprintFunctionLibrary_C_GetServerHateString) == 0x000008, "Wrong alignment on TsGameplayBlueprintFunctionLibrary_C_GetServerHateString");
static_assert(sizeof(TsGameplayBlueprintFunctionLibrary_C_GetServerHateString) == 0x000020, "Wrong size on TsGameplayBlueprintFunctionLibrary_C_GetServerHateString");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerHateString, entityId) == 0x000000, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerHateString::entityId' has a wrong offset!");
static_assert(offsetof(TsGameplayBlueprintFunctionLibrary_C_GetServerHateString, __WorldContext) == 0x000008, "Member 'TsGameplayBlueprintFunctionLibrary_C_GetServerHateString::__WorldContext' has a wrong offset!");
