#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsMoveBlueprintFunctionLibrary

#include "Basic.hpp"

#include "EEnterClimb_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SClimbInfo_structs.hpp"
#include "EExitClimb_structs.hpp"
#include "EMovementDirection_structs.hpp"
#include "EClimbState_structs.hpp"
#include "SMovementSetting_structs.hpp"
#include "SClimbState_structs.hpp"
#include "Engine_structs.hpp"
#include "SMovementSetting_State_structs.hpp"


namespace SDK::Params
{

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.SetActorRotationWithPriority
// 0x0038 (0x0038 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               value;                                             // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          sweep;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 context;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority) == 0x000038, "Wrong size on TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority, value) == 0x000004, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority::value' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority, sweep) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority::sweep' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority, context) == 0x000018, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority::context' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority, __WorldContext) == 0x000028, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority, ReturnValue) == 0x000030, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithPriority::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.SetActorRotationWithContext
// 0x0038 (0x0038 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               rotation;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          sweep;                                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 context;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext) == 0x000038, "Wrong size on TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext, rotation) == 0x000004, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext::rotation' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext, sweep) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext::sweep' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext, context) == 0x000018, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext::context' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext, __WorldContext) == 0x000028, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext, ReturnValue) == 0x000030, "Member 'TsMoveBlueprintFunctionLibrary_C_SetActorRotationWithContext::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.ActorTeleportToWithContext
// 0x0048 (0x0048 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               rotation;                                          // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 context;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext) == 0x000048, "Wrong size on TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext, location) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext::location' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext, rotation) == 0x000020, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext::rotation' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext, context) == 0x000030, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext::context' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext, __WorldContext) == 0x000040, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorTeleportToWithContext::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.ActorKuroMoveAlongFloorWithContext
// 0x0030 (0x0030 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                velocity;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         deltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 context;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext) == 0x000030, "Wrong size on TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext, velocity) == 0x000004, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext::velocity' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext, deltaSeconds) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext::deltaSeconds' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext, context) == 0x000018, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext::context' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext, __WorldContext) == 0x000028, "Member 'TsMoveBlueprintFunctionLibrary_C_ActorKuroMoveAlongFloorWithContext::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.GetInputDirect
// 0x0028 (0x0028 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_GetInputDirect final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_GetInputDirect) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_GetInputDirect");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_GetInputDirect) == 0x000028, "Wrong size on TsMoveBlueprintFunctionLibrary_C_GetInputDirect");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetInputDirect, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_GetInputDirect::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetInputDirect, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_GetInputDirect::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetInputDirect, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_GetInputDirect::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.SetInputDirect
// 0x0028 (0x0028 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_SetInputDirect final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          direct;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_SetInputDirect) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_SetInputDirect");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_SetInputDirect) == 0x000028, "Wrong size on TsMoveBlueprintFunctionLibrary_C_SetInputDirect");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetInputDirect, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_SetInputDirect::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetInputDirect, direct) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_SetInputDirect::direct' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetInputDirect, __WorldContext) == 0x000020, "Member 'TsMoveBlueprintFunctionLibrary_C_SetInputDirect::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.GetInputRotator
// 0x0020 (0x0020 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_GetInputRotator final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_GetInputRotator) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_GetInputRotator");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_GetInputRotator) == 0x000020, "Wrong size on TsMoveBlueprintFunctionLibrary_C_GetInputRotator");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetInputRotator, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_GetInputRotator::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetInputRotator, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_GetInputRotator::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetInputRotator, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_GetInputRotator::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.SetInputRotator
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_SetInputRotator final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FRotator                               rotator;                                           // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_SetInputRotator) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_SetInputRotator");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_SetInputRotator) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_SetInputRotator");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetInputRotator, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_SetInputRotator::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetInputRotator, rotator) == 0x000004, "Member 'TsMoveBlueprintFunctionLibrary_C_SetInputRotator::rotator' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetInputRotator, __WorldContext) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_SetInputRotator::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.SetCharacterHidden
// 0x0028 (0x0028 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          isHidden;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                callObject;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 reason;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden) == 0x000028, "Wrong size on TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden, isHidden) == 0x000004, "Member 'TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden::isHidden' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden, callObject) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden::callObject' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden, reason) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden::reason' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden, __WorldContext) == 0x000020, "Member 'TsMoveBlueprintFunctionLibrary_C_SetCharacterHidden::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.SetHiddenMovementMode
// 0x0010 (0x0010 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          isHidden;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode) == 0x000010, "Wrong size on TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode, isHidden) == 0x000004, "Member 'TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode::isHidden' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_SetHiddenMovementMode::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.CanResponseInput
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_CanResponseInput final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_CanResponseInput) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_CanResponseInput");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_CanResponseInput) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_CanResponseInput");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_CanResponseInput, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_CanResponseInput::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_CanResponseInput, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_CanResponseInput::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_CanResponseInput, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_CanResponseInput::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.CanJumpPress
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_CanJumpPress final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_CanJumpPress) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_CanJumpPress");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_CanJumpPress) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_CanJumpPress");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_CanJumpPress, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_CanJumpPress::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_CanJumpPress, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_CanJumpPress::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_CanJumpPress, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_CanJumpPress::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.CanWalkPress
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_CanWalkPress final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_CanWalkPress) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_CanWalkPress");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_CanWalkPress) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_CanWalkPress");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_CanWalkPress, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_CanWalkPress::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_CanWalkPress, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_CanWalkPress::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_CanWalkPress, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_CanWalkPress::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.GetAimYawRate
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_GetAimYawRate final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_GetAimYawRate) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_GetAimYawRate");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_GetAimYawRate) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_GetAimYawRate");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetAimYawRate, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_GetAimYawRate::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetAimYawRate, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_GetAimYawRate::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetAimYawRate, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_GetAimYawRate::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.GetMovementData
// 0x0648 (0x0648 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_GetMovementData final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSMovementSetting_State                ReturnValue;                                       // 0x0010(0x0638)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_GetMovementData) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_GetMovementData");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_GetMovementData) == 0x000648, "Wrong size on TsMoveBlueprintFunctionLibrary_C_GetMovementData");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetMovementData, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_GetMovementData::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetMovementData, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_GetMovementData::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetMovementData, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_GetMovementData::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.SmoothCharacterRotation
// 0x0030 (0x0030 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FRotator                               target;                                            // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         speed;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 context;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation) == 0x000030, "Wrong size on TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation, target) == 0x000004, "Member 'TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation::target' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation, speed) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation::speed' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation, context) == 0x000018, "Member 'TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation::context' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation, __WorldContext) == 0x000028, "Member 'TsMoveBlueprintFunctionLibrary_C_SmoothCharacterRotation::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.HasMoveInput
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_HasMoveInput final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_HasMoveInput) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_HasMoveInput");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_HasMoveInput) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_HasMoveInput");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_HasMoveInput, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_HasMoveInput::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_HasMoveInput, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_HasMoveInput::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_HasMoveInput, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_HasMoveInput::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.HasRotatorInput
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_HasRotatorInput final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_HasRotatorInput) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_HasRotatorInput");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_HasRotatorInput) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_HasRotatorInput");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_HasRotatorInput, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_HasRotatorInput::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_HasRotatorInput, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_HasRotatorInput::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_HasRotatorInput, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_HasRotatorInput::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.IsMoving
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_IsMoving final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_IsMoving) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_IsMoving");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_IsMoving) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_IsMoving");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_IsMoving, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_IsMoving::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_IsMoving, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_IsMoving::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_IsMoving, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_IsMoving::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.IsJump
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_IsJump final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_IsJump) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_IsJump");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_IsJump) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_IsJump");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_IsJump, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_IsJump::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_IsJump, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_IsJump::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_IsJump, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_IsJump::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.GetSpeed
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_GetSpeed final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_GetSpeed) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_GetSpeed");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_GetSpeed) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_GetSpeed");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetSpeed, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_GetSpeed::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetSpeed, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_GetSpeed::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetSpeed, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_GetSpeed::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.GetGroundedTime
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_GetGroundedTime final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_GetGroundedTime) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_GetGroundedTime");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_GetGroundedTime) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_GetGroundedTime");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetGroundedTime, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_GetGroundedTime::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetGroundedTime, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_GetGroundedTime::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_GetGroundedTime, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_GetGroundedTime::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.IsFallingIntoWater
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater, __WorldContext) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater::__WorldContext' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater, ReturnValue) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_IsFallingIntoWater::ReturnValue' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.SetForceSpeed
// 0x0028 (0x0028 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_SetForceSpeed final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          speed;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_SetForceSpeed) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_SetForceSpeed");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_SetForceSpeed) == 0x000028, "Wrong size on TsMoveBlueprintFunctionLibrary_C_SetForceSpeed");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetForceSpeed, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_SetForceSpeed::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetForceSpeed, speed) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_SetForceSpeed::speed' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetForceSpeed, __WorldContext) == 0x000020, "Member 'TsMoveBlueprintFunctionLibrary_C_SetForceSpeed::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.SetAddMove
// 0x0040 (0x0040 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_SetAddMove final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          speed;                                             // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         timeLength;                                        // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            curve;                                             // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_SetAddMove) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_SetAddMove");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_SetAddMove) == 0x000040, "Wrong size on TsMoveBlueprintFunctionLibrary_C_SetAddMove");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetAddMove, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_SetAddMove::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetAddMove, mesh) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_SetAddMove::mesh' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetAddMove, speed) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_SetAddMove::speed' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetAddMove, timeLength) == 0x000028, "Member 'TsMoveBlueprintFunctionLibrary_C_SetAddMove::timeLength' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetAddMove, curve) == 0x000030, "Member 'TsMoveBlueprintFunctionLibrary_C_SetAddMove::curve' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_SetAddMove, __WorldContext) == 0x000038, "Member 'TsMoveBlueprintFunctionLibrary_C_SetAddMove::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.StopAddMove
// 0x0018 (0x0018 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_StopAddMove final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_StopAddMove) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_StopAddMove");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_StopAddMove) == 0x000018, "Wrong size on TsMoveBlueprintFunctionLibrary_C_StopAddMove");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_StopAddMove, entityId) == 0x000000, "Member 'TsMoveBlueprintFunctionLibrary_C_StopAddMove::entityId' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_StopAddMove, mesh) == 0x000008, "Member 'TsMoveBlueprintFunctionLibrary_C_StopAddMove::mesh' has a wrong offset!");
static_assert(offsetof(TsMoveBlueprintFunctionLibrary_C_StopAddMove, __WorldContext) == 0x000010, "Member 'TsMoveBlueprintFunctionLibrary_C_StopAddMove::__WorldContext' has a wrong offset!");

// Function TsMoveBlueprintFunctionLibrary.TsMoveBlueprintFunctionLibrary_C.FixActorLocation
// 0x00C8 (0x00C8 - 0x0000)
struct TsMoveBlueprintFunctionLibrary_C_FixActorLocation final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVectorDouble                          target;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         offset;                                            // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             ReturnValue;                                       // 0x0030(0x0094)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TsMoveBlueprintFunctionLibrary_C_FixActorLocation) == 0x000008, "Wrong alignment on TsMoveBlueprintFunctionLibrary_C_FixActorLocation");
static_assert(sizeof(TsMoveBlueprintFunctionLibrary_C_FixActorLocation) == 0x0000C8, "Wrong size on TsMoveBlueprintFunctionLibrary_C_FixActorLocation");
