#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsPhotographer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsPhotographer.TsPhotographer_C
// 0x0018 (0x02C8 - 0x02B0)
class ATsPhotographer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpringArmComponent*                    CameraArm;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleCollision;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TsPhotographer(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveDestroyed();
	void AddSourceYawInput(float yaw);
	void SetCameraInitializeTransform(const struct FTransform& transform);
	struct FTransform GetCameraInitializeTransform();
	void SetFov(float length);
	float GetFov();
	void ResetCamera();
	void AddSourcePitchInput(float pitch);
	void SetPlayerSourceLocation(const struct FVector& location);
	void Initialize();
	void RefreshDitherEffect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsPhotographer_C">();
	}
	static class ATsPhotographer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATsPhotographer_C>();
	}
};
static_assert(alignof(ATsPhotographer_C) == 0x000008, "Wrong alignment on ATsPhotographer_C");
static_assert(sizeof(ATsPhotographer_C) == 0x0002C8, "Wrong size on ATsPhotographer_C");
static_assert(offsetof(ATsPhotographer_C, UberGraphFrame) == 0x0002B0, "Member 'ATsPhotographer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATsPhotographer_C, CameraArm) == 0x0002B8, "Member 'ATsPhotographer_C::CameraArm' has a wrong offset!");
static_assert(offsetof(ATsPhotographer_C, CapsuleCollision) == 0x0002C0, "Member 'ATsPhotographer_C::CapsuleCollision' has a wrong offset!");

}

