#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldFunctionLibrary

#include "Basic.hpp"

#include "EInputAction_structs.hpp"
#include "EPawnChannel_structs.hpp"
#include "EInputState_structs.hpp"
#include "EWeatherState_structs.hpp"
#include "Engine_structs.hpp"
#include "EDetachType_structs.hpp"
#include "ERelation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EWuYinQuState_structs.hpp"


namespace SDK::Params
{

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.AddPublicTags
// 0x0020 (0x0020 - 0x0000)
struct WorldFunctionLibrary_C_AddPublicTags final
{
public:
	float                                         entityId1;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         tags1;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_AddPublicTags) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_AddPublicTags");
static_assert(sizeof(WorldFunctionLibrary_C_AddPublicTags) == 0x000020, "Wrong size on WorldFunctionLibrary_C_AddPublicTags");
static_assert(offsetof(WorldFunctionLibrary_C_AddPublicTags, entityId1) == 0x000000, "Member 'WorldFunctionLibrary_C_AddPublicTags::entityId1' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_AddPublicTags, tags1) == 0x000008, "Member 'WorldFunctionLibrary_C_AddPublicTags::tags1' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_AddPublicTags, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_AddPublicTags::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.RemovePublicTags
// 0x0020 (0x0020 - 0x0000)
struct WorldFunctionLibrary_C_RemovePublicTags final
{
public:
	float                                         entityId1;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         tags1;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_RemovePublicTags) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_RemovePublicTags");
static_assert(sizeof(WorldFunctionLibrary_C_RemovePublicTags) == 0x000020, "Wrong size on WorldFunctionLibrary_C_RemovePublicTags");
static_assert(offsetof(WorldFunctionLibrary_C_RemovePublicTags, entityId1) == 0x000000, "Member 'WorldFunctionLibrary_C_RemovePublicTags::entityId1' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_RemovePublicTags, tags1) == 0x000008, "Member 'WorldFunctionLibrary_C_RemovePublicTags::tags1' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_RemovePublicTags, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_RemovePublicTags::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetIntValueByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_GetIntValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_GetIntValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetIntValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetIntValueByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_GetIntValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetIntValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetIntValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValueByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetIntValueByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValueByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetIntValueByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetIntValueByEntityWithCharacter
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter final
{
public:
	class ATsBaseCharacter_C*                     entity;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter");
static_assert(sizeof(WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter) == 0x000028, "Wrong size on WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter, entity) == 0x000000, "Member 'WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter::entity' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetIntValueByEntityWithCharacter::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.SetIntValueByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_SetIntValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         value;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_SetIntValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_SetIntValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_SetIntValueByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_SetIntValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_SetIntValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_SetIntValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetIntValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_SetIntValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetIntValueByEntity, value) == 0x000018, "Member 'WorldFunctionLibrary_C_SetIntValueByEntity::value' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetIntValueByEntity, __WorldContext) == 0x000020, "Member 'WorldFunctionLibrary_C_SetIntValueByEntity::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.SetIntValueByEntityWithCharacter
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter final
{
public:
	class ATsBaseCharacter_C*                     entity;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         value;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter");
static_assert(sizeof(WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter) == 0x000028, "Wrong size on WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter");
static_assert(offsetof(WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter, entity) == 0x000000, "Member 'WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter::entity' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter, key) == 0x000008, "Member 'WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter, value) == 0x000018, "Member 'WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter::value' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter, __WorldContext) == 0x000020, "Member 'WorldFunctionLibrary_C_SetIntValueByEntityWithCharacter::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetIntValuesByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_GetIntValuesByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WorldFunctionLibrary_C_GetIntValuesByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetIntValuesByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetIntValuesByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_GetIntValuesByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValuesByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetIntValuesByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValuesByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetIntValuesByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValuesByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetIntValuesByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetIntValuesByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetIntValuesByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetLongValueByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_GetLongValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_GetLongValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetLongValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetLongValueByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_GetLongValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetLongValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetLongValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetLongValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetLongValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetLongValueByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetLongValueByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetLongValueByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetLongValueByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.SetLongValueByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_SetLongValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int64                                         value;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_SetLongValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_SetLongValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_SetLongValueByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_SetLongValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_SetLongValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_SetLongValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetLongValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_SetLongValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetLongValueByEntity, value) == 0x000018, "Member 'WorldFunctionLibrary_C_SetLongValueByEntity::value' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetLongValueByEntity, __WorldContext) == 0x000020, "Member 'WorldFunctionLibrary_C_SetLongValueByEntity::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetLongValuesByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_GetLongValuesByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WorldFunctionLibrary_C_GetLongValuesByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetLongValuesByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetLongValuesByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_GetLongValuesByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetLongValuesByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetLongValuesByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetLongValuesByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetLongValuesByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetLongValuesByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetLongValuesByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetLongValuesByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetLongValuesByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetBooleanValueByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_GetBooleanValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WorldFunctionLibrary_C_GetBooleanValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetBooleanValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetBooleanValueByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_GetBooleanValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetBooleanValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetBooleanValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetBooleanValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetBooleanValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetBooleanValueByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetBooleanValueByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetBooleanValueByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetBooleanValueByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.SetBooleanValueByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_SetBooleanValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          value;                                             // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_SetBooleanValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_SetBooleanValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_SetBooleanValueByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_SetBooleanValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_SetBooleanValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_SetBooleanValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetBooleanValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_SetBooleanValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetBooleanValueByEntity, value) == 0x000018, "Member 'WorldFunctionLibrary_C_SetBooleanValueByEntity::value' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetBooleanValueByEntity, __WorldContext) == 0x000020, "Member 'WorldFunctionLibrary_C_SetBooleanValueByEntity::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetFloatValueByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_GetFloatValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_GetFloatValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetFloatValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetFloatValueByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_GetFloatValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetFloatValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetFloatValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetFloatValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetFloatValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetFloatValueByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetFloatValueByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetFloatValueByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetFloatValueByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.SetFloatValueByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_SetFloatValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         value;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_SetFloatValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_SetFloatValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_SetFloatValueByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_SetFloatValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_SetFloatValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_SetFloatValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetFloatValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_SetFloatValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetFloatValueByEntity, value) == 0x000018, "Member 'WorldFunctionLibrary_C_SetFloatValueByEntity::value' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetFloatValueByEntity, __WorldContext) == 0x000020, "Member 'WorldFunctionLibrary_C_SetFloatValueByEntity::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetFloatValuesByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_GetFloatValuesByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WorldFunctionLibrary_C_GetFloatValuesByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetFloatValuesByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetFloatValuesByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_GetFloatValuesByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetFloatValuesByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetFloatValuesByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetFloatValuesByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetFloatValuesByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetFloatValuesByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetFloatValuesByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetFloatValuesByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetFloatValuesByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetStringValueByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_GetStringValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_GetStringValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetStringValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetStringValueByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_GetStringValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetStringValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetStringValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetStringValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetStringValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetStringValueByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetStringValueByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetStringValueByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetStringValueByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.SetStringValueByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_SetStringValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 value;                                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_SetStringValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_SetStringValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_SetStringValueByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_SetStringValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_SetStringValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_SetStringValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetStringValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_SetStringValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetStringValueByEntity, value) == 0x000018, "Member 'WorldFunctionLibrary_C_SetStringValueByEntity::value' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetStringValueByEntity, __WorldContext) == 0x000028, "Member 'WorldFunctionLibrary_C_SetStringValueByEntity::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetStringValuesByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_GetStringValuesByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WorldFunctionLibrary_C_GetStringValuesByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetStringValuesByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetStringValuesByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_GetStringValuesByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetStringValuesByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetStringValuesByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetStringValuesByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetStringValuesByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetStringValuesByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetStringValuesByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetStringValuesByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetStringValuesByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.RemoveValueByEntity
// 0x0020 (0x0020 - 0x0000)
struct WorldFunctionLibrary_C_RemoveValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_RemoveValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_RemoveValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_RemoveValueByEntity) == 0x000020, "Wrong size on WorldFunctionLibrary_C_RemoveValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_RemoveValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_RemoveValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_RemoveValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_RemoveValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_RemoveValueByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_RemoveValueByEntity::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.HasValueByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_HasValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WorldFunctionLibrary_C_HasValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_HasValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_HasValueByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_HasValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_HasValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_HasValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_HasValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_HasValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_HasValueByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_HasValueByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_HasValueByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_HasValueByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetVectorValueByEntity
// 0x0038 (0x0038 - 0x0000)
struct WorldFunctionLibrary_C_GetVectorValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorDouble                          ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_GetVectorValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetVectorValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetVectorValueByEntity) == 0x000038, "Wrong size on WorldFunctionLibrary_C_GetVectorValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetVectorValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetVectorValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetVectorValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetVectorValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetVectorValueByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetVectorValueByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetVectorValueByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetVectorValueByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.SetVectorValueByEntity
// 0x0038 (0x0038 - 0x0000)
struct WorldFunctionLibrary_C_SetVectorValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FVectorDouble                          value;                                             // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_SetVectorValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_SetVectorValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_SetVectorValueByEntity) == 0x000038, "Wrong size on WorldFunctionLibrary_C_SetVectorValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_SetVectorValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_SetVectorValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetVectorValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_SetVectorValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetVectorValueByEntity, value) == 0x000018, "Member 'WorldFunctionLibrary_C_SetVectorValueByEntity::value' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetVectorValueByEntity, __WorldContext) == 0x000030, "Member 'WorldFunctionLibrary_C_SetVectorValueByEntity::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetVectorValuesByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_GetVectorValuesByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVectorDouble>                  ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WorldFunctionLibrary_C_GetVectorValuesByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetVectorValuesByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetVectorValuesByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_GetVectorValuesByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetVectorValuesByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetVectorValuesByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetVectorValuesByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetVectorValuesByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetVectorValuesByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetVectorValuesByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetVectorValuesByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetVectorValuesByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetRotatorValueByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_GetRotatorValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x0020(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WorldFunctionLibrary_C_GetRotatorValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetRotatorValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetRotatorValueByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_GetRotatorValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetRotatorValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetRotatorValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetRotatorValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetRotatorValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetRotatorValueByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetRotatorValueByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetRotatorValueByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetRotatorValueByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.SetRotatorValueByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_SetRotatorValueByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               value;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_SetRotatorValueByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_SetRotatorValueByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_SetRotatorValueByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_SetRotatorValueByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_SetRotatorValueByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_SetRotatorValueByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetRotatorValueByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_SetRotatorValueByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetRotatorValueByEntity, value) == 0x000018, "Member 'WorldFunctionLibrary_C_SetRotatorValueByEntity::value' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_SetRotatorValueByEntity, __WorldContext) == 0x000028, "Member 'WorldFunctionLibrary_C_SetRotatorValueByEntity::__WorldContext' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetRotatorValuesByEntity
// 0x0030 (0x0030 - 0x0000)
struct WorldFunctionLibrary_C_GetRotatorValuesByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRotator>                       ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WorldFunctionLibrary_C_GetRotatorValuesByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetRotatorValuesByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetRotatorValuesByEntity) == 0x000030, "Wrong size on WorldFunctionLibrary_C_GetRotatorValuesByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetRotatorValuesByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetRotatorValuesByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetRotatorValuesByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetRotatorValuesByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetRotatorValuesByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetRotatorValuesByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetRotatorValuesByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetRotatorValuesByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.GetEntityIdByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_GetEntityIdByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 key;                                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WorldFunctionLibrary_C_GetEntityIdByEntity) == 0x000008, "Wrong alignment on WorldFunctionLibrary_C_GetEntityIdByEntity");
static_assert(sizeof(WorldFunctionLibrary_C_GetEntityIdByEntity) == 0x000028, "Wrong size on WorldFunctionLibrary_C_GetEntityIdByEntity");
static_assert(offsetof(WorldFunctionLibrary_C_GetEntityIdByEntity, entityId) == 0x000000, "Member 'WorldFunctionLibrary_C_GetEntityIdByEntity::entityId' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetEntityIdByEntity, key) == 0x000008, "Member 'WorldFunctionLibrary_C_GetEntityIdByEntity::key' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetEntityIdByEntity, __WorldContext) == 0x000018, "Member 'WorldFunctionLibrary_C_GetEntityIdByEntity::__WorldContext' has a wrong offset!");
static_assert(offsetof(WorldFunctionLibrary_C_GetEntityIdByEntity, ReturnValue) == 0x000020, "Member 'WorldFunctionLibrary_C_GetEntityIdByEntity::ReturnValue' has a wrong offset!");

// Function WorldFunctionLibrary.WorldFunctionLibrary_C.SetEntityIdByEntity
// 0x0028 (0x0028 - 0x0000)
struct WorldFunctionLibrary_C_SetEntityIdByEntity final
{
public:
	int32                                         entityId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
